$VAR1 = {
          'ABI_DUMPER_VERSION' => '0.99.19',
          'ABI_DUMP_VERSION' => '3.3',
          'Arch' => 'x86_64',
          'GccVersion' => '4.8.5',
          'Headers' => {
                         'serf.h' => 1,
                         'serf_bucket_types.h' => 1,
                         'serf_bucket_util.h' => 1,
                         'serf_private.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libserf-1.so.0.0.0',
          'LibraryVersion' => '1.0.0',
          'NameSpaces' => {},
          'Needed' => {
                        'libapr-1.so.0' => 1,
                        'libaprutil-1.so.0' => 1,
                        'libc.so.6' => 1,
                        'libcrypto.so.1.0.0' => 1,
                        'libdb-4.8.so' => 1,
                        'libdl.so.2' => 1,
                        'libexpat.so.1' => 1,
                        'liblber-2.4.so.2' => 1,
                        'libldap-2.4.so.2' => 1,
                        'libm.so.6' => 1,
                        'libpthread.so.0' => 1,
                        'librt.so.1' => 1,
                        'libssl.so.1.0.0' => 1,
                        'libz.so.1' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'aggregate_buckets.c' => 1,
                         'allocator.c' => 1,
                         'auth.c' => 1,
                         'barrier_buckets.c' => 1,

                                                   'serf_debug__bucket_destroy' => 1,
                                                   'serf_debug__closed_conn' => 1,
                                                   'serf_debug__entered_loop' => 1,
                                                   'serf_debug__record_read' => 1,
                                                   'serf_default_destroy' => 1,
                                                   'serf_default_destroy_and_data' => 1,
                                                   'serf_default_read_bucket' => 1,
                                                   'serf_default_read_for_sendfile' => 1,
                                                   'serf_default_read_iovec' => 1,
                                                   'serf_error_string' => 1,
                                                   'serf_event_trigger' => 1,
                                                   'serf_incoming_create' => 1,
                                                   'serf_lib_version' => 1,
                                                   'serf_linebuf_fetch' => 1,
                                                   'serf_linebuf_init' => 1,
                                                   'serf_listener_create' => 1,
                                                   'serf_request_bucket_request_create' => 1,
                                                   'serf_request_cancel' => 1,
                                                   'serf_request_get_alloc' => 1,
                                                   'serf_request_get_conn' => 1,
                                                   'serf_request_get_pool' => 1,
                                                   'serf_request_set_handler' => 1,
                                                   'serf_ssl_cert_certificate' => 1,
                                                   'serf_ssl_cert_depth' => 1,
                                                   'serf_ssl_cert_export' => 1,
                                                   'serf_ssl_cert_issuer' => 1,
                                                   'serf_ssl_cert_subject' => 1,
                                                   'serf_ssl_client_cert_password_set' => 1,
                                                   'serf_ssl_client_cert_provider_set' => 1,
                                                   'serf_ssl_load_cert_file' => 1,
                                                   'serf_ssl_server_cert_callback_set' => 1,
                                                   'serf_ssl_set_hostname' => 1,
                                                   'serf_ssl_trust_cert' => 1,
                                                   'serf_ssl_use_default_certificates' => 1,
                                                   'serf_util_readline' => 1
                                                 }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '10247' => {
                                       'BaseType' => '10258',
                                       'Header' => 'serf.h',
                                       'Line' => '44',
                                       'Name' => 'serf_connection_t',
                                       'Size' => '16752',
                                       'Type' => 'Typedef'
                                     },
                          '10258' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '148',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ctx',
                                                            'offset' => '0',
                                                            'type' => '11622'
                                                          },
                                                   '1' => {
                                                            'name' => 'status',
                                                            'offset' => '8',
                                                            'type' => '358'
                                                          },
                                                   '10' => {
                                                             'name' => 'dirty_conn',
                                                             'offset' => '76',
                                                             'type' => '191'
                                                           },
                                                   '11' => {
                                                             'name' => 'completed_requests',
                                                             'offset' => '80',
                                                             'type' => '163'
                                                           },
                                                   '12' => {
                                                             'name' => 'completed_responses',
                                                             'offset' => '84',
                                                             'type' => '163'
                                                           },
                                                   '13' => {
                                                             'name' => 'probable_keepalive_limit',
                                                             'offset' => '88',
                                                             'type' => '163'
                                                           },
                                                   '14' => {
                                                             'name' => 'state',
                                                             'offset' => '92',
                                                             'type' => '12440'
                                                           },
                                                   '15' => {
                                                             'name' => 'async_responses',
                                                             'offset' => '96',
                                                             'type' => '191'
                                                           },
                                                   '16' => {
                                                             'name' => 'current_async_response',
                                                             'offset' => '104',
                                                             'type' => '1178'
                                                           },
                                                   '17' => {
                                                             'name' => 'async_acceptor',
                                                             'offset' => '112',
                                                             'type' => '11343'
                                                           },
                                                   '18' => {
                                                             'name' => 'async_acceptor_baton',
                                                             'offset' => '120',
                                                             'type' => '234'
                                                           },
                                                   '19' => {
                                                             'name' => 'async_handler',
                                                             'offset' => '128',
                                                             'type' => '11447'
                                                           },
                                                   '2' => {
                                                            'name' => 'baton',
                                                            'offset' => '16',
                                                            'type' => '12271'
                                                          },
                                                   '20' => {
                                                             'name' => 'async_handler_baton',
                                                             'offset' => '136',
                                                             'type' => '234'
                                                           },
                                                   '21' => {
                                                             'name' => 'stream',
                                                             'offset' => '144',
                                                             'type' => '1178'
                                                           },
                                                   '22' => {
                                                             'name' => 'ostream_head',
                                                             'offset' => '152',
                                                             'type' => '1178'
                                                           },
                                                   '23' => {
                                                             'name' => 'ostream_tail',
                                                             'offset' => '160',
                                                             'type' => '1178'
                                                           },
                                                   '24' => {
                                                             'name' => 'ssltunnel_ostream',
                                                             'offset' => '168',
                                                             'type' => '1178'
                                                           },
                                                   '25' => {
                                                             'name' => 'requests',
                                                             'offset' => '176',
                                                             'type' => '11391'
                                                           },
                                                   '26' => {
                                                             'name' => 'requests_tail',
                                                             'offset' => '184',
                                                             'type' => '11391'
                                                           },
                                                   '27' => {
                                                             'name' => 'hold_requests',
                                                             'offset' => '192',
                                                             'type' => '11391'
                                                           },
                                                   '28' => {
                                                             'name' => 'hold_requests_tail',
                                                             'offset' => '200',
                                                             'type' => '11391'
                                                           },
                                                   '29' => {
                                                             'name' => 'vec',
                                                             'offset' => '208',
                                                             'type' => '12451'
                                                           },
                                                   '3' => {
                                                            'name' => 'pool',
                                                            'offset' => '32',
                                                            'type' => '4563'
                                                          },
                                                   '30' => {
                                                             'name' => 'vec_len',
                                                             'offset' => '16592',
                                                             'type' => '191'
                                                           },
                                                   '31' => {
                                                             'name' => 'setup',
                                                             'offset' => '16600',
                                                             'type' => '11278'
                                                           },
                                                   '32' => {
                                                             'name' => 'setup_baton',
                                                             'offset' => '16608',
                                                             'type' => '234'
                                                           },
                                                   '33' => {
                                                             'name' => 'closed',
                                                             'offset' => '16616',
                                                             'type' => '11397'
                                                           },
                                                   '34' => {
                                                             'name' => 'closed_baton',
                                                             'offset' => '16624',
                                                             'type' => '234'
                                                           },
                                                   '35' => {
                                                             'name' => 'max_outstanding_requests',
                                                             'offset' => '16632',
                                                             'type' => '163'
                                                           },
                                                   '36' => {
                                                             'name' => 'hit_eof',
                                                             'offset' => '16636',
                                                             'type' => '191'
                                                           },
                                                   '37' => {
                                                             'name' => 'host_url',
                                                             'offset' => '16640',
                                                             'type' => '369'
                                                           },
                                                   '38' => {
                                                             'name' => 'host_info',
                                                             'offset' => '16648',
                                                             'type' => '9622'
                                                           },
                                                   '39' => {
                                                             'name' => 'authn_baton',
                                                             'offset' => '16736',
                                                             'type' => '234'
                                                           },
                                                   '4' => {
                                                            'name' => 'allocator',
                                                            'offset' => '40',
                                                            'type' => '1463'
                                                          },
                                                   '40' => {
                                                             'name' => 'proxy_authn_baton',
                                                             'offset' => '16744',
                                                             'type' => '234'
                                                           },
                                                   '5' => {
                                                            'name' => 'address',
                                                            'offset' => '48',
                                                            'type' => '9406'
                                                          },
                                                   '6' => {
                                                            'name' => 'skt',
                                                            'offset' => '56',
                                                            'type' => '9489'
                                                          },
                                                   '7' => {
                                                            'name' => 'skt_pool',
                                                            'offset' => '64',
                                                            'type' => '4563'
                                                          },
                                                   '8' => {
                                                            'name' => 'reqevents',
                                                            'offset' => '72',
                                                            'type' => '8175'
                                                          },
                                                   '9' => {
                                                            'name' => 'seen_in_pollset',
                                                            'offset' => '74',
                                                            'type' => '8175'
                                                          }
                                                 },
                                       'Name' => 'struct serf_connection_t',
                                       'Size' => '16752',
                                       'Type' => 'Struct'
                                     },
                          '1033' => {
                                      'BaseType' => '1044',
                                      'Header' => 'serf.h',
                                      'Line' => '41',
                                      'Name' => 'serf_bucket_type_t',
                                      'Size' => '64',
                                      'Type' => 'Typedef'
                                    },
                          '1044' => {
                                      'Header' => 'serf.h',
                                      'Line' => '709',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'name',
                                                           'offset' => '0',
                                                           'type' => '369'
                                                         },
                                                  '1' => {
                                                           'name' => 'read',
                                                           'offset' => '8',
                                                           'type' => '1226'
                                                         },
                                                  '2' => {
                                                           'name' => 'readline',
                                                           'offset' => '16',
                                                           'type' => '1267'
                                                         },
                                                  '3' => {
                                                           'name' => 'read_iovec',
                                                           'offset' => '24',
                                                           'type' => '1308'
                                                         },
                                                  '4' => {
                                                           'name' => 'read_for_sendfile',
                                                           'offset' => '32',
                                                           'type' => '1372'
                                                         },
                                                  '5' => {
                                                           'name' => 'read_bucket',
                                                           'offset' => '40',
                                                           'type' => '1409'
                                                         },
                                                  '6' => {
                                                           'name' => 'peek',
                                                           'offset' => '48',
                                                           'type' => '1440'
                                                         },
                                                  '7' => {
                                                           'name' => 'destroy',
                                                           'offset' => '56',
                                                           'type' => '1457'
                                                         }
                                                },
                                      'Name' => 'struct serf_bucket_type_t',
                                      'Size' => '64',
                                      'Type' => 'Struct'
                                    },
                          '106756' => {
                                        'BaseType' => '12230',
                                        'Name' => 'serf_incoming_t**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '107184' => {
                                        'BaseType' => '11628',
                                        'Name' => 'serf_listener_t**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '10775' => {
                                       'BaseType' => '10786',
                                       'Header' => 'serf.h',
                                       'Line' => '45',
                                       'Name' => 'serf_listener_t',
                                       'Size' => '88',
                                       'Type' => 'Typedef'
                                     },
                          '10786' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '120',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ctx',
                                                            'offset' => '0',
                                                            'type' => '11622'
                                                          },
                                                   '1' => {
                                                            'name' => 'baton',
                                                            'offset' => '8',
                                                            'type' => '12271'
                                                          },
                                                   '2' => {
                                                            'name' => 'skt',
                                                            'offset' => '24',
                                                            'type' => '9489'
                                                          },
                                                   '3' => {
                                                            'name' => 'pool',
                                                            'offset' => '32',
                                                            'type' => '4563'
                                                          },
                                                   '4' => {
                                                            'name' => 'desc',
                                                            'offset' => '40',
                                                            'type' => '9506'
                                                          },
                                                   '5' => {
                                                            'name' => 'accept_baton',
                                                            'offset' => '72',
                                                            'type' => '234'
                                                          },
                                                   '6' => {
                                                            'name' => 'accept_func',
                                                            'offset' => '80',
                                                            'type' => '11569'
                                                          }
                                                 },
                                       'Name' => 'struct serf_listener_t',
                                       'Size' => '88',
                                       'Type' => 'Struct'
                                     },
                          '10883' => {
                                       'BaseType' => '10894',
                                       'Header' => 'serf.h',
                                       'Line' => '46',
                                       'Name' => 'serf_incoming_t',
                                       'Size' => '80',
                                       'Type' => 'Typedef'
                                     },
                          '10894' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '130',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ctx',
                                                            'offset' => '0',
                                                            'type' => '11622'
                                                          },
                                                   '1' => {
                                                            'name' => 'baton',
                                                            'offset' => '8',
                                                            'type' => '12271'
                                                          },
                                                   '2' => {
                                                            'name' => 'request_baton',
                                                            'offset' => '24',
                                                            'type' => '234'
                                                          },
                                                   '3' => {
                                                            'name' => 'request',
                                                            'offset' => '32',
                                                            'type' => '11634'
                                                          },
                                                   '4' => {
                                                            'name' => 'skt',
                                                            'offset' => '40',
                                                            'type' => '9489'
                                                          },
                                                   '5' => {
                                                            'name' => 'desc',
                                                            'offset' => '48',
                                                            'type' => '9506'
                                                          }
                                                 },
                                       'Name' => 'struct serf_incoming_t',
                                       'Size' => '80',
                                       'Type' => 'Struct'
                                     },
                          '10979' => {
                                       'BaseType' => '10990',
                                       'Header' => 'serf.h',
                                       'Line' => '47',
                                       'Name' => 'serf_incoming_request_t',
                                       'Type' => 'Typedef'
                                     },
                          '10990' => {
                                       'Name' => 'struct serf_incoming_request_t',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '10995' => {
                                       'BaseType' => '11006',
                                       'Header' => 'serf.h',
                                       'Line' => '49',
                                       'Name' => 'serf_request_t',
                                       'Size' => '104',
                                       'Type' => 'Typedef'
                                     },
                          '11006' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '45',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'conn',
                                                            'offset' => '0',
                                                            'type' => '11441'
                                                          },
                                                   '1' => {
                                                            'name' => 'respool',
                                                            'offset' => '8',
                                                            'type' => '4563'
                                                          },
                                                   '10' => {
                                                             'name' => 'resp_bkt',
                                                             'offset' => '80',
                                                             'type' => '1178'
                                                           },
                                                   '11' => {
                                                             'name' => 'written',
                                                             'offset' => '88',
                                                             'type' => '191'
                                                           },
                                                   '12' => {
                                                             'name' => 'priority',
                                                             'offset' => '92',
                                                             'type' => '191'
                                                           },
                                                   '13' => {
                                                             'name' => 'next',
                                                             'offset' => '96',
                                                             'type' => '11391'
                                                           },
                                                   '2' => {
                                                            'name' => 'allocator',
                                                            'offset' => '16',
                                                            'type' => '1463'
                                                          },
                                                   '3' => {
                                                            'name' => 'req_bkt',
                                                            'offset' => '24',
                                                            'type' => '1178'
                                                          },
                                                   '4' => {
                                                            'name' => 'setup',
                                                            'offset' => '32',
                                                            'type' => '11688'
                                                          },
                                                   '5' => {
                                                            'name' => 'setup_baton',
                                                            'offset' => '40',
                                                            'type' => '234'
                                                          },
                                                   '6' => {
                                                            'name' => 'acceptor',
                                                            'offset' => '48',
                                                            'type' => '11343'
                                                          },
                                                   '7' => {
                                                            'name' => 'acceptor_baton',
                                                            'offset' => '56',
                                                            'type' => '234'
                                                          },
                                                   '8' => {
                                                            'name' => 'handler',
                                                            'offset' => '64',
                                                            'type' => '11447'
                                                          },
                                                   '9' => {
                                                            'name' => 'handler_baton',
                                                            'offset' => '72',
                                                            'type' => '234'
                                                          }
                                                 },
                                       'Name' => 'struct serf_request_t',
                                       'Size' => '104',
                                       'Type' => 'Struct'
                                     },
                          '11187' => {
                                       'BaseType' => '11198',
                                       'Header' => 'serf.h',
                                       'Line' => '132',
                                       'Name' => 'serf_socket_add_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11198' => {
                                       'Name' => 'apr_status_t(*)(void*, apr_pollfd_t*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '9616'
                                                           },
                                                    '2' => {
                                                             'type' => '234'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11229' => {
                                       'BaseType' => '11198',
                                       'Header' => 'serf.h',
                                       'Line' => '141',
                                       'Name' => 'serf_socket_remove_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11240' => {
                                       'BaseType' => '11251',
                                       'Header' => 'serf.h',
                                       'Line' => '211',
                                       'Name' => 'serf_progress_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11251' => {
                                       'Name' => 'void(*)(void*, apr_off_t, apr_off_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '346'
                                                           },
                                                    '2' => {
                                                             'type' => '346'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11278' => {
                                       'BaseType' => '11290',
                                       'Header' => 'serf.h',
                                       'Line' => '258',
                                       'Name' => 'serf_connection_setup_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11290' => {
                                       'Name' => 'apr_status_t(*)(apr_socket_t*, serf_bucket_t**, serf_bucket_t**, void*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '9489'
                                                           },
                                                    '1' => {
                                                             'type' => '11331'
                                                           },
                                                    '2' => {
                                                             'type' => '11331'
                                                           },
                                                    '3' => {
                                                             'type' => '234'
                                                           },
                                                    '4' => {
                                                             'type' => '4563'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11331' => {
                                       'BaseType' => '1178',
                                       'Name' => 'serf_bucket_t**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11343' => {
                                       'BaseType' => '11355',
                                       'Header' => 'serf.h',
                                       'Line' => '293',
                                       'Name' => 'serf_response_acceptor_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11355' => {
                                       'Name' => 'serf_bucket_t*(*)(serf_request_t*, serf_bucket_t*, void*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11391'
                                                           },
                                                    '1' => {
                                                             'type' => '1178'
                                                           },
                                                    '2' => {
                                                             'type' => '234'
                                                           },
                                                    '3' => {
                                                             'type' => '4563'
                                                           }
                                                  },
                                       'Return' => '1178',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11391' => {
                                       'BaseType' => '10995',
                                       'Name' => 'serf_request_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11397' => {
                                       'BaseType' => '11409',
                                       'Header' => 'serf.h',
                                       'Line' => '311',
                                       'Name' => 'serf_connection_closed_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11409' => {
                                       'Name' => 'void(*)(serf_connection_t*, void*, apr_status_t, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11441'
                                                           },
                                                    '1' => {
                                                             'type' => '234'
                                                           },
                                                    '2' => {
                                                             'type' => '358'
                                                           },
                                                    '3' => {
                                                             'type' => '4563'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11441' => {
                                       'BaseType' => '10247',
                                       'Name' => 'serf_connection_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11447' => {
                                       'BaseType' => '11459',
                                       'Header' => 'serf.h',
                                       'Line' => '345',
                                       'Name' => 'serf_response_handler_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11459' => {
                                       'Name' => 'apr_status_t(*)(serf_request_t*, serf_bucket_t*, void*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11391'
                                                           },
                                                    '1' => {
                                                             'type' => '1178'
                                                           },
                                                    '2' => {
                                                             'type' => '234'
                                                           },
                                                    '3' => {
                                                             'type' => '4563'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11495' => {
                                       'BaseType' => '11507',
                                       'Header' => 'serf.h',
                                       'Line' => '358',
                                       'Name' => 'serf_credentials_callback_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11507' => {
                                       'Name' => 'apr_status_t(*)(char**, char**, serf_request_t*, void*, int, char const*, char const*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11563'
                                                           },
                                                    '1' => {
                                                             'type' => '11563'
                                                           },
                                                    '2' => {
                                                             'type' => '11391'
                                                           },
                                                    '3' => {
                                                             'type' => '234'
                                                           },
                                                    '4' => {
                                                             'type' => '191'
                                                           },
                                                    '5' => {
                                                             'type' => '369'
                                                           },
                                                    '6' => {
                                                             'type' => '369'
                                                           },
                                                    '7' => {
                                                             'type' => '4563'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11563' => {
                                       'BaseType' => '236',
                                       'Name' => 'char**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11569' => {
                                       'BaseType' => '11581',
                                       'Header' => 'serf.h',
                                       'Line' => '430',
                                       'Name' => 'serf_accept_client_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11581' => {
                                       'Name' => 'apr_status_t(*)(serf_context_t*, serf_listener_t*, void*, apr_socket_t*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11622'
                                                           },
                                                    '1' => {
                                                             'type' => '11628'
                                                           },
                                                    '2' => {
                                                             'type' => '234'
                                                           },
                                                    '3' => {
                                                             'type' => '9489'
                                                           },
                                                    '4' => {
                                                             'type' => '4563'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1162' => {
                                      'BaseType' => '1173',
                                      'Header' => 'serf.h',
                                      'Line' => '42',
                                      'Name' => 'serf_bucket_alloc_t',
                                      'Type' => 'Typedef'
                                    },
                          '11622' => {
                                       'BaseType' => '9834',
                                       'Name' => 'serf_context_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11628' => {
                                       'BaseType' => '10775',
                                       'Name' => 'serf_listener_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11634' => {
                                       'BaseType' => '11646',
                                       'Header' => 'serf.h',
                                       'Line' => '446',
                                       'Name' => 'serf_incoming_request_cb_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11646' => {
                                       'Name' => 'apr_status_t(*)(serf_context_t*, serf_incoming_request_t*, void*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11622'
                                                           },
                                                    '1' => {
                                                             'type' => '11682'
                                                           },
                                                    '2' => {
                                                             'type' => '234'
                                                           },
                                                    '3' => {
                                                             'type' => '4563'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11682' => {
                                       'BaseType' => '10979',
                                       'Name' => 'serf_incoming_request_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11688' => {
                                       'BaseType' => '11700',
                                       'Header' => 'serf.h',
                                       'Line' => '512',
                                       'Name' => 'serf_request_setup_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11700' => {
                                       'Name' => 'apr_status_t(*)(serf_request_t*, void*, serf_bucket_t**, serf_response_acceptor_t*, void**, serf_response_handler_t*, void**, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11391'
                                                           },
                                                    '1' => {
                                                             'type' => '234'
                                                           },
                                                    '2' => {
                                                             'type' => '11331'
                                                           },
                                                    '3' => {
                                                             'type' => '11756'
                                                           },
                                                    '4' => {
                                                             'type' => '11762'
                                                           },
                                                    '5' => {
                                                             'type' => '11768'
                                                           },
                                                    '6' => {
                                                             'type' => '11762'
                                                           },
                                                    '7' => {
                                                             'type' => '4563'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1173' => {
                                      'Line' => '83',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'pool',
                                                           'offset' => '0',
                                                           'type' => '4563'
                                                         },
                                                  '1' => {
                                                           'name' => 'allocator',
                                                           'offset' => '8',
                                                           'type' => '41523'
                                                         },
                                                  '2' => {
                                                           'name' => 'own_allocator',
                                                           'offset' => '16',
                                                           'type' => '191'
                                                         },
                                                  '3' => {
                                                           'name' => 'unfreed',
                                                           'offset' => '24',
                                                           'type' => '41278'
                                                         },
                                                  '4' => {
                                                           'name' => 'unfreed_baton',
                                                           'offset' => '32',
                                                           'type' => '234'
                                                         },
                                                  '5' => {
                                                           'name' => 'num_alloc',
                                                           'offset' => '40',
                                                           'type' => '8211'
                                                         },
                                                  '6' => {
                                                           'name' => 'freelist',
                                                           'offset' => '48',
                                                           'type' => '41529'
                                                         },
                                                  '7' => {
                                                           'name' => 'blocks',
                                                           'offset' => '56',
                                                           'type' => '40055'
                                                         },
                                                  '8' => {
                                                           'name' => 'track',
                                                           'offset' => '64',
                                                           'type' => '41535'
                                                         }
                                                },
                                      'Name' => 'struct serf_bucket_alloc_t',
                                      'PrivateABI' => 1,
                                      'Size' => '72',
                                      'Source' => 'allocator.c',
                                      'Type' => 'Struct'
                                    },
                          '117559' => {
                                        'BaseType' => '11441',
                                        'Name' => 'serf_connection_t**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '11756' => {
                                       'BaseType' => '11343',
                                       'Name' => 'serf_response_acceptor_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11762' => {
                                       'BaseType' => '234',
                                       'Name' => 'void**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11768' => {
                                       'BaseType' => '11447',
                                       'Name' => 'serf_response_handler_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1178' => {
                                      'BaseType' => '969',
                                      'Name' => 'serf_bucket_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '118569' => {
                                        'BaseType' => '118575',
                                        'Name' => 'serf_request_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '118575' => {
                                        'BaseType' => '10995',
                                        'Name' => 'serf_request_t const',
                                        'Size' => '104',
                                        'Type' => 'Const'
                                      },
                          '118751' => {
                                        'BaseType' => '11447',
                                        'Name' => 'serf_response_handler_t const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '118756' => {
                                        'BaseType' => '16645',
                                        'Name' => 'void const**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '12059' => {
                                       'BaseType' => '12070',
                                       'Header' => 'serf_private.h',
                                       'Line' => '33',
                                       'Name' => 'serf__authn_scheme_t',
                                       'Size' => '64',
                                       'Type' => 'Typedef'
                                     },
                          '12070' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '297',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'code',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'name',
                                                            'offset' => '8',
                                                            'type' => '369'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '16',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'init_ctx_func',
                                                            'offset' => '24',
                                                            'type' => '12530'
                                                          },
                                                   '4' => {
                                                            'name' => 'init_conn_func',
                                                            'offset' => '32',
                                                            'type' => '12572'
                                                          },
                                                   '5' => {
                                                            'name' => 'handle_func',
                                                            'offset' => '40',
                                                            'type' => '12468'
                                                          },
                                                   '6' => {
                                                            'name' => 'setup_request_func',
                                                            'offset' => '48',
                                                            'type' => '12615'
                                                          },
                                                   '7' => {
                                                            'name' => 'validate_response_func',
                                                            'offset' => '56',
                                                            'type' => '12668'
                                                          }
                                                 },
                                       'Name' => 'struct serf__authn_scheme_t',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '1214' => {
                                      'BaseType' => '369',
                                      'Name' => 'char const**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '12188' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '37',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'client',
                                                            'offset' => '0',
                                                            'type' => '12230'
                                                          },
                                                   '1' => {
                                                            'name' => 'conn',
                                                            'offset' => '0',
                                                            'type' => '11441'
                                                          },
                                                   '2' => {
                                                            'name' => 'listener',
                                                            'offset' => '0',
                                                            'type' => '11628'
                                                          }
                                                 },
                                       'Name' => 'anon-union-serf_private.h-37',
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '1220' => {
                                      'BaseType' => '334',
                                      'Name' => 'apr_size_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '12230' => {
                                       'BaseType' => '10883',
                                       'Name' => 'serf_incoming_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12236' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '35',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'u',
                                                            'offset' => '8',
                                                            'type' => '12188'
                                                          }
                                                 },
                                       'Name' => 'struct serf_io_baton_t',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1226' => {
                                      'Name' => 'apr_status_t(*)(serf_bucket_t*, apr_size_t, char const**, apr_size_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1178'
                                                          },
                                                   '1' => {
                                                            'type' => '334'
                                                          },
                                                   '2' => {
                                                            'type' => '1214'
                                                          },
                                                   '3' => {
                                                            'type' => '1220'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '12271' => {
                                       'BaseType' => '12236',
                                       'Header' => 'serf_private.h',
                                       'Line' => '42',
                                       'Name' => 'serf_io_baton_t',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '12330' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '78',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'realm',
                                                            'offset' => '0',
                                                            'type' => '369'
                                                          },
                                                   '1' => {
                                                            'name' => 'scheme',
                                                            'offset' => '8',
                                                            'type' => '12379'
                                                          },
                                                   '2' => {
                                                            'name' => 'baton',
                                                            'offset' => '16',
                                                            'type' => '234'
                                                          }
                                                 },
                                       'Name' => 'struct serf__authn_info_t',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '12379' => {
                                       'BaseType' => '12385',
                                       'Name' => 'serf__authn_scheme_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12385' => {
                                       'BaseType' => '12059',
                                       'Name' => 'serf__authn_scheme_t const',
                                       'Size' => '64',
                                       'Type' => 'Const'
                                     },
                          '12390' => {
                                       'BaseType' => '12330',
                                       'Header' => 'serf_private.h',
                                       'Line' => '84',
                                       'Name' => 'serf__authn_info_t',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '12401' => {
                                       'BaseType' => '8331',
                                       'Name' => 'apr_array_header_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12440' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '146',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'SERF_CONN_INIT',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'SERF_CONN_SETUP_SSLTUNNEL',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'SERF_CONN_CONNECTED',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'SERF_CONN_CLOSING',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum serf__connection_state_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '12451' => {
                                       'BaseType' => '285',
                                       'Name' => 'struct iovec[1024]',
                                       'Size' => '16384',
                                       'Type' => 'Array'
                                     },
                          '12468' => {
                                       'BaseType' => '12479',
                                       'Header' => 'serf_private.h',
                                       'Line' => '241',
                                       'Name' => 'serf__auth_handler_func_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '12479' => {
                                       'Name' => 'apr_status_t(*)(int, serf_request_t*, serf_bucket_t*, char const*, char const*, void*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '191'
                                                           },
                                                    '1' => {
                                                             'type' => '11391'
                                                           },
                                                    '2' => {
                                                             'type' => '1178'
                                                           },
                                                    '3' => {
                                                             'type' => '369'
                                                           },
                                                    '4' => {
                                                             'type' => '369'
                                                           },
                                                    '5' => {
                                                             'type' => '234'
                                                           },
                                                    '6' => {
                                                             'type' => '4563'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12530' => {
                                       'BaseType' => '12541',
                                       'Header' => 'serf_private.h',
                                       'Line' => '255',
                                       'Name' => 'serf__init_context_func_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '12541' => {
                                       'Name' => 'apr_status_t(*)(int, serf_context_t*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '191'
                                                           },
                                                    '1' => {
                                                             'type' => '11622'
                                                           },
                                                    '2' => {
                                                             'type' => '4563'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12572' => {
                                       'BaseType' => '12584',
                                       'Header' => 'serf_private.h',
                                       'Line' => '265',
                                       'Name' => 'serf__init_conn_func_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '12584' => {
                                       'Name' => 'apr_status_t(*)(int, serf_connection_t*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '191'
                                                           },
                                                    '1' => {
                                                             'type' => '11441'
                                                           },
                                                    '2' => {
                                                             'type' => '4563'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12615' => {
                                       'BaseType' => '12627',
                                       'Header' => 'serf_private.h',
                                       'Line' => '276',
                                       'Name' => 'serf__setup_request_func_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '12627' => {
                                       'Name' => 'apr_status_t(*)(int, serf_connection_t*, char const*, char const*, serf_bucket_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '191'
                                                           },
                                                    '1' => {
                                                             'type' => '11441'
                                                           },
                                                    '2' => {
                                                             'type' => '369'
                                                           },
                                                    '3' => {
                                                             'type' => '369'
                                                           },
                                                    '4' => {
                                                             'type' => '1178'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12668' => {
                                       'BaseType' => '12680',
                                       'Header' => 'serf_private.h',
                                       'Line' => '288',
                                       'Name' => 'serf__validate_response_func_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '1267' => {
                                      'Name' => 'apr_status_t(*)(serf_bucket_t*, int, int*, char const**, apr_size_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1178'
                                                          },
                                                   '1' => {
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'type' => '328'
                                                          },
                                                   '3' => {
                                                            'type' => '1214'
                                                          },
                                                   '4' => {
                                                            'type' => '1220'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '12680' => {
                                       'Name' => 'apr_status_t(*)(int, serf_connection_t*, serf_request_t*, serf_bucket_t*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '191'
                                                           },
                                                    '1' => {
                                                             'type' => '11441'
                                                           },
                                                    '2' => {
                                                             'type' => '11391'
                                                           },
                                                    '3' => {
                                                             'type' => '1178'
                                                           },
                                                    '4' => {
                                                             'type' => '4563'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1308' => {
                                      'Name' => 'apr_status_t(*)(serf_bucket_t*, apr_size_t, int, struct iovec*, int*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1178'
                                                          },
                                                   '1' => {
                                                            'type' => '334'
                                                          },
                                                   '2' => {
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'type' => '322'
                                                          },
                                                   '4' => {
                                                            'type' => '328'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1354' => {
                                      'BaseType' => '886',
                                      'Name' => 'apr_hdtr_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1360' => {
                                      'BaseType' => '963',
                                      'Name' => 'apr_file_t**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1366' => {
                                      'BaseType' => '346',
                                      'Name' => 'apr_off_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1372' => {
                                      'Name' => 'apr_status_t(*)(serf_bucket_t*, apr_size_t, apr_hdtr_t*, apr_file_t**, apr_off_t*, apr_size_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1178'
                                                          },
                                                   '1' => {
                                                            'type' => '334'
                                                          },
                                                   '2' => {
                                                            'type' => '1354'
                                                          },
                                                   '3' => {
                                                            'type' => '1360'
                                                          },
                                                   '4' => {
                                                            'type' => '1366'
                                                          },
                                                   '5' => {
                                                            'type' => '1220'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1398' => {
                                      'BaseType' => '1404',
                                      'Name' => 'serf_bucket_type_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1404' => {
                                      'BaseType' => '1033',
                                      'Name' => 'serf_bucket_type_t const',
                                      'Size' => '64',
                                      'Type' => 'Const'
                                    },
                          '1409' => {
                                      'Name' => 'serf_bucket_t*(*)(serf_bucket_t*, serf_bucket_type_t const*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1178'
                                                          },
                                                   '1' => {
                                                            'type' => '1398'
                                                          }
                                                 },
                                      'Return' => '1178',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '14122' => {
                                       'BaseType' => '14128',
                                       'Name' => 'apr_pollfd_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14128' => {
                                       'BaseType' => '9506',
                                       'Name' => 'apr_pollfd_t const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '1440' => {
                                      'Name' => 'apr_status_t(*)(serf_bucket_t*, char const**, apr_size_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1178'
                                                          },
                                                   '1' => {
                                                            'type' => '1214'
                                                          },
                                                   '2' => {
                                                            'type' => '1220'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '14476' => {
                                       'BaseType' => '11240',
                                       'Name' => 'serf_progress_t const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '1457' => {
                                      'Name' => 'void(*)(serf_bucket_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1178'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1463' => {
                                      'BaseType' => '1162',
                                      'Name' => 'serf_bucket_alloc_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1469' => {
                                      'BaseType' => '1480',
                                      'Header' => 'serf_bucket_types.h',
                                      'Line' => '176',
                                      'Name' => 'serf_bucket_aggregate_eof_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1480' => {
                                      'Name' => 'apr_status_t(*)(void*, serf_bucket_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '234'
                                                          },
                                                   '1' => {
                                                            'type' => '1178'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '149' => {
                                     'Name' => 'unsigned char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '1506' => {
                                      'BaseType' => '1518',
                                      'Header' => 'serf_bucket_types.h',
                                      'Line' => '272',
                                      'Name' => 'serf_simple_freefunc_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1518' => {
                                      'Name' => 'void(*)(void*, char const*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '234'
                                                          },
                                                   '1' => {
                                                            'type' => '369'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1540' => {
                                      'Line' => '21',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'bucket',
                                                           'offset' => '0',
                                                           'type' => '1178'
                                                         },
                                                  '1' => {
                                                           'name' => 'next',
                                                           'offset' => '8',
                                                           'type' => '1577'
                                                         }
                                                },
                                      'Name' => 'struct bucket_list',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Source' => 'aggregate_buckets.c',
                                      'Type' => 'Struct'
                                    },
                          '156' => {
                                     'Name' => 'unsigned short',
                                     'Size' => '2',
                                     'Type' => 'Intrinsic'
                                   },
                          '1577' => {
                                      'BaseType' => '1540',
                                      'Name' => 'struct bucket_list*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1583' => {
                                      'BaseType' => '1540',
                                      'Line' => '24',
                                      'Name' => 'bucket_list_t',
                                      'Size' => '16',
                                      'Source' => 'aggregate_buckets.c',
                                      'Type' => 'Typedef'
                                    },
                          '163' => {
                                     'Name' => 'unsigned int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '16532' => {
                                       'Header' => 'serf.h',
                                       'Line' => '982',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'SERF_LINEBUF_EMPTY',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'SERF_LINEBUF_READY',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'SERF_LINEBUF_PARTIAL',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'SERF_LINEBUF_CRLF_SPLIT',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'anon-enum-serf.h-982',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '16616' => {
                                       'BaseType' => '242',
                                       'Name' => 'char[8000]',
                                       'Size' => '8000',
                                       'Type' => 'Array'
                                     },
                          '16633' => {
                                       'Header' => 'serf.h',
                                       'Line' => '995',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state',
                                                            'offset' => '0',
                                                            'type' => '16532'
                                                          },
                                                   '1' => {
                                                            'name' => 'used',
                                                            'offset' => '8',
                                                            'type' => '334'
                                                          },
                                                   '2' => {
                                                            'name' => 'line',
                                                            'offset' => '16',
                                                            'type' => '16616'
                                                          }
                                                 },
                                       'Name' => 'struct serf_linebuf_t',
                                       'Size' => '8016',
                                       'Type' => 'Struct'
                                     },
                          '16645' => {
                                       'BaseType' => '16651',
                                       'Name' => 'void const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '16651' => {
                                       'BaseType' => '1',
                                       'Name' => 'void const',
                                       'Type' => 'Const'
                                     },
                          '16652' => {
                                       'BaseType' => '16663',
                                       'Header' => 'serf_bucket_util.h',
                                       'Line' => '201',
                                       'Name' => 'serf_databuf_reader_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '16663' => {
                                       'Name' => 'apr_status_t(*)(void*, apr_size_t, char*, apr_size_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '334'
                                                           },
                                                    '2' => {
                                                             'type' => '236'
                                                           },
                                                    '3' => {
                                                             'type' => '1220'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1675' => {
                                      'BaseType' => '1583',
                                      'Name' => 'bucket_list_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '16781' => {
                                       'Header' => 'serf_bucket_util.h',
                                       'Line' => '234',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'current',
                                                            'offset' => '0',
                                                            'type' => '369'
                                                          },
                                                   '1' => {
                                                            'name' => 'remaining',
                                                            'offset' => '8',
                                                            'type' => '334'
                                                          },
                                                   '2' => {
                                                            'name' => 'read',
                                                            'offset' => '16',
                                                            'type' => '16652'
                                                          },
                                                   '3' => {
                                                            'name' => 'read_baton',
                                                            'offset' => '24',
                                                            'type' => '234'
                                                          },
                                                   '4' => {
                                                            'name' => 'status',
                                                            'offset' => '32',
                                                            'type' => '358'
                                                          },
                                                   '5' => {
                                                            'name' => 'buf',
                                                            'offset' => '36',
                                                            'type' => '16616'
                                                          }
                                                 },
                                       'Name' => 'struct serf_databuf_t',
                                       'Size' => '8040',
                                       'Type' => 'Struct'
                                     },
                          '16919' => {
                                       'BaseType' => '16781',
                                       'Name' => 'serf_databuf_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '170' => {
                                     'Name' => 'unsigned long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '184' => {
                                     'Name' => 'short',
                                     'Size' => '2',
                                     'Type' => 'Intrinsic'
                                   },
                          '19061' => {
                                       'BaseType' => '16633',
                                       'Name' => 'serf_linebuf_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '191' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '198' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '205' => {
                                     'BaseType' => '198',
                                     'Header' => 'types.h',
                                     'Line' => '131',
                                     'Name' => '__off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '234' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '236' => {
                                     'BaseType' => '242',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '24021' => {
                                       'BaseType' => '24032',
                                       'Header' => 'apr_mmap.h',
                                       'Line' => '51',
                                       'Name' => 'apr_mmap_t',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '24032' => {
                                       'Header' => 'apr_mmap.h',
                                       'Line' => '62',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cntxt',
                                                            'offset' => '0',
                                                            'type' => '4563'
                                                          },
                                                   '1' => {
                                                            'name' => 'mm',
                                                            'offset' => '8',
                                                            'type' => '234'
                                                          },
                                                   '2' => {
                                                            'name' => 'size',
                                                            'offset' => '16',
                                                            'type' => '334'
                                                          },
                                                   '3' => {
                                                            'name' => 'link',
                                                            'offset' => '24',
                                                            'type' => '24092'
                                                          }
                                                 },
                                       'Name' => 'struct apr_mmap_t',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '24092' => {
                                       'Header' => 'apr_mmap.h',
                                       'Line' => '85',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '24125'
                                                          },
                                                   '1' => {
                                                            'name' => 'prev',
                                                            'offset' => '8',
                                                            'type' => '24125'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-apr_mmap.h-85',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '24125' => {
                                       'BaseType' => '25322',
                                       'Name' => 'struct apr_mmap_t*volatile',
                                       'Size' => '8',
                                       'Type' => 'Volatile'
                                     },
                          '242' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '249' => {
                                     'BaseType' => '205',
                                     'Header' => 'types.h',
                                     'Line' => '86',
                                     'Name' => 'off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '25322' => {
                                       'BaseType' => '24021',
                                       'Name' => 'apr_mmap_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '260' => {
                                     'BaseType' => '170',
                                     'Header' => 'stddef.h',
                                     'Line' => '212',
                                     'Name' => 'size_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '285' => {
                                     'Header' => 'uio.h',
                                     'Line' => '43',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'iov_base',
                                                          'offset' => '0',
                                                          'type' => '234'
                                                        },
                                                 '1' => {
                                                          'name' => 'iov_len',
                                                          'offset' => '8',
                                                          'type' => '260'
                                                        }
                                               },
                                     'Name' => 'struct iovec',
                                     'PrivateABI' => 1,
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '31089' => {
                                       'BaseType' => '170',
                                       'Header' => 'apr.h',
                                       'Line' => '353',
                                       'Name' => 'apr_uint64_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '322' => {
                                     'BaseType' => '285',
                                     'Name' => 'struct iovec*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '32510' => {
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '87',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'version',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'code',
                                                            'offset' => '4',
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'name' => 'reason',
                                                            'offset' => '8',
                                                            'type' => '369'
                                                          }
                                                 },
                                       'Name' => 'struct serf_status_line',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '328' => {
                                     'BaseType' => '191',
                                     'Name' => 'int*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '334' => {
                                     'BaseType' => '260',
                                     'Header' => 'apr.h',
                                     'Line' => '356',
                                     'Name' => 'apr_size_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '346' => {
                                     'BaseType' => '249',
                                     'Header' => 'apr.h',
                                     'Line' => '358',
                                     'Name' => 'apr_off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '34890' => {
                                       'BaseType' => '32510',
                                       'Name' => 'serf_status_line*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '35762' => {
                                       'Name' => 'int()(void*, char const*, char const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '369'
                                                           },
                                                    '2' => {
                                                             'type' => '369'
                                                           }
                                                  },
                                       'Return' => '191',
                                       'Type' => 'Func'
                                     },
                          '358' => {
                                     'BaseType' => '191',
                                     'Header' => 'apr_errno.h',
                                     'Line' => '44',
                                     'Name' => 'apr_status_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '36876' => {
                                       'BaseType' => '35762',
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '392',
                                       'Name' => 'serf_bucket_headers_do_callback_fn_t',
                                       'Type' => 'Typedef'
                                     },
                          '369' => {
                                     'BaseType' => '375',
                                     'Name' => 'char const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '375' => {
                                     'BaseType' => '242',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '380' => {
                                     'Name' => 'struct apr_file_t',
                                     'PrivateABI' => 1,
                                     'Type' => 'Struct'
                                   },
                          '39402' => {
                                       'BaseType' => '36876',
                                       'Name' => 'serf_bucket_headers_do_callback_fn_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '39943' => {
                                       'BaseType' => '39954',
                                       'Header' => 'apr_allocator.h',
                                       'Line' => '41',
                                       'Name' => 'apr_allocator_t',
                                       'Type' => 'Typedef'
                                     },
                          '39954' => {
                                       'Name' => 'struct apr_allocator_t',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '39959' => {
                                       'BaseType' => '39970',
                                       'Header' => 'apr_allocator.h',
                                       'Line' => '43',
                                       'Name' => 'apr_memnode_t',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '39970' => {
                                       'Header' => 'apr_allocator.h',
                                       'Line' => '54',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '40055'
                                                          },
                                                   '1' => {
                                                            'name' => 'ref',
                                                            'offset' => '8',
                                                            'type' => '40061'
                                                          },
                                                   '2' => {
                                                            'name' => 'index',
                                                            'offset' => '16',
                                                            'type' => '8211'
                                                          },
                                                   '3' => {
                                                            'name' => 'free_index',
                                                            'offset' => '20',
                                                            'type' => '8211'
                                                          },
                                                   '4' => {
                                                            'name' => 'first_avail',
                                                            'offset' => '24',
                                                            'type' => '236'
                                                          },
                                                   '5' => {
                                                            'name' => 'endp',
                                                            'offset' => '32',
                                                            'type' => '236'
                                                          }
                                                 },
                                       'Name' => 'struct apr_memnode_t',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '40055' => {
                                       'BaseType' => '39959',
                                       'Name' => 'apr_memnode_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '40061' => {
                                       'BaseType' => '40055',
                                       'Name' => 'apr_memnode_t**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '41278' => {
                                       'BaseType' => '41290',
                                       'Header' => 'serf.h',
                                       'Line' => '927',
                                       'Name' => 'serf_unfreed_func_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '41290' => {
                                       'Name' => 'void(*)(void*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '234'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '41312' => {
                                       'Line' => '26',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '41529'
                                                          },
                                                   '1' => {
                                                            'name' => 'memnode',
                                                            'offset' => '0',
                                                            'type' => '40055'
                                                          }
                                                 },
                                       'Name' => 'anon-union-allocator.c-26',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Source' => 'allocator.c',
                                       'Type' => 'Union'
                                     },
                          '41343' => {
                                       'Line' => '24',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'size',
                                                            'offset' => '0',
                                                            'type' => '334'
                                                          },
                                                   '1' => {
                                                            'name' => 'u',
                                                            'offset' => '8',
                                                            'type' => '41312'
                                                          }
                                                 },
                                       'Name' => 'struct node_header_t',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Source' => 'allocator.c',
                                       'Type' => 'Struct'
                                     },
                          '41384' => {
                                       'BaseType' => '41343',
                                       'Line' => '31',
                                       'Name' => 'node_header_t',
                                       'Size' => '16',
                                       'Source' => 'allocator.c',
                                       'Type' => 'Typedef'
                                     },
                          '41428' => {
                                       'BaseType' => '41434',
                                       'Name' => 'serf_bucket_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '41434' => {
                                       'BaseType' => '969',
                                       'Name' => 'serf_bucket_t const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '41439' => {
                                       'Line' => '71',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'bucket',
                                                            'offset' => '0',
                                                            'type' => '41428'
                                                          },
                                                   '1' => {
                                                            'name' => 'last',
                                                            'offset' => '8',
                                                            'type' => '358'
                                                          }
                                                 },
                                       'Name' => 'struct read_status_t',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Source' => 'allocator.c',
                                       'Type' => 'Struct'
                                     },
                          '41496' => {
                                       'BaseType' => '41439',
                                       'Name' => 'read_status_t[100]',
                                       'Size' => '1600',
                                       'Type' => 'Array'
                                     },
                          '41512' => {
                                       'Line' => '80',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next_index',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'num_used',
                                                            'offset' => '4',
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'name' => 'info',
                                                            'offset' => '8',
                                                            'type' => '41496'
                                                          }
                                                 },
                                       'Name' => 'struct track_state_t',
                                       'PrivateABI' => 1,
                                       'Size' => '1608',
                                       'Source' => 'allocator.c',
                                       'Type' => 'Struct'
                                     },
                          '41523' => {
                                       'BaseType' => '39943',
                                       'Name' => 'apr_allocator_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '41529' => {
                                       'BaseType' => '41384',
                                       'Name' => 'node_header_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '41535' => {
                                       'BaseType' => '41512',
                                       'Name' => 'track_state_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '4547' => {
                                      'BaseType' => '4558',
                                      'Header' => 'apr_pools.h',
                                      'Line' => '60',
                                      'Name' => 'apr_pool_t',
                                      'Type' => 'Typedef'
                                    },
                          '4558' => {
                                      'Name' => 'struct apr_pool_t',
                                      'PrivateABI' => 1,
                                      'Type' => 'Struct'
                                    },
                          '4563' => {
                                      'BaseType' => '4547',
                                      'Name' => 'apr_pool_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '45809' => {
                                       'BaseType' => '149',
                                       'Name' => 'unsigned char*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '51118' => {
                                       'BaseType' => '198',
                                       'Header' => 'types.h',
                                       'Line' => '139',
                                       'Name' => '__time_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '51129' => {
                                       'BaseType' => '198',
                                       'Header' => 'types.h',
                                       'Line' => '141',
                                       'Name' => '__suseconds_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '51188' => {
                                       'BaseType' => '51118',
                                       'Header' => 'time.h',
                                       'Line' => '75',
                                       'Name' => 'time_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '51210' => {
                                       'Header' => 'time.h',
                                       'Line' => '30',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tv_sec',
                                                            'offset' => '0',
                                                            'type' => '51118'
                                                          },
                                                   '1' => {
                                                            'name' => 'tv_usec',
                                                            'offset' => '8',
                                                            'type' => '51129'
                                                          }
                                                 },
                                       'Name' => 'struct timeval',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '51316' => {
                                       'Name' => 'void(*)()',
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '52826' => {
                                       'BaseType' => '52837',
                                       'Header' => 'apr_hash.h',
                                       'Line' => '52',
                                       'Name' => 'apr_hash_t',
                                       'Type' => 'Typedef'
                                     },
                          '52837' => {
                                       'Name' => 'struct apr_hash_t',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '52849' => {
                                       'BaseType' => '52861',
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '472',
                                       'Name' => 'serf_ssl_context_t',
                                       'Size' => '16320',
                                       'Type' => 'Typedef'
                                     },
                          '52861' => {
                                       'Line' => '142',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'refcount',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'pool',
                                                            'offset' => '8',
                                                            'type' => '4563'
                                                          },
                                                   '10' => {
                                                             'name' => 'cert_cache_pool',
                                                             'offset' => '16224',
                                                             'type' => '4563'
                                                           },
                                                   '11' => {
                                                             'name' => 'cert_file_success',
                                                             'offset' => '16232',
                                                             'type' => '369'
                                                           },
                                                   '12' => {
                                                             'name' => 'cert_pw_callback',
                                                             'offset' => '16240',
                                                             'type' => '53241'
                                                           },
                                                   '13' => {
                                                             'name' => 'cert_pw_userdata',
                                                             'offset' => '16248',
                                                             'type' => '234'
                                                           },
                                                   '14' => {
                                                             'name' => 'cert_pw_cache_pool',
                                                             'offset' => '16256',
                                                             'type' => '4563'
                                                           },
                                                   '15' => {
                                                             'name' => 'cert_pw_success',
                                                             'offset' => '16264',
                                                             'type' => '369'
                                                           },
                                                   '16' => {
                                                             'name' => 'server_cert_callback',
                                                             'offset' => '16272',
                                                             'type' => '53284'
                                                           },
                                                   '17' => {
                                                             'name' => 'server_cert_userdata',
                                                             'offset' => '16280',
                                                             'type' => '234'
                                                           },
                                                   '18' => {
                                                             'name' => 'cert_path',
                                                             'offset' => '16288',
                                                             'type' => '369'
                                                           },
                                                   '19' => {
                                                             'name' => 'cached_cert',
                                                             'offset' => '16296',
                                                             'type' => '62170'
                                                           },
                                                   '2' => {
                                                            'name' => 'allocator',
                                                            'offset' => '16',
                                                            'type' => '1463'
                                                          },
                                                   '20' => {
                                                             'name' => 'cached_cert_pw',
                                                             'offset' => '16304',
                                                             'type' => '63801'
                                                           },
                                                   '21' => {
                                                             'name' => 'pending_err',
                                                             'offset' => '16312',
                                                             'type' => '358'
                                                           },
                                                   '3' => {
                                                            'name' => 'ctx',
                                                            'offset' => '24',
                                                            'type' => '67649'
                                                          },
                                                   '4' => {
                                                            'name' => 'ssl',
                                                            'offset' => '32',
                                                            'type' => '67278'
                                                          },
                                                   '5' => {
                                                            'name' => 'bio',
                                                            'offset' => '40',
                                                            'type' => '61073'
                                                          },
                                                   '6' => {
                                                            'name' => 'encrypt',
                                                            'offset' => '48',
                                                            'type' => '72773'
                                                          },
                                                   '7' => {
                                                            'name' => 'decrypt',
                                                            'offset' => '8128',
                                                            'type' => '72773'
                                                          },
                                                   '8' => {
                                                            'name' => 'cert_callback',
                                                            'offset' => '16208',
                                                            'type' => '53203'
                                                          },
                                                   '9' => {
                                                            'name' => 'cert_userdata',
                                                            'offset' => '16216',
                                                            'type' => '234'
                                                          }
                                                 },
                                       'Name' => 'struct serf_ssl_context_t',
                                       'PrivateABI' => 1,
                                       'Size' => '16320',
                                       'Source' => 'ssl_buckets.c',
                                       'Type' => 'Struct'
                                     },
                          '53154' => {
                                       'BaseType' => '53166',
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '473',
                                       'Name' => 'serf_ssl_certificate_t',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '53166' => {
                                       'Line' => '195',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ssl_cert',
                                                            'offset' => '0',
                                                            'type' => '62170'
                                                          },
                                                   '1' => {
                                                            'name' => 'depth',
                                                            'offset' => '8',
                                                            'type' => '191'
                                                          }
                                                 },
                                       'Name' => 'struct serf_ssl_certificate_t',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Source' => 'ssl_buckets.c',
                                       'Type' => 'Struct'
                                     },
                          '53203' => {
                                       'BaseType' => '53215',
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '475',
                                       'Name' => 'serf_ssl_need_client_cert_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '53215' => {
                                       'Name' => 'apr_status_t(*)(void*, char const**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '1214'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '53241' => {
                                       'BaseType' => '53253',
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '479',
                                       'Name' => 'serf_ssl_need_cert_password_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '53253' => {
                                       'Name' => 'apr_status_t(*)(void*, char const*, char const**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '369'
                                                           },
                                                    '2' => {
                                                             'type' => '1214'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '53284' => {
                                       'BaseType' => '53296',
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '484',
                                       'Name' => 'serf_ssl_need_server_cert_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '53296' => {
                                       'Name' => 'apr_status_t(*)(void*, int, serf_ssl_certificate_t const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '191'
                                                           },
                                                    '2' => {
                                                             'type' => '53327'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '53327' => {
                                       'BaseType' => '53333',
                                       'Name' => 'serf_ssl_certificate_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '53333' => {
                                       'BaseType' => '53154',
                                       'Name' => 'serf_ssl_certificate_t const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '53478' => {
                                       'Name' => 'int(*)(void const*, void const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '16645'
                                                           },
                                                    '1' => {
                                                             'type' => '16645'
                                                           }
                                                  },
                                       'Return' => '191',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '53504' => {
                                       'Header' => 'stack.h',
                                       'Line' => '66',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'num',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'data',
                                                            'offset' => '8',
                                                            'type' => '11563'
                                                          },
                                                   '2' => {
                                                            'name' => 'sorted',
                                                            'offset' => '16',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'num_alloc',
                                                            'offset' => '20',
                                                            'type' => '191'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp',
                                                            'offset' => '24',
                                                            'type' => '53478'
                                                          }
                                                 },
                                       'Name' => 'struct stack_st',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '53577' => {
                                       'BaseType' => '53504',
                                       'Header' => 'stack.h',
                                       'Line' => '72',
                                       'Name' => '_STACK',
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '53588' => {
                                       'BaseType' => '53599',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '83',
                                       'Name' => 'ASN1_INTEGER',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '53599' => {
                                       'Header' => 'asn1.h',
                                       'Line' => '239',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'length',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'type',
                                                            'offset' => '4',
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'name' => 'data',
                                                            'offset' => '8',
                                                            'type' => '45809'
                                                          },
                                                   '3' => {
                                                            'name' => 'flags',
                                                            'offset' => '16',
                                                            'type' => '198'
                                                          }
                                                 },
                                       'Name' => 'struct asn1_string_st',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '53660' => {
                                       'BaseType' => '53599',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '84',
                                       'Name' => 'ASN1_ENUMERATED',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '53671' => {
                                       'BaseType' => '53599',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '85',
                                       'Name' => 'ASN1_BIT_STRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '53682' => {
                                       'BaseType' => '53599',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '86',
                                       'Name' => 'ASN1_OCTET_STRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '53693' => {
                                       'BaseType' => '53599',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '87',
                                       'Name' => 'ASN1_PRINTABLESTRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '53704' => {
                                       'BaseType' => '53599',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '88',
                                       'Name' => 'ASN1_T61STRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '53715' => {
                                       'BaseType' => '53599',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '89',
                                       'Name' => 'ASN1_IA5STRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '53726' => {
                                       'BaseType' => '53599',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '90',
                                       'Name' => 'ASN1_GENERALSTRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '53737' => {
                                       'BaseType' => '53599',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '91',
                                       'Name' => 'ASN1_UNIVERSALSTRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '53748' => {
                                       'BaseType' => '53599',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '92',
                                       'Name' => 'ASN1_BMPSTRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '53759' => {
                                       'BaseType' => '53599',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '93',
                                       'Name' => 'ASN1_UTCTIME',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '53770' => {
                                       'BaseType' => '53599',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '94',
                                       'Name' => 'ASN1_TIME',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '53781' => {
                                       'BaseType' => '53599',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '95',
                                       'Name' => 'ASN1_GENERALIZEDTIME',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '53792' => {
                                       'BaseType' => '53599',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '96',
                                       'Name' => 'ASN1_VISIBLESTRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '53803' => {
                                       'BaseType' => '53599',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '97',
                                       'Name' => 'ASN1_UTF8STRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '53814' => {
                                       'BaseType' => '53599',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '98',
                                       'Name' => 'ASN1_STRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '53825' => {
                                       'BaseType' => '191',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '99',
                                       'Name' => 'ASN1_BOOLEAN',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '53836' => {
                                       'BaseType' => '53847',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '103',
                                       'Name' => 'ASN1_OBJECT',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '53847' => {
                                       'Header' => 'asn1.h',
                                       'Line' => '210',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sn',
                                                            'offset' => '0',
                                                            'type' => '369'
                                                          },
                                                   '1' => {
                                                            'name' => 'ln',
                                                            'offset' => '8',
                                                            'type' => '369'
                                                          },
                                                   '2' => {
                                                            'name' => 'nid',
                                                            'offset' => '16',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'length',
                                                            'offset' => '20',
                                                            'type' => '191'
                                                          },
                                                   '4' => {
                                                            'name' => 'data',
                                                            'offset' => '24',
                                                            'type' => '61655'
                                                          },
                                                   '5' => {
                                                            'name' => 'flags',
                                                            'offset' => '32',
                                                            'type' => '191'
                                                          }
                                                 },
                                       'Name' => 'struct asn1_object_st',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '53930' => {
                                       'BaseType' => '53941',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '120',
                                       'Name' => 'BIGNUM',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '53941' => {
                                       'Header' => 'bn.h',
                                       'Line' => '313',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'd',
                                                            'offset' => '0',
                                                            'type' => '61510'
                                                          },
                                                   '1' => {
                                                            'name' => 'top',
                                                            'offset' => '8',
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'name' => 'dmax',
                                                            'offset' => '12',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'neg',
                                                            'offset' => '16',
                                                            'type' => '191'
                                                          },
                                                   '4' => {
                                                            'name' => 'flags',
                                                            'offset' => '20',
                                                            'type' => '191'
                                                          }
                                                 },
                                       'Name' => 'struct bignum_st',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '54018' => {
                                       'BaseType' => '54029',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '121',
                                       'Name' => 'BN_CTX',
                                       'Type' => 'Typedef'
                                     },
                          '54029' => {
                                       'Name' => 'struct bignum_ctx',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '54034' => {
                                       'BaseType' => '54045',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '122',
                                       'Name' => 'BN_BLINDING',
                                       'Type' => 'Typedef'
                                     },
                          '54045' => {
                                       'Name' => 'struct bn_blinding_st',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '54050' => {
                                       'BaseType' => '54061',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '123',
                                       'Name' => 'BN_MONT_CTX',
                                       'Size' => '104',
                                       'Type' => 'Typedef'
                                     },
                          '54061' => {
                                       'Header' => 'bn.h',
                                       'Line' => '324',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ri',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'RR',
                                                            'offset' => '8',
                                                            'type' => '53930'
                                                          },
                                                   '2' => {
                                                            'name' => 'N',
                                                            'offset' => '32',
                                                            'type' => '53930'
                                                          },
                                                   '3' => {
                                                            'name' => 'Ni',
                                                            'offset' => '56',
                                                            'type' => '53930'
                                                          },
                                                   '4' => {
                                                            'name' => 'n0',
                                                            'offset' => '80',
                                                            'type' => '61516'
                                                          },
                                                   '5' => {
                                                            'name' => 'flags',
                                                            'offset' => '96',
                                                            'type' => '191'
                                                          }
                                                 },
                                       'Name' => 'struct bn_mont_ctx_st',
                                       'PrivateABI' => 1,
                                       'Size' => '104',
                                       'Type' => 'Struct'
                                     },
                          '54147' => {
                                       'BaseType' => '54158',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '125',
                                       'Name' => 'BN_GENCB',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '54158' => {
                                       'Header' => 'bn.h',
                                       'Line' => '349',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ver',
                                                            'offset' => '0',
                                                            'type' => '163'
                                                          },
                                                   '1' => {
                                                            'name' => 'arg',
                                                            'offset' => '8',
                                                            'type' => '234'
                                                          },
                                                   '2' => {
                                                            'name' => 'cb',
                                                            'offset' => '16',
                                                            'type' => '61532'
                                                          }
                                                 },
                                       'Name' => 'struct bn_gencb_st',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '54210' => {
                                       'BaseType' => '54221',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '127',
                                       'Name' => 'BUF_MEM',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '54221' => {
                                       'Header' => 'buffer.h',
                                       'Line' => '77',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'length',
                                                            'offset' => '0',
                                                            'type' => '260'
                                                          },
                                                   '1' => {
                                                            'name' => 'data',
                                                            'offset' => '8',
                                                            'type' => '236'
                                                          },
                                                   '2' => {
                                                            'name' => 'max',
                                                            'offset' => '16',
                                                            'type' => '260'
                                                          }
                                                 },
                                       'Name' => 'struct buf_mem_st',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '54270' => {
                                       'BaseType' => '54281',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '129',
                                       'Name' => 'EVP_CIPHER',
                                       'Size' => '88',
                                       'Type' => 'Typedef'
                                     },
                          '54281' => {
                                       'Header' => 'evp.h',
                                       'Line' => '311',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'nid',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'block_size',
                                                            'offset' => '4',
                                                            'type' => '191'
                                                          },
                                                   '10' => {
                                                             'name' => 'get_asn1_parameters',
                                                             'offset' => '64',
                                                             'type' => '62755'
                                                           },
                                                   '11' => {
                                                             'name' => 'ctrl',
                                                             'offset' => '72',
                                                             'type' => '62791'
                                                           },
                                                   '12' => {
                                                             'name' => 'app_data',
                                                             'offset' => '80',
                                                             'type' => '234'
                                                           },
                                                   '2' => {
                                                            'name' => 'key_len',
                                                            'offset' => '8',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'iv_len',
                                                            'offset' => '12',
                                                            'type' => '191'
                                                          },
                                                   '4' => {
                                                            'name' => 'flags',
                                                            'offset' => '16',
                                                            'type' => '170'
                                                          },
                                                   '5' => {
                                                            'name' => 'init',
                                                            'offset' => '24',
                                                            'type' => '62666'
                                                          },
                                                   '6' => {
                                                            'name' => 'do_cipher',
                                                            'offset' => '32',
                                                            'type' => '62702'
                                                          },
                                                   '7' => {
                                                            'name' => 'cleanup',
                                                            'offset' => '40',
                                                            'type' => '62723'
                                                          },
                                                   '8' => {
                                                            'name' => 'ctx_size',
                                                            'offset' => '48',
                                                            'type' => '191'
                                                          },
                                                   '9' => {
                                                            'name' => 'set_asn1_parameters',
                                                            'offset' => '56',
                                                            'type' => '62755'
                                                          }
                                                 },
                                       'Name' => 'struct evp_cipher_st',
                                       'PrivateABI' => 1,
                                       'Size' => '88',
                                       'Type' => 'Struct'
                                     },
                          '54464' => {
                                       'BaseType' => '54475',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '130',
                                       'Name' => 'EVP_CIPHER_CTX',
                                       'Size' => '168',
                                       'Type' => 'Typedef'
                                     },
                          '54475' => {
                                       'Header' => 'evp.h',
                                       'Line' => '452',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cipher',
                                                            'offset' => '0',
                                                            'type' => '62797'
                                                          },
                                                   '1' => {
                                                            'name' => 'engine',
                                                            'offset' => '8',
                                                            'type' => '62305'
                                                          },
                                                   '10' => {
                                                             'name' => 'flags',
                                                             'offset' => '112',
                                                             'type' => '170'
                                                           },
                                                   '11' => {
                                                             'name' => 'cipher_data',
                                                             'offset' => '120',
                                                             'type' => '234'
                                                           },
                                                   '12' => {
                                                             'name' => 'final_used',
                                                             'offset' => '128',
                                                             'type' => '191'
                                                           },
                                                   '13' => {
                                                             'name' => 'block_mask',
                                                             'offset' => '132',
                                                             'type' => '191'
                                                           },
                                                   '14' => {
                                                             'name' => 'final',
                                                             'offset' => '136',
                                                             'type' => '62824'
                                                           },
                                                   '2' => {
                                                            'name' => 'encrypt',
                                                            'offset' => '16',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'buf_len',
                                                            'offset' => '20',
                                                            'type' => '191'
                                                          },
                                                   '4' => {
                                                            'name' => 'oiv',
                                                            'offset' => '24',
                                                            'type' => '62808'
                                                          },
                                                   '5' => {
                                                            'name' => 'iv',
                                                            'offset' => '40',
                                                            'type' => '62808'
                                                          },
                                                   '6' => {
                                                            'name' => 'buf',
                                                            'offset' => '56',
                                                            'type' => '62824'
                                                          },
                                                   '7' => {
                                                            'name' => 'num',
                                                            'offset' => '88',
                                                            'type' => '191'
                                                          },
                                                   '8' => {
                                                            'name' => 'app_data',
                                                            'offset' => '96',
                                                            'type' => '234'
                                                          },
                                                   '9' => {
                                                            'name' => 'key_len',
                                                            'offset' => '104',
                                                            'type' => '191'
                                                          }
                                                 },
                                       'Name' => 'struct evp_cipher_ctx_st',
                                       'PrivateABI' => 1,
                                       'Size' => '168',
                                       'Type' => 'Struct'
                                     },
                          '54683' => {
                                       'BaseType' => '54694',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '131',
                                       'Name' => 'EVP_MD',
                                       'Size' => '120',
                                       'Type' => 'Typedef'
                                     },
                          '54694' => {
                                       'Header' => 'evp.h',
                                       'Line' => '164',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'pkey_type',
                                                            'offset' => '4',
                                                            'type' => '191'
                                                          },
                                                   '10' => {
                                                             'name' => 'verify',
                                                             'offset' => '72',
                                                             'type' => '62555'
                                                           },
                                                   '11' => {
                                                             'name' => 'required_pkey_type',
                                                             'offset' => '80',
                                                             'type' => '62561'
                                                           },
                                                   '12' => {
                                                             'name' => 'block_size',
                                                             'offset' => '100',
                                                             'type' => '191'
                                                           },
                                                   '13' => {
                                                             'name' => 'ctx_size',
                                                             'offset' => '104',
                                                             'type' => '191'
                                                           },
                                                   '14' => {
                                                             'name' => 'md_ctrl',
                                                             'offset' => '112',
                                                             'type' => '62607'
                                                           },
                                                   '2' => {
                                                            'name' => 'md_size',
                                                            'offset' => '8',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'flags',
                                                            'offset' => '16',
                                                            'type' => '170'
                                                          },
                                                   '4' => {
                                                            'name' => 'init',
                                                            'offset' => '24',
                                                            'type' => '62363'
                                                          },
                                                   '5' => {
                                                            'name' => 'update',
                                                            'offset' => '32',
                                                            'type' => '62394'
                                                          },
                                                   '6' => {
                                                            'name' => 'final',
                                                            'offset' => '40',
                                                            'type' => '62420'
                                                          },
                                                   '7' => {
                                                            'name' => 'copy',
                                                            'offset' => '48',
                                                            'type' => '62457'
                                                          },
                                                   '8' => {
                                                            'name' => 'cleanup',
                                                            'offset' => '56',
                                                            'type' => '62363'
                                                          },
                                                   '9' => {
                                                            'name' => 'sign',
                                                            'offset' => '64',
                                                            'type' => '62509'
                                                          }
                                                 },
                                       'Name' => 'struct env_md_st',
                                       'PrivateABI' => 1,
                                       'Size' => '120',
                                       'Type' => 'Struct'
                                     },
                          '54887' => {
                                       'BaseType' => '54898',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '132',
                                       'Name' => 'EVP_MD_CTX',
                                       'Size' => '48',
                                       'Type' => 'Typedef'
                                     },
                          '54898' => {
                                       'Header' => 'evp.h',
                                       'Line' => '272',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'digest',
                                                            'offset' => '0',
                                                            'type' => '62613'
                                                          },
                                                   '1' => {
                                                            'name' => 'engine',
                                                            'offset' => '8',
                                                            'type' => '62305'
                                                          },
                                                   '2' => {
                                                            'name' => 'flags',
                                                            'offset' => '16',
                                                            'type' => '170'
                                                          },
                                                   '3' => {
                                                            'name' => 'md_data',
                                                            'offset' => '24',
                                                            'type' => '234'
                                                          },
                                                   '4' => {
                                                            'name' => 'pctx',
                                                            'offset' => '32',
                                                            'type' => '62624'
                                                          },
                                                   '5' => {
                                                            'name' => 'update',
                                                            'offset' => '40',
                                                            'type' => '62394'
                                                          }
                                                 },
                                       'Name' => 'struct env_md_ctx_st',
                                       'PrivateABI' => 1,
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '54990' => {
                                       'BaseType' => '55001',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '133',
                                       'Name' => 'EVP_PKEY',
                                       'Size' => '56',
                                       'Type' => 'Typedef'
                                     },
                          '55001' => {
                                       'Header' => 'evp.h',
                                       'Line' => '133',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'save_type',
                                                            'offset' => '4',
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'name' => 'references',
                                                            'offset' => '8',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'ameth',
                                                            'offset' => '16',
                                                            'type' => '62294'
                                                          },
                                                   '4' => {
                                                            'name' => 'engine',
                                                            'offset' => '24',
                                                            'type' => '62305'
                                                          },
                                                   '5' => {
                                                            'name' => 'pkey',
                                                            'offset' => '32',
                                                            'type' => '62203'
                                                          },
                                                   '6' => {
                                                            'name' => 'save_parameters',
                                                            'offset' => '40',
                                                            'type' => '191'
                                                          },
                                                   '7' => {
                                                            'name' => 'attributes',
                                                            'offset' => '48',
                                                            'type' => '62336'
                                                          }
                                                 },
                                       'Name' => 'struct evp_pkey_st',
                                       'PrivateABI' => 1,
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '55110' => {
                                       'BaseType' => '55121',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '135',
                                       'Name' => 'EVP_PKEY_ASN1_METHOD',
                                       'Type' => 'Typedef'
                                     },
                          '55121' => {
                                       'Name' => 'struct evp_pkey_asn1_method_st',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '55126' => {
                                       'BaseType' => '55137',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '138',
                                       'Name' => 'EVP_PKEY_CTX',
                                       'Type' => 'Typedef'
                                     },
                          '55137' => {
                                       'Name' => 'struct evp_pkey_ctx_st',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '55142' => {
                                       'BaseType' => '55152',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '140',
                                       'Name' => 'DH',
                                       'Size' => '144',
                                       'Type' => 'Typedef'
                                     },
                          '55152' => {
                                       'Header' => 'dh.h',
                                       'Line' => '138',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pad',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '4',
                                                            'type' => '191'
                                                          },
                                                   '10' => {
                                                             'name' => 'j',
                                                             'offset' => '72',
                                                             'type' => '62852'
                                                           },
                                                   '11' => {
                                                             'name' => 'seed',
                                                             'offset' => '80',
                                                             'type' => '45809'
                                                           },
                                                   '12' => {
                                                             'name' => 'seedlen',
                                                             'offset' => '88',
                                                             'type' => '191'
                                                           },
                                                   '13' => {
                                                             'name' => 'counter',
                                                             'offset' => '96',
                                                             'type' => '62852'
                                                           },
                                                   '14' => {
                                                             'name' => 'references',
                                                             'offset' => '104',
                                                             'type' => '191'
                                                           },
                                                   '15' => {
                                                             'name' => 'ex_data',
                                                             'offset' => '112',
                                                             'type' => '60514'
                                                           },
                                                   '16' => {
                                                             'name' => 'meth',
                                                             'offset' => '128',
                                                             'type' => '63349'
                                                           },
                                                   '17' => {
                                                             'name' => 'engine',
                                                             'offset' => '136',
                                                             'type' => '62305'
                                                           },
                                                   '2' => {
                                                            'name' => 'p',
                                                            'offset' => '8',
                                                            'type' => '62852'
                                                          },
                                                   '3' => {
                                                            'name' => 'g',
                                                            'offset' => '16',
                                                            'type' => '62852'
                                                          },
                                                   '4' => {
                                                            'name' => 'length',
                                                            'offset' => '24',
                                                            'type' => '198'
                                                          },
                                                   '5' => {
                                                            'name' => 'pub_key',
                                                            'offset' => '32',
                                                            'type' => '62852'
                                                          },
                                                   '6' => {
                                                            'name' => 'priv_key',
                                                            'offset' => '40',
                                                            'type' => '62852'
                                                          },
                                                   '7' => {
                                                            'name' => 'flags',
                                                            'offset' => '48',
                                                            'type' => '191'
                                                          },
                                                   '8' => {
                                                            'name' => 'method_mont_p',
                                                            'offset' => '56',
                                                            'type' => '62998'
                                                          },
                                                   '9' => {
                                                            'name' => 'q',
                                                            'offset' => '64',
                                                            'type' => '62852'
                                                          }
                                                 },
                                       'Name' => 'struct dh_st',
                                       'PrivateABI' => 1,
                                       'Size' => '144',
                                       'Type' => 'Struct'
                                     },
                          '55373' => {
                                       'BaseType' => '55384',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '141',
                                       'Name' => 'DH_METHOD',
                                       'Size' => '72',
                                       'Type' => 'Typedef'
                                     },
                          '55384' => {
                                       'Header' => 'dh.h',
                                       'Line' => '120',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '369'
                                                          },
                                                   '1' => {
                                                            'name' => 'generate_key',
                                                            'offset' => '8',
                                                            'type' => '63214'
                                                          },
                                                   '2' => {
                                                            'name' => 'compute_key',
                                                            'offset' => '16',
                                                            'type' => '63245'
                                                          },
                                                   '3' => {
                                                            'name' => 'bn_mod_exp',
                                                            'offset' => '24',
                                                            'type' => '63307'
                                                          },
                                                   '4' => {
                                                            'name' => 'init',
                                                            'offset' => '32',
                                                            'type' => '63214'
                                                          },
                                                   '5' => {
                                                            'name' => 'finish',
                                                            'offset' => '40',
                                                            'type' => '63214'
                                                          },
                                                   '6' => {
                                                            'name' => 'flags',
                                                            'offset' => '48',
                                                            'type' => '191'
                                                          },
                                                   '7' => {
                                                            'name' => 'app_data',
                                                            'offset' => '56',
                                                            'type' => '236'
                                                          },
                                                   '8' => {
                                                            'name' => 'generate_params',
                                                            'offset' => '64',
                                                            'type' => '63343'
                                                          }
                                                 },
                                       'Name' => 'struct dh_method',
                                       'PrivateABI' => 1,
                                       'Size' => '72',
                                       'Type' => 'Struct'
                                     },
                          '55505' => {
                                       'BaseType' => '55516',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '143',
                                       'Name' => 'DSA',
                                       'Size' => '136',
                                       'Type' => 'Typedef'
                                     },
                          '55516' => {
                                       'Header' => 'dsa.h',
                                       'Line' => '158',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pad',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '8',
                                                            'type' => '198'
                                                          },
                                                   '10' => {
                                                             'name' => 'flags',
                                                             'offset' => '80',
                                                             'type' => '191'
                                                           },
                                                   '11' => {
                                                             'name' => 'method_mont_p',
                                                             'offset' => '88',
                                                             'type' => '62998'
                                                           },
                                                   '12' => {
                                                             'name' => 'references',
                                                             'offset' => '96',
                                                             'type' => '191'
                                                           },
                                                   '13' => {
                                                             'name' => 'ex_data',
                                                             'offset' => '104',
                                                             'type' => '60514'
                                                           },
                                                   '14' => {
                                                             'name' => 'meth',
                                                             'offset' => '120',
                                                             'type' => '63709'
                                                           },
                                                   '15' => {
                                                             'name' => 'engine',
                                                             'offset' => '128',
                                                             'type' => '62305'
                                                           },
                                                   '2' => {
                                                            'name' => 'write_params',
                                                            'offset' => '16',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'p',
                                                            'offset' => '24',
                                                            'type' => '62852'
                                                          },
                                                   '4' => {
                                                            'name' => 'q',
                                                            'offset' => '32',
                                                            'type' => '62852'
                                                          },
                                                   '5' => {
                                                            'name' => 'g',
                                                            'offset' => '40',
                                                            'type' => '62852'
                                                          },
                                                   '6' => {
                                                            'name' => 'pub_key',
                                                            'offset' => '48',
                                                            'type' => '62852'
                                                          },
                                                   '7' => {
                                                            'name' => 'priv_key',
                                                            'offset' => '56',
                                                            'type' => '62852'
                                                          },
                                                   '8' => {
                                                            'name' => 'kinv',
                                                            'offset' => '64',
                                                            'type' => '62852'
                                                          },
                                                   '9' => {
                                                            'name' => 'r',
                                                            'offset' => '72',
                                                            'type' => '62852'
                                                          }
                                                 },
                                       'Name' => 'struct dsa_st',
                                       'PrivateABI' => 1,
                                       'Size' => '136',
                                       'Type' => 'Struct'
                                     },
                          '55713' => {
                                       'BaseType' => '55724',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '144',
                                       'Name' => 'DSA_METHOD',
                                       'Size' => '96',
                                       'Type' => 'Typedef'
                                     },
                          '55724' => {
                                       'Header' => 'dsa.h',
                                       'Line' => '132',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '369'
                                                          },
                                                   '1' => {
                                                            'name' => 'dsa_do_sign',
                                                            'offset' => '8',
                                                            'type' => '63441'
                                                          },
                                                   '10' => {
                                                             'name' => 'dsa_paramgen',
                                                             'offset' => '80',
                                                             'type' => '63703'
                                                           },
                                                   '11' => {
                                                             'name' => 'dsa_keygen',
                                                             'offset' => '88',
                                                             'type' => '63652'
                                                           },
                                                   '2' => {
                                                            'name' => 'dsa_sign_setup',
                                                            'offset' => '16',
                                                            'type' => '63483'
                                                          },
                                                   '3' => {
                                                            'name' => 'dsa_do_verify',
                                                            'offset' => '24',
                                                            'type' => '63519'
                                                          },
                                                   '4' => {
                                                            'name' => 'dsa_mod_exp',
                                                            'offset' => '32',
                                                            'type' => '63580'
                                                          },
                                                   '5' => {
                                                            'name' => 'bn_mod_exp',
                                                            'offset' => '40',
                                                            'type' => '63631'
                                                          },
                                                   '6' => {
                                                            'name' => 'init',
                                                            'offset' => '48',
                                                            'type' => '63652'
                                                          },
                                                   '7' => {
                                                            'name' => 'finish',
                                                            'offset' => '56',
                                                            'type' => '63652'
                                                          },
                                                   '8' => {
                                                            'name' => 'flags',
                                                            'offset' => '64',
                                                            'type' => '191'
                                                          },
                                                   '9' => {
                                                            'name' => 'app_data',
                                                            'offset' => '72',
                                                            'type' => '236'
                                                          }
                                                 },
                                       'Name' => 'struct dsa_method',
                                       'PrivateABI' => 1,
                                       'Size' => '96',
                                       'Type' => 'Struct'
                                     },
                          '55881' => {
                                       'BaseType' => '55892',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '146',
                                       'Name' => 'RSA',
                                       'Size' => '168',
                                       'Type' => 'Typedef'
                                     },
                          '55892' => {
                                       'Header' => 'rsa.h',
                                       'Line' => '132',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pad',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '8',
                                                            'type' => '198'
                                                          },
                                                   '10' => {
                                                             'name' => 'dmq1',
                                                             'offset' => '80',
                                                             'type' => '62852'
                                                           },
                                                   '11' => {
                                                             'name' => 'iqmp',
                                                             'offset' => '88',
                                                             'type' => '62852'
                                                           },
                                                   '12' => {
                                                             'name' => 'ex_data',
                                                             'offset' => '96',
                                                             'type' => '60514'
                                                           },
                                                   '13' => {
                                                             'name' => 'references',
                                                             'offset' => '112',
                                                             'type' => '191'
                                                           },
                                                   '14' => {
                                                             'name' => 'flags',
                                                             'offset' => '116',
                                                             'type' => '191'
                                                           },
                                                   '15' => {
                                                             'name' => '_method_mod_n',
                                                             'offset' => '120',
                                                             'type' => '62998'
                                                           },
                                                   '16' => {
                                                             'name' => '_method_mod_p',
                                                             'offset' => '128',
                                                             'type' => '62998'
                                                           },
                                                   '17' => {
                                                             'name' => '_method_mod_q',
                                                             'offset' => '136',
                                                             'type' => '62998'
                                                           },
                                                   '18' => {
                                                             'name' => 'bignum_data',
                                                             'offset' => '144',
                                                             'type' => '236'
                                                           },
                                                   '19' => {
                                                             'name' => 'blinding',
                                                             'offset' => '152',
                                                             'type' => '63181'
                                                           },
                                                   '2' => {
                                                            'name' => 'meth',
                                                            'offset' => '16',
                                                            'type' => '63170'
                                                          },
                                                   '20' => {
                                                             'name' => 'mt_blinding',
                                                             'offset' => '160',
                                                             'type' => '63181'
                                                           },
                                                   '3' => {
                                                            'name' => 'engine',
                                                            'offset' => '24',
                                                            'type' => '62305'
                                                          },
                                                   '4' => {
                                                            'name' => 'n',
                                                            'offset' => '32',
                                                            'type' => '62852'
                                                          },
                                                   '5' => {
                                                            'name' => 'e',
                                                            'offset' => '40',
                                                            'type' => '62852'
                                                          },
                                                   '6' => {
                                                            'name' => 'd',
                                                            'offset' => '48',
                                                            'type' => '62852'
                                                          },
                                                   '7' => {
                                                            'name' => 'p',
                                                            'offset' => '56',
                                                            'type' => '62852'
                                                          },
                                                   '8' => {
                                                            'name' => 'q',
                                                            'offset' => '64',
                                                            'type' => '62852'
                                                          },
                                                   '9' => {
                                                            'name' => 'dmp1',
                                                            'offset' => '72',
                                                            'type' => '62852'
                                                          }
                                                 },
                                       'Name' => 'struct rsa_st',
                                       'PrivateABI' => 1,
                                       'Size' => '168',
                                       'Type' => 'Struct'
                                     },
                          '56147' => {
                                       'BaseType' => '56158',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '147',
                                       'Name' => 'RSA_METHOD',
                                       'Size' => '112',
                                       'Type' => 'Typedef'
                                     },
                          '56158' => {
                                       'Header' => 'rsa.h',
                                       'Line' => '85',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '369'
                                                          },
                                                   '1' => {
                                                            'name' => 'rsa_pub_enc',
                                                            'offset' => '8',
                                                            'type' => '62899'
                                                          },
                                                   '10' => {
                                                             'name' => 'app_data',
                                                             'offset' => '80',
                                                             'type' => '236'
                                                           },
                                                   '11' => {
                                                             'name' => 'rsa_sign',
                                                             'offset' => '88',
                                                             'type' => '63082'
                                                           },
                                                   '12' => {
                                                             'name' => 'rsa_verify',
                                                             'offset' => '96',
                                                             'type' => '63128'
                                                           },
                                                   '13' => {
                                                             'name' => 'rsa_keygen',
                                                             'offset' => '104',
                                                             'type' => '63164'
                                                           },
                                                   '2' => {
                                                            'name' => 'rsa_pub_dec',
                                                            'offset' => '16',
                                                            'type' => '62899'
                                                          },
                                                   '3' => {
                                                            'name' => 'rsa_priv_enc',
                                                            'offset' => '24',
                                                            'type' => '62899'
                                                          },
                                                   '4' => {
                                                            'name' => 'rsa_priv_dec',
                                                            'offset' => '32',
                                                            'type' => '62899'
                                                          },
                                                   '5' => {
                                                            'name' => 'rsa_mod_exp',
                                                            'offset' => '40',
                                                            'type' => '62952'
                                                          },
                                                   '6' => {
                                                            'name' => 'bn_mod_exp',
                                                            'offset' => '48',
                                                            'type' => '63004'
                                                          },
                                                   '7' => {
                                                            'name' => 'init',
                                                            'offset' => '56',
                                                            'type' => '63025'
                                                          },
                                                   '8' => {
                                                            'name' => 'finish',
                                                            'offset' => '64',
                                                            'type' => '63025'
                                                          },
                                                   '9' => {
                                                            'name' => 'flags',
                                                            'offset' => '72',
                                                            'type' => '191'
                                                          }
                                                 },
                                       'Name' => 'struct rsa_meth_st',
                                       'PrivateABI' => 1,
                                       'Size' => '112',
                                       'Type' => 'Struct'
                                     },
                          '56339' => {
                                       'BaseType' => '56350',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '154',
                                       'Name' => 'X509',
                                       'Size' => '184',
                                       'Type' => 'Typedef'
                                     },
                          '56350' => {
                                       'Header' => 'x509.h',
                                       'Line' => '270',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cert_info',
                                                            'offset' => '0',
                                                            'type' => '64236'
                                                          },
                                                   '1' => {
                                                            'name' => 'sig_alg',
                                                            'offset' => '8',
                                                            'type' => '63187'
                                                          },
                                                   '10' => {
                                                             'name' => 'ex_kusage',
                                                             'offset' => '80',
                                                             'type' => '170'
                                                           },
                                                   '11' => {
                                                             'name' => 'ex_xkusage',
                                                             'offset' => '88',
                                                             'type' => '170'
                                                           },
                                                   '12' => {
                                                             'name' => 'ex_nscert',
                                                             'offset' => '96',
                                                             'type' => '170'
                                                           },
                                                   '13' => {
                                                             'name' => 'skid',
                                                             'offset' => '104',
                                                             'type' => '62046'
                                                           },
                                                   '14' => {
                                                             'name' => 'akid',
                                                             'offset' => '112',
                                                             'type' => '64242'
                                                           },
                                                   '15' => {
                                                             'name' => 'policy_cache',
                                                             'offset' => '120',
                                                             'type' => '64248'
                                                           },
                                                   '16' => {
                                                             'name' => 'crldp',
                                                             'offset' => '128',
                                                             'type' => '64281'
                                                           },
                                                   '17' => {
                                                             'name' => 'altname',
                                                             'offset' => '136',
                                                             'type' => '64312'
                                                           },
                                                   '18' => {
                                                             'name' => 'nc',
                                                             'offset' => '144',
                                                             'type' => '64318'
                                                           },
                                                   '19' => {
                                                             'name' => 'sha1_hash',
                                                             'offset' => '152',
                                                             'type' => '64324'
                                                           },
                                                   '2' => {
                                                            'name' => 'signature',
                                                            'offset' => '16',
                                                            'type' => '62040'
                                                          },
                                                   '20' => {
                                                             'name' => 'aux',
                                                             'offset' => '176',
                                                             'type' => '64340'
                                                           },
                                                   '3' => {
                                                            'name' => 'valid',
                                                            'offset' => '24',
                                                            'type' => '191'
                                                          },
                                                   '4' => {
                                                            'name' => 'references',
                                                            'offset' => '28',
                                                            'type' => '191'
                                                          },
                                                   '5' => {
                                                            'name' => 'name',
                                                            'offset' => '32',
                                                            'type' => '236'
                                                          },
                                                   '6' => {
                                                            'name' => 'ex_data',
                                                            'offset' => '40',
                                                            'type' => '60514'
                                                          },
                                                   '7' => {
                                                            'name' => 'ex_pathlen',
                                                            'offset' => '56',
                                                            'type' => '198'
                                                          },
                                                   '8' => {
                                                            'name' => 'ex_pcpathlen',
                                                            'offset' => '64',
                                                            'type' => '198'
                                                          },
                                                   '9' => {
                                                            'name' => 'ex_flags',
                                                            'offset' => '72',
                                                            'type' => '170'
                                                          }
                                                 },
                                       'Name' => 'struct x509_st',
                                       'PrivateABI' => 1,
                                       'Size' => '184',
                                       'Type' => 'Struct'
                                     },
                          '56636' => {
                                       'BaseType' => '56647',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '155',
                                       'Name' => 'X509_ALGOR',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '56647' => {
                                       'Header' => 'x509.h',
                                       'Line' => '143',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'algorithm',
                                                            'offset' => '0',
                                                            'type' => '62022'
                                                          },
                                                   '1' => {
                                                            'name' => 'parameter',
                                                            'offset' => '8',
                                                            'type' => '62749'
                                                          }
                                                 },
                                       'Name' => 'struct X509_algor_st',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '56684' => {
                                       'BaseType' => '56695',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '156',
                                       'Name' => 'X509_CRL',
                                       'Size' => '120',
                                       'Type' => 'Typedef'
                                     },
                          '56695' => {
                                       'Header' => 'x509.h',
                                       'Line' => '452',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'crl',
                                                            'offset' => '0',
                                                            'type' => '64536'
                                                          },
                                                   '1' => {
                                                            'name' => 'sig_alg',
                                                            'offset' => '8',
                                                            'type' => '63187'
                                                          },
                                                   '10' => {
                                                             'name' => 'base_crl_number',
                                                             'offset' => '64',
                                                             'type' => '62028'
                                                           },
                                                   '11' => {
                                                             'name' => 'sha1_hash',
                                                             'offset' => '72',
                                                             'type' => '64324'
                                                           },
                                                   '12' => {
                                                             'name' => 'issuers',
                                                             'offset' => '96',
                                                             'type' => '64553'
                                                           },
                                                   '13' => {
                                                             'name' => 'meth',
                                                             'offset' => '104',
                                                             'type' => '64559'
                                                           },
                                                   '14' => {
                                                             'name' => 'meth_data',
                                                             'offset' => '112',
                                                             'type' => '234'
                                                           },
                                                   '2' => {
                                                            'name' => 'signature',
                                                            'offset' => '16',
                                                            'type' => '62040'
                                                          },
                                                   '3' => {
                                                            'name' => 'references',
                                                            'offset' => '24',
                                                            'type' => '191'
                                                          },
                                                   '4' => {
                                                            'name' => 'flags',
                                                            'offset' => '28',
                                                            'type' => '191'
                                                          },
                                                   '5' => {
                                                            'name' => 'akid',
                                                            'offset' => '32',
                                                            'type' => '64242'
                                                          },
                                                   '6' => {
                                                            'name' => 'idp',
                                                            'offset' => '40',
                                                            'type' => '64542'
                                                          },
                                                   '7' => {
                                                            'name' => 'idp_flags',
                                                            'offset' => '48',
                                                            'type' => '191'
                                                          },
                                                   '8' => {
                                                            'name' => 'idp_reasons',
                                                            'offset' => '52',
                                                            'type' => '191'
                                                          },
                                                   '9' => {
                                                            'name' => 'crl_number',
                                                            'offset' => '56',
                                                            'type' => '62028'
                                                          }
                                                 },
                                       'Name' => 'struct X509_crl_st',
                                       'PrivateABI' => 1,
                                       'Size' => '120',
                                       'Type' => 'Struct'
                                     },
                          '56904' => {
                                       'BaseType' => '56915',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '157',
                                       'Name' => 'X509_CRL_METHOD',
                                       'Type' => 'Typedef'
                                     },
                          '56915' => {
                                       'Name' => 'struct x509_crl_method_st',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '56920' => {
                                       'BaseType' => '56931',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '159',
                                       'Name' => 'X509_NAME',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '56931' => {
                                       'Header' => 'x509.h',
                                       'Line' => '179',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entries',
                                                            'offset' => '0',
                                                            'type' => '63880'
                                                          },
                                                   '1' => {
                                                            'name' => 'modified',
                                                            'offset' => '8',
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'name' => 'bytes',
                                                            'offset' => '16',
                                                            'type' => '63886'
                                                          },
                                                   '3' => {
                                                            'name' => 'canon_enc',
                                                            'offset' => '24',
                                                            'type' => '45809'
                                                          },
                                                   '4' => {
                                                            'name' => 'canon_enclen',
                                                            'offset' => '32',
                                                            'type' => '191'
                                                          }
                                                 },
                                       'Name' => 'struct X509_name_st',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '57004' => {
                                       'BaseType' => '57015',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '160',
                                       'Name' => 'X509_PUBKEY',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '57015' => {
                                       'Header' => 'x509.h',
                                       'Line' => '157',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'algor',
                                                            'offset' => '0',
                                                            'type' => '63187'
                                                          },
                                                   '1' => {
                                                            'name' => 'public_key',
                                                            'offset' => '8',
                                                            'type' => '62040'
                                                          },
                                                   '2' => {
                                                            'name' => 'pkey',
                                                            'offset' => '16',
                                                            'type' => '63801'
                                                          }
                                                 },
                                       'Name' => 'struct X509_pubkey_st',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '57064' => {
                                       'BaseType' => '57075',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '161',
                                       'Name' => 'X509_STORE',
                                       'Size' => '144',
                                       'Type' => 'Typedef'
                                     },
                          '57075' => {
                                       'Header' => 'x509_vfy.h',
                                       'Line' => '186',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cache',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'objs',
                                                            'offset' => '8',
                                                            'type' => '64812'
                                                          },
                                                   '10' => {
                                                             'name' => 'check_crl',
                                                             'offset' => '80',
                                                             'type' => '65008'
                                                           },
                                                   '11' => {
                                                             'name' => 'cert_crl',
                                                             'offset' => '88',
                                                             'type' => '65039'
                                                           },
                                                   '12' => {
                                                             'name' => 'lookup_certs',
                                                             'offset' => '96',
                                                             'type' => '65065'
                                                           },
                                                   '13' => {
                                                             'name' => 'lookup_crls',
                                                             'offset' => '104',
                                                             'type' => '65097'
                                                           },
                                                   '14' => {
                                                             'name' => 'cleanup',
                                                             'offset' => '112',
                                                             'type' => '64851'
                                                           },
                                                   '15' => {
                                                             'name' => 'ex_data',
                                                             'offset' => '120',
                                                             'type' => '60514'
                                                           },
                                                   '16' => {
                                                             'name' => 'references',
                                                             'offset' => '136',
                                                             'type' => '191'
                                                           },
                                                   '2' => {
                                                            'name' => 'get_cert_methods',
                                                            'offset' => '16',
                                                            'type' => '64818'
                                                          },
                                                   '3' => {
                                                            'name' => 'param',
                                                            'offset' => '24',
                                                            'type' => '64824'
                                                          },
                                                   '4' => {
                                                            'name' => 'verify',
                                                            'offset' => '32',
                                                            'type' => '64851'
                                                          },
                                                   '5' => {
                                                            'name' => 'verify_cb',
                                                            'offset' => '40',
                                                            'type' => '64877'
                                                          },
                                                   '6' => {
                                                            'name' => 'get_issuer',
                                                            'offset' => '48',
                                                            'type' => '64914'
                                                          },
                                                   '7' => {
                                                            'name' => 'check_issued',
                                                            'offset' => '56',
                                                            'type' => '64945'
                                                          },
                                                   '8' => {
                                                            'name' => 'check_revocation',
                                                            'offset' => '64',
                                                            'type' => '64851'
                                                          },
                                                   '9' => {
                                                            'name' => 'get_crl',
                                                            'offset' => '72',
                                                            'type' => '64982'
                                                          }
                                                 },
                                       'Name' => 'struct x509_store_st',
                                       'PrivateABI' => 1,
                                       'Size' => '144',
                                       'Type' => 'Struct'
                                     },
                          '57292' => {
                                       'BaseType' => '57303',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '162',
                                       'Name' => 'X509_STORE_CTX',
                                       'Size' => '248',
                                       'Type' => 'Typedef'
                                     },
                          '57303' => {
                                       'Header' => 'x509_vfy.h',
                                       'Line' => '236',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ctx',
                                                            'offset' => '0',
                                                            'type' => '65103'
                                                          },
                                                   '1' => {
                                                            'name' => 'current_method',
                                                            'offset' => '8',
                                                            'type' => '191'
                                                          },
                                                   '10' => {
                                                             'name' => 'check_issued',
                                                             'offset' => '80',
                                                             'type' => '64945'
                                                           },
                                                   '11' => {
                                                             'name' => 'check_revocation',
                                                             'offset' => '88',
                                                             'type' => '64851'
                                                           },
                                                   '12' => {
                                                             'name' => 'get_crl',
                                                             'offset' => '96',
                                                             'type' => '64982'
                                                           },
                                                   '13' => {
                                                             'name' => 'check_crl',
                                                             'offset' => '104',
                                                             'type' => '65008'
                                                           },
                                                   '14' => {
                                                             'name' => 'cert_crl',
                                                             'offset' => '112',
                                                             'type' => '65039'
                                                           },
                                                   '15' => {
                                                             'name' => 'check_policy',
                                                             'offset' => '120',
                                                             'type' => '64851'
                                                           },
                                                   '16' => {
                                                             'name' => 'lookup_certs',
                                                             'offset' => '128',
                                                             'type' => '65065'
                                                           },
                                                   '17' => {
                                                             'name' => 'lookup_crls',
                                                             'offset' => '136',
                                                             'type' => '65097'
                                                           },
                                                   '18' => {
                                                             'name' => 'cleanup',
                                                             'offset' => '144',
                                                             'type' => '64851'
                                                           },
                                                   '19' => {
                                                             'name' => 'valid',
                                                             'offset' => '152',
                                                             'type' => '191'
                                                           },
                                                   '2' => {
                                                            'name' => 'cert',
                                                            'offset' => '16',
                                                            'type' => '62170'
                                                          },
                                                   '20' => {
                                                             'name' => 'last_untrusted',
                                                             'offset' => '156',
                                                             'type' => '191'
                                                           },
                                                   '21' => {
                                                             'name' => 'chain',
                                                             'offset' => '160',
                                                             'type' => '64603'
                                                           },
                                                   '22' => {
                                                             'name' => 'tree',
                                                             'offset' => '168',
                                                             'type' => '65109'
                                                           },
                                                   '23' => {
                                                             'name' => 'explicit_policy',
                                                             'offset' => '176',
                                                             'type' => '191'
                                                           },
                                                   '24' => {
                                                             'name' => 'error_depth',
                                                             'offset' => '180',
                                                             'type' => '191'
                                                           },
                                                   '25' => {
                                                             'name' => 'error',
                                                             'offset' => '184',
                                                             'type' => '191'
                                                           },
                                                   '26' => {
                                                             'name' => 'current_cert',
                                                             'offset' => '192',
                                                             'type' => '62170'
                                                           },
                                                   '27' => {
                                                             'name' => 'current_issuer',
                                                             'offset' => '200',
                                                             'type' => '62170'
                                                           },
                                                   '28' => {
                                                             'name' => 'current_crl',
                                                             'offset' => '208',
                                                             'type' => '64597'
                                                           },
                                                   '29' => {
                                                             'name' => 'current_crl_score',
                                                             'offset' => '216',
                                                             'type' => '191'
                                                           },
                                                   '3' => {
                                                            'name' => 'untrusted',
                                                            'offset' => '24',
                                                            'type' => '64603'
                                                          },
                                                   '30' => {
                                                             'name' => 'current_reasons',
                                                             'offset' => '220',
                                                             'type' => '163'
                                                           },
                                                   '31' => {
                                                             'name' => 'parent',
                                                             'offset' => '224',
                                                             'type' => '64845'
                                                           },
                                                   '32' => {
                                                             'name' => 'ex_data',
                                                             'offset' => '232',
                                                             'type' => '60514'
                                                           },
                                                   '4' => {
                                                            'name' => 'crls',
                                                            'offset' => '32',
                                                            'type' => '65091'
                                                          },
                                                   '5' => {
                                                            'name' => 'param',
                                                            'offset' => '40',
                                                            'type' => '64824'
                                                          },
                                                   '6' => {
                                                            'name' => 'other_ctx',
                                                            'offset' => '48',
                                                            'type' => '234'
                                                          },
                                                   '7' => {
                                                            'name' => 'verify',
                                                            'offset' => '56',
                                                            'type' => '64851'
                                                          },
                                                   '8' => {
                                                            'name' => 'verify_cb',
                                                            'offset' => '64',
                                                            'type' => '64877'
                                                          },
                                                   '9' => {
                                                            'name' => 'get_issuer',
                                                            'offset' => '72',
                                                            'type' => '64914'
                                                          }
                                                 },
                                       'Name' => 'struct x509_store_ctx_st',
                                       'PrivateABI' => 1,
                                       'Size' => '248',
                                       'Type' => 'Struct'
                                     },
                          '57736' => {
                                       'BaseType' => '57747',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '177',
                                       'Name' => 'ENGINE',
                                       'Type' => 'Typedef'
                                     },
                          '57747' => {
                                       'Name' => 'struct engine_st',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '57752' => {
                                       'BaseType' => '57763',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '178',
                                       'Name' => 'SSL',
                                       'Size' => '824',
                                       'Type' => 'Typedef'
                                     },
