$VAR1 = {
          'ABI_DUMPER_VERSION' => '0.99.19',
          'ABI_DUMP_VERSION' => '3.3',
          'Arch' => 'x86_64',
          'GccVersion' => '4.8.5',
          'Headers' => {
                         'serf.h' => 1,
                         'serf_bucket_types.h' => 1,
                         'serf_bucket_util.h' => 1,
                         'serf_private.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libserf-0.so.0.0.0',
          'LibraryVersion' => '0.6.1',
          'NameSpaces' => {},
          'Needed' => {
                        'libapr-1.so.0' => 1,
                        'libaprutil-1.so.0' => 1,
                        'libc.so.6' => 1,
                        'libcrypto.so.1.0.0' => 1,
                        'libdb-4.8.so' => 1,
                        'libdl.so.2' => 1,
                        'libexpat.so.1' => 1,
                        'liblber-2.4.so.2' => 1,
                        'libldap-2.4.so.2' => 1,
                        'libm.so.6' => 1,
                        'libpthread.so.0' => 1,
                        'librt.so.1' => 1,
                        'libssl.so.1.0.0' => 1,
                        'libz.so.1' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'aggregate_buckets.c' => 1,
                         'allocator.c' => 1,
                         'auth.c' => 1,
                         'barrier_buckets.c' => 1,

                                                   'serf_debug__closed_conn' => 1,
                                                   'serf_debug__entered_loop' => 1,
                                                   'serf_debug__record_read' => 1,
                                                   'serf_default_destroy' => 1,
                                                   'serf_default_destroy_and_data' => 1,
                                                   'serf_default_is_snapshot_set' => 1,
                                                   'serf_default_read_bucket' => 1,
                                                   'serf_default_read_for_sendfile' => 1,
                                                   'serf_default_read_iovec' => 1,
                                                   'serf_default_restore_snapshot' => 1,
                                                   'serf_default_snapshot' => 1,
                                                   'serf_event_trigger' => 1,
                                                   'serf_incoming_create' => 1,
                                                   'serf_lib_version' => 1,
                                                   'serf_linebuf_fetch' => 1,
                                                   'serf_linebuf_init' => 1,
                                                   'serf_listener_create' => 1,
                                                   'serf_request_bucket_request_create' => 1,
                                                   'serf_request_cancel' => 1,
                                                   'serf_request_get_alloc' => 1,
                                                   'serf_request_get_conn' => 1,
                                                   'serf_request_get_pool' => 1,
                                                   'serf_request_set_handler' => 1,
                                                   'serf_ssl_cert_certificate' => 1,
                                                   'serf_ssl_cert_depth' => 1,
                                                   'serf_ssl_cert_export' => 1,
                                                   'serf_ssl_cert_issuer' => 1,
                                                   'serf_ssl_cert_subject' => 1,
                                                   'serf_ssl_client_cert_password_set' => 1,
                                                   'serf_ssl_client_cert_provider_set' => 1,
                                                   'serf_ssl_load_cert_file' => 1,
                                                   'serf_ssl_server_cert_callback_set' => 1,
                                                   'serf_ssl_trust_cert' => 1,
                                                   'serf_ssl_use_default_certificates' => 1,
                                                   'serf_util_readline' => 1
                                                 }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '10093' => {
                                       'Name' => 'struct hostent',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '10098' => {
                                       'BaseType' => '10093',
                                       'Name' => 'struct hostent*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10104' => {
                                       'BaseType' => '10115',
                                       'Header' => 'serf.h',
                                       'Line' => '40',
                                       'Name' => 'serf_context_t',
                                       'Size' => '152',
                                       'Type' => 'Typedef'
                                     },
                          '10115' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '85',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pool',
                                                            'offset' => '0',
                                                            'type' => '4754'
                                                          },
                                                   '1' => {
                                                            'name' => 'pollset_baton',
                                                            'offset' => '8',
                                                            'type' => '234'
                                                          },
                                                   '10' => {
                                                             'name' => 'progress_written',
                                                             'offset' => '80',
                                                             'type' => '346'
                                                           },
                                                   '11' => {
                                                             'name' => 'authn_info',
                                                             'offset' => '88',
                                                             'type' => '12716'
                                                           },
                                                   '12' => {
                                                             'name' => 'proxy_authn_info',
                                                             'offset' => '112',
                                                             'type' => '12716'
                                                           },
                                                   '13' => {
                                                             'name' => 'authn_types',
                                                             'offset' => '136',
                                                             'type' => '191'
                                                           },
                                                   '14' => {
                                                             'name' => 'cred_cb',
                                                             'offset' => '144',
                                                             'type' => '11779'
                                                           },
                                                   '2' => {
                                                            'name' => 'pollset_add',
                                                            'offset' => '16',
                                                            'type' => '11472'
                                                          },
                                                   '3' => {
                                                            'name' => 'pollset_rm',
                                                            'offset' => '24',
                                                            'type' => '11514'
                                                          },
                                                   '4' => {
                                                            'name' => 'dirty_pollset',
                                                            'offset' => '32',
                                                            'type' => '191'
                                                          },
                                                   '5' => {
                                                            'name' => 'conns',
                                                            'offset' => '40',
                                                            'type' => '12727'
                                                          },
                                                   '6' => {
                                                            'name' => 'proxy_address',
                                                            'offset' => '48',
                                                            'type' => '9676'
                                                          },
                                                   '7' => {
                                                            'name' => 'progress_func',
                                                            'offset' => '56',
                                                            'type' => '11525'
                                                          },
                                                   '8' => {
                                                            'name' => 'progress_baton',
                                                            'offset' => '64',
                                                            'type' => '234'
                                                          },
                                                   '9' => {
                                                            'name' => 'progress_read',
                                                            'offset' => '72',
                                                            'type' => '346'
                                                          }
                                                 },
                                       'Name' => 'struct serf_context_t',
                                       'Size' => '152',
                                       'Type' => 'Struct'
                                     },
                          '1033' => {
                                      'BaseType' => '1044',
                                      'Header' => 'serf.h',
                                      'Line' => '43',
                                      'Name' => 'serf_bucket_type_t',
                                      'Size' => '88',
                                      'Type' => 'Typedef'
                                    },
                          '1044' => {
                                      'Header' => 'serf.h',
                                      'Line' => '664',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'name',
                                                           'offset' => '0',
                                                           'type' => '369'
                                                         },
                                                  '1' => {
                                                           'name' => 'read',
                                                           'offset' => '8',
                                                           'type' => '1265'
                                                         },
                                                  '10' => {
                                                            'name' => 'is_snapshot_set',
                                                            'offset' => '80',
                                                            'type' => '1538'
                                                          },
                                                  '2' => {
                                                           'name' => 'readline',
                                                           'offset' => '16',
                                                           'type' => '1306'
                                                         },
                                                  '3' => {
                                                           'name' => 'read_iovec',
                                                           'offset' => '24',
                                                           'type' => '1347'
                                                         },
                                                  '4' => {
                                                           'name' => 'read_for_sendfile',
                                                           'offset' => '32',
                                                           'type' => '1411'
                                                         },
                                                  '5' => {
                                                           'name' => 'read_bucket',
                                                           'offset' => '40',
                                                           'type' => '1448'
                                                         },
                                                  '6' => {
                                                           'name' => 'peek',
                                                           'offset' => '48',
                                                           'type' => '1479'
                                                         },
                                                  '7' => {
                                                           'name' => 'destroy',
                                                           'offset' => '56',
                                                           'type' => '1496'
                                                         },
                                                  '8' => {
                                                           'name' => 'snapshot',
                                                           'offset' => '64',
                                                           'type' => '1517'
                                                         },
                                                  '9' => {
                                                           'name' => 'restore_snapshot',
                                                           'offset' => '72',
                                                           'type' => '1517'
                                                         }
                                                },
                                      'Name' => 'struct serf_bucket_type_t',
                                      'Size' => '88',
                                      'Type' => 'Struct'
                                    },
                          '10556' => {
                                       'BaseType' => '10567',
                                       'Header' => 'serf.h',
                                       'Line' => '46',
                                       'Name' => 'serf_connection_t',
                                       'Size' => '16744',
                                       'Type' => 'Typedef'
                                     },
                          '10567' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '138',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ctx',
                                                            'offset' => '0',
                                                            'type' => '11906'
                                                          },
                                                   '1' => {
                                                            'name' => 'status',
                                                            'offset' => '8',
                                                            'type' => '358'
                                                          },
                                                   '10' => {
                                                             'name' => 'dirty_conn',
                                                             'offset' => '76',
                                                             'type' => '191'
                                                           },
                                                   '11' => {
                                                             'name' => 'completed_requests',
                                                             'offset' => '80',
                                                             'type' => '163'
                                                           },
                                                   '12' => {
                                                             'name' => 'completed_responses',
                                                             'offset' => '84',
                                                             'type' => '163'
                                                           },
                                                   '13' => {
                                                             'name' => 'probable_keepalive_limit',
                                                             'offset' => '88',
                                                             'type' => '163'
                                                           },
                                                   '14' => {
                                                             'name' => 'closing',
                                                             'offset' => '92',
                                                             'type' => '191'
                                                           },
                                                   '15' => {
                                                             'name' => 'async_responses',
                                                             'offset' => '96',
                                                             'type' => '191'
                                                           },
                                                   '16' => {
                                                             'name' => 'current_async_response',
                                                             'offset' => '104',
                                                             'type' => '1217'
                                                           },
                                                   '17' => {
                                                             'name' => 'async_acceptor',
                                                             'offset' => '112',
                                                             'type' => '11627'
                                                           },
                                                   '18' => {
                                                             'name' => 'async_acceptor_baton',
                                                             'offset' => '120',
                                                             'type' => '234'
                                                           },
                                                   '19' => {
                                                             'name' => 'async_handler',
                                                             'offset' => '128',
                                                             'type' => '11731'
                                                           },
                                                   '2' => {
                                                            'name' => 'baton',
                                                            'offset' => '16',
                                                            'type' => '12597'
                                                          },
                                                   '20' => {
                                                             'name' => 'async_handler_baton',
                                                             'offset' => '136',
                                                             'type' => '234'
                                                           },
                                                   '21' => {
                                                             'name' => 'stream',
                                                             'offset' => '144',
                                                             'type' => '1217'
                                                           },
                                                   '22' => {
                                                             'name' => 'ostream_head',
                                                             'offset' => '152',
                                                             'type' => '1217'
                                                           },
                                                   '23' => {
                                                             'name' => 'ostream_tail',
                                                             'offset' => '160',
                                                             'type' => '1217'
                                                           },
                                                   '24' => {
                                                             'name' => 'requests',
                                                             'offset' => '168',
                                                             'type' => '11675'
                                                           },
                                                   '25' => {
                                                             'name' => 'requests_tail',
                                                             'offset' => '176',
                                                             'type' => '11675'
                                                           },
                                                   '26' => {
                                                             'name' => 'hold_requests',
                                                             'offset' => '184',
                                                             'type' => '11675'
                                                           },
                                                   '27' => {
                                                             'name' => 'hold_requests_tail',
                                                             'offset' => '192',
                                                             'type' => '11675'
                                                           },
                                                   '28' => {
                                                             'name' => 'vec',
                                                             'offset' => '200',
                                                             'type' => '12733'
                                                           },
                                                   '29' => {
                                                             'name' => 'vec_len',
                                                             'offset' => '16584',
                                                             'type' => '191'
                                                           },
                                                   '3' => {
                                                            'name' => 'pool',
                                                            'offset' => '32',
                                                            'type' => '4754'
                                                          },
                                                   '30' => {
                                                             'name' => 'setup',
                                                             'offset' => '16592',
                                                             'type' => '11563'
                                                           },
                                                   '31' => {
                                                             'name' => 'setup_baton',
                                                             'offset' => '16600',
                                                             'type' => '234'
                                                           },
                                                   '32' => {
                                                             'name' => 'closed',
                                                             'offset' => '16608',
                                                             'type' => '11681'
                                                           },
                                                   '33' => {
                                                             'name' => 'closed_baton',
                                                             'offset' => '16616',
                                                             'type' => '234'
                                                           },
                                                   '34' => {
                                                             'name' => 'max_outstanding_requests',
                                                             'offset' => '16624',
                                                             'type' => '163'
                                                           },
                                                   '35' => {
                                                             'name' => 'hit_eof',
                                                             'offset' => '16628',
                                                             'type' => '191'
                                                           },
                                                   '36' => {
                                                             'name' => 'host_url',
                                                             'offset' => '16632',
                                                             'type' => '369'
                                                           },
                                                   '37' => {
                                                             'name' => 'host_info',
                                                             'offset' => '16640',
                                                             'type' => '9892'
                                                           },
                                                   '38' => {
                                                             'name' => 'authn_baton',
                                                             'offset' => '16728',
                                                             'type' => '234'
                                                           },
                                                   '39' => {
                                                             'name' => 'proxy_authn_baton',
                                                             'offset' => '16736',
                                                             'type' => '234'
                                                           },
                                                   '4' => {
                                                            'name' => 'allocator',
                                                            'offset' => '40',
                                                            'type' => '1544'
                                                          },
                                                   '5' => {
                                                            'name' => 'address',
                                                            'offset' => '48',
                                                            'type' => '9676'
                                                          },
                                                   '6' => {
                                                            'name' => 'skt',
                                                            'offset' => '56',
                                                            'type' => '9759'
                                                          },
                                                   '7' => {
                                                            'name' => 'skt_pool',
                                                            'offset' => '64',
                                                            'type' => '4754'
                                                          },
                                                   '8' => {
                                                            'name' => 'reqevents',
                                                            'offset' => '72',
                                                            'type' => '8445'
                                                          },
                                                   '9' => {
                                                            'name' => 'seen_in_pollset',
                                                            'offset' => '74',
                                                            'type' => '8445'
                                                          }
                                                 },
                                       'Name' => 'struct serf_connection_t',
                                       'Size' => '16744',
                                       'Type' => 'Struct'
                                     },
                          '11072' => {
                                       'BaseType' => '11083',
                                       'Header' => 'serf.h',
                                       'Line' => '47',
                                       'Name' => 'serf_listener_t',
                                       'Size' => '88',
                                       'Type' => 'Typedef'
                                     },
                          '11083' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '119',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ctx',
                                                            'offset' => '0',
                                                            'type' => '11906'
                                                          },
                                                   '1' => {
                                                            'name' => 'baton',
                                                            'offset' => '8',
                                                            'type' => '12597'
                                                          },
                                                   '2' => {
                                                            'name' => 'skt',
                                                            'offset' => '24',
                                                            'type' => '9759'
                                                          },
                                                   '3' => {
                                                            'name' => 'pool',
                                                            'offset' => '32',
                                                            'type' => '4754'
                                                          },
                                                   '4' => {
                                                            'name' => 'desc',
                                                            'offset' => '40',
                                                            'type' => '9776'
                                                          },
                                                   '5' => {
                                                            'name' => 'accept_baton',
                                                            'offset' => '72',
                                                            'type' => '234'
                                                          },
                                                   '6' => {
                                                            'name' => 'accept',
                                                            'offset' => '80',
                                                            'type' => '11853'
                                                          }
                                                 },
                                       'Name' => 'struct serf_listener_t',
                                       'Size' => '88',
                                       'Type' => 'Struct'
                                     },
                          '11180' => {
                                       'BaseType' => '11191',
                                       'Header' => 'serf.h',
                                       'Line' => '48',
                                       'Name' => 'serf_incoming_t',
                                       'Size' => '80',
                                       'Type' => 'Typedef'
                                     },
                          '11191' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '129',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ctx',
                                                            'offset' => '0',
                                                            'type' => '11906'
                                                          },
                                                   '1' => {
                                                            'name' => 'baton',
                                                            'offset' => '8',
                                                            'type' => '12597'
                                                          },
                                                   '2' => {
                                                            'name' => 'request_baton',
                                                            'offset' => '24',
                                                            'type' => '234'
                                                          },
                                                   '3' => {
                                                            'name' => 'request',
                                                            'offset' => '32',
                                                            'type' => '11918'
                                                          },
                                                   '4' => {
                                                            'name' => 'skt',
                                                            'offset' => '40',
                                                            'type' => '9759'
                                                          },
                                                   '5' => {
                                                            'name' => 'desc',
                                                            'offset' => '48',
                                                            'type' => '9776'
                                                          }
                                                 },
                                       'Name' => 'struct serf_incoming_t',
                                       'Size' => '80',
                                       'Type' => 'Struct'
                                     },
                          '11276' => {
                                       'BaseType' => '11287',
                                       'Header' => 'serf.h',
                                       'Line' => '49',
                                       'Name' => 'serf_incoming_request_t',
                                       'Type' => 'Typedef'
                                     },
                          '11287' => {
                                       'Name' => 'struct serf_incoming_request_t',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '11292' => {
                                       'BaseType' => '11303',
                                       'Header' => 'serf.h',
                                       'Line' => '51',
                                       'Name' => 'serf_request_t',
                                       'Size' => '104',
                                       'Type' => 'Typedef'
                                     },
                          '11303' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '45',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'conn',
                                                            'offset' => '0',
                                                            'type' => '11725'
                                                          },
                                                   '1' => {
                                                            'name' => 'respool',
                                                            'offset' => '8',
                                                            'type' => '4754'
                                                          },
                                                   '10' => {
                                                             'name' => 'resp_bkt',
                                                             'offset' => '80',
                                                             'type' => '1217'
                                                           },
                                                   '11' => {
                                                             'name' => 'written',
                                                             'offset' => '88',
                                                             'type' => '191'
                                                           },
                                                   '12' => {
                                                             'name' => 'next',
                                                             'offset' => '96',
                                                             'type' => '11675'
                                                           },
                                                   '2' => {
                                                            'name' => 'allocator',
                                                            'offset' => '16',
                                                            'type' => '1544'
                                                          },
                                                   '3' => {
                                                            'name' => 'req_bkt',
                                                            'offset' => '24',
                                                            'type' => '1217'
                                                          },
                                                   '4' => {
                                                            'name' => 'setup',
                                                            'offset' => '32',
                                                            'type' => '11972'
                                                          },
                                                   '5' => {
                                                            'name' => 'setup_baton',
                                                            'offset' => '40',
                                                            'type' => '234'
                                                          },
                                                   '6' => {
                                                            'name' => 'acceptor',
                                                            'offset' => '48',
                                                            'type' => '11627'
                                                          },
                                                   '7' => {
                                                            'name' => 'acceptor_baton',
                                                            'offset' => '56',
                                                            'type' => '234'
                                                          },
                                                   '8' => {
                                                            'name' => 'handler',
                                                            'offset' => '64',
                                                            'type' => '11731'
                                                          },
                                                   '9' => {
                                                            'name' => 'handler_baton',
                                                            'offset' => '72',
                                                            'type' => '234'
                                                          }
                                                 },
                                       'Name' => 'struct serf_request_t',
                                       'Size' => '104',
                                       'Type' => 'Struct'
                                     },
                          '11472' => {
                                       'BaseType' => '11483',
                                       'Header' => 'serf.h',
                                       'Line' => '104',
                                       'Name' => 'serf_socket_add_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11483' => {
                                       'Name' => 'apr_status_t(*)(void*, apr_pollfd_t*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '9886'
                                                           },
                                                    '2' => {
                                                             'type' => '234'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11514' => {
                                       'BaseType' => '11483',
                                       'Header' => 'serf.h',
                                       'Line' => '111',
                                       'Name' => 'serf_socket_remove_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11525' => {
                                       'BaseType' => '11536',
                                       'Header' => 'serf.h',
                                       'Line' => '176',
                                       'Name' => 'serf_progress_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11536' => {
                                       'Name' => 'void(*)(void*, apr_off_t, apr_off_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '346'
                                                           },
                                                    '2' => {
                                                             'type' => '346'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11563' => {
                                       'BaseType' => '11574',
                                       'Header' => 'serf.h',
                                       'Line' => '222',
                                       'Name' => 'serf_connection_setup_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11574' => {
                                       'Name' => 'apr_status_t(*)(apr_socket_t*, serf_bucket_t**, serf_bucket_t**, void*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '9759'
                                                           },
                                                    '1' => {
                                                             'type' => '11615'
                                                           },
                                                    '2' => {
                                                             'type' => '11615'
                                                           },
                                                    '3' => {
                                                             'type' => '234'
                                                           },
                                                    '4' => {
                                                             'type' => '4754'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11615' => {
                                       'BaseType' => '1217',
                                       'Name' => 'serf_bucket_t**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11627' => {
                                       'BaseType' => '11639',
                                       'Header' => 'serf.h',
                                       'Line' => '256',
                                       'Name' => 'serf_response_acceptor_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11639' => {
                                       'Name' => 'serf_bucket_t*(*)(serf_request_t*, serf_bucket_t*, void*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11675'
                                                           },
                                                    '1' => {
                                                             'type' => '1217'
                                                           },
                                                    '2' => {
                                                             'type' => '234'
                                                           },
                                                    '3' => {
                                                             'type' => '4754'
                                                           }
                                                  },
                                       'Return' => '1217',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11675' => {
                                       'BaseType' => '11292',
                                       'Name' => 'serf_request_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11681' => {
                                       'BaseType' => '11693',
                                       'Header' => 'serf.h',
                                       'Line' => '273',
                                       'Name' => 'serf_connection_closed_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11693' => {
                                       'Name' => 'void(*)(serf_connection_t*, void*, apr_status_t, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11725'
                                                           },
                                                    '1' => {
                                                             'type' => '234'
                                                           },
                                                    '2' => {
                                                             'type' => '358'
                                                           },
                                                    '3' => {
                                                             'type' => '4754'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11725' => {
                                       'BaseType' => '10556',
                                       'Name' => 'serf_connection_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11731' => {
                                       'BaseType' => '11743',
                                       'Header' => 'serf.h',
                                       'Line' => '306',
                                       'Name' => 'serf_response_handler_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11743' => {
                                       'Name' => 'apr_status_t(*)(serf_request_t*, serf_bucket_t*, void*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11675'
                                                           },
                                                    '1' => {
                                                             'type' => '1217'
                                                           },
                                                    '2' => {
                                                             'type' => '234'
                                                           },
                                                    '3' => {
                                                             'type' => '4754'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11779' => {
                                       'BaseType' => '11791',
                                       'Header' => 'serf.h',
                                       'Line' => '318',
                                       'Name' => 'serf_credentials_callback_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11791' => {
                                       'Name' => 'apr_status_t(*)(char**, char**, serf_request_t*, void*, int, char const*, char const*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11847'
                                                           },
                                                    '1' => {
                                                             'type' => '11847'
                                                           },
                                                    '2' => {
                                                             'type' => '11675'
                                                           },
                                                    '3' => {
                                                             'type' => '234'
                                                           },
                                                    '4' => {
                                                             'type' => '191'
                                                           },
                                                    '5' => {
                                                             'type' => '369'
                                                           },
                                                    '6' => {
                                                             'type' => '369'
                                                           },
                                                    '7' => {
                                                             'type' => '4754'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11847' => {
                                       'BaseType' => '236',
                                       'Name' => 'char**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11853' => {
                                       'BaseType' => '11865',
                                       'Header' => 'serf.h',
                                       'Line' => '389',
                                       'Name' => 'serf_accept_client_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11865' => {
                                       'Name' => 'apr_status_t(*)(serf_context_t*, serf_listener_t*, void*, apr_socket_t*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11906'
                                                           },
                                                    '1' => {
                                                             'type' => '11912'
                                                           },
                                                    '2' => {
                                                             'type' => '234'
                                                           },
                                                    '3' => {
                                                             'type' => '9759'
                                                           },
                                                    '4' => {
                                                             'type' => '4754'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11906' => {
                                       'BaseType' => '10104',
                                       'Name' => 'serf_context_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11912' => {
                                       'BaseType' => '11072',
                                       'Name' => 'serf_listener_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11918' => {
                                       'BaseType' => '11930',
                                       'Header' => 'serf.h',
                                       'Line' => '404',
                                       'Name' => 'serf_incoming_request_cb_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11930' => {
                                       'Name' => 'apr_status_t(*)(serf_context_t*, serf_incoming_request_t*, void*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11906'
                                                           },
                                                    '1' => {
                                                             'type' => '11966'
                                                           },
                                                    '2' => {
                                                             'type' => '234'
                                                           },
                                                    '3' => {
                                                             'type' => '4754'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11966' => {
                                       'BaseType' => '11276',
                                       'Name' => 'serf_incoming_request_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11972' => {
                                       'BaseType' => '11984',
                                       'Header' => 'serf.h',
                                       'Line' => '469',
                                       'Name' => 'serf_request_setup_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11984' => {
                                       'Name' => 'apr_status_t(*)(serf_request_t*, void*, serf_bucket_t**, serf_response_acceptor_t*, void**, serf_response_handler_t*, void**, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11675'
                                                           },
                                                    '1' => {
                                                             'type' => '234'
                                                           },
                                                    '2' => {
                                                             'type' => '11615'
                                                           },
                                                    '3' => {
                                                             'type' => '12040'
                                                           },
                                                    '4' => {
                                                             'type' => '12046'
                                                           },
                                                    '5' => {
                                                             'type' => '12052'
                                                           },
                                                    '6' => {
                                                             'type' => '12046'
                                                           },
                                                    '7' => {
                                                             'type' => '4754'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1201' => {
                                      'BaseType' => '1212',
                                      'Header' => 'serf.h',
                                      'Line' => '44',
                                      'Name' => 'serf_bucket_alloc_t',
                                      'Type' => 'Typedef'
                                    },
                          '12040' => {
                                       'BaseType' => '11627',
                                       'Name' => 'serf_response_acceptor_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12046' => {
                                       'BaseType' => '234',
                                       'Name' => 'void**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12052' => {
                                       'BaseType' => '11731',
                                       'Name' => 'serf_response_handler_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1212' => {
                                      'Line' => '83',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'pool',
                                                           'offset' => '0',
                                                           'type' => '4754'
                                                         },
                                                  '1' => {
                                                           'name' => 'allocator',
                                                           'offset' => '8',
                                                           'type' => '42720'
                                                         },
                                                  '2' => {
                                                           'name' => 'unfreed',
                                                           'offset' => '16',
                                                           'type' => '42475'
                                                         },
                                                  '3' => {
                                                           'name' => 'unfreed_baton',
                                                           'offset' => '24',
                                                           'type' => '234'
                                                         },
                                                  '4' => {
                                                           'name' => 'num_alloc',
                                                           'offset' => '32',
                                                           'type' => '8481'
                                                         },
                                                  '5' => {
                                                           'name' => 'freelist',
                                                           'offset' => '40',
                                                           'type' => '42726'
                                                         },
                                                  '6' => {
                                                           'name' => 'blocks',
                                                           'offset' => '48',
                                                           'type' => '41183'
                                                         },
                                                  '7' => {
                                                           'name' => 'track',
                                                           'offset' => '56',
                                                           'type' => '42732'
                                                         }
                                                },
                                      'Name' => 'struct serf_bucket_alloc_t',
                                      'PrivateABI' => 1,
                                      'Size' => '64',
                                      'Source' => 'allocator.c',
                                      'Type' => 'Struct'
                                    },
                          '1217' => {
                                      'BaseType' => '969',
                                      'Name' => 'serf_bucket_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '12385' => {
                                       'BaseType' => '12396',
                                       'Header' => 'serf_private.h',
                                       'Line' => '33',
                                       'Name' => 'serf__authn_scheme_t',
                                       'Size' => '64',
                                       'Type' => 'Typedef'
                                     },
                          '12396' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '286',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'code',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'name',
                                                            'offset' => '8',
                                                            'type' => '369'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '16',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'init_ctx_func',
                                                            'offset' => '24',
                                                            'type' => '12812'
                                                          },
                                                   '4' => {
                                                            'name' => 'init_conn_func',
                                                            'offset' => '32',
                                                            'type' => '12854'
                                                          },
                                                   '5' => {
                                                            'name' => 'handle_func',
                                                            'offset' => '40',
                                                            'type' => '12750'
                                                          },
                                                   '6' => {
                                                            'name' => 'setup_request_func',
                                                            'offset' => '48',
                                                            'type' => '12896'
                                                          },
                                                   '7' => {
                                                            'name' => 'validate_response_func',
                                                            'offset' => '56',
                                                            'type' => '12949'
                                                          }
                                                 },
                                       'Name' => 'struct serf__authn_scheme_t',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '12514' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '37',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'client',
                                                            'offset' => '0',
                                                            'type' => '12556'
                                                          },
                                                   '1' => {
                                                            'name' => 'conn',
                                                            'offset' => '0',
                                                            'type' => '11725'
                                                          },
                                                   '2' => {
                                                            'name' => 'listener',
                                                            'offset' => '0',
                                                            'type' => '11912'
                                                          }
                                                 },
                                       'Name' => 'anon-union-serf_private.h-37',
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '1253' => {
                                      'BaseType' => '369',
                                      'Name' => 'char const**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '12556' => {
                                       'BaseType' => '11180',
                                       'Name' => 'serf_incoming_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12562' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '35',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'u',
                                                            'offset' => '8',
                                                            'type' => '12514'
                                                          }
                                                 },
                                       'Name' => 'struct serf_io_baton_t',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1259' => {
                                      'BaseType' => '334',
                                      'Name' => 'apr_size_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '12597' => {
                                       'BaseType' => '12562',
                                       'Header' => 'serf_private.h',
                                       'Line' => '42',
                                       'Name' => 'serf_io_baton_t',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '1265' => {
                                      'Name' => 'apr_status_t(*)(serf_bucket_t*, apr_size_t, char const**, apr_size_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1217'
                                                          },
                                                   '1' => {
                                                            'type' => '334'
                                                          },
                                                   '2' => {
                                                            'type' => '1253'
                                                          },
                                                   '3' => {
                                                            'type' => '1259'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '12656' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '77',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'realm',
                                                            'offset' => '0',
                                                            'type' => '369'
                                                          },
                                                   '1' => {
                                                            'name' => 'scheme',
                                                            'offset' => '8',
                                                            'type' => '12705'
                                                          },
                                                   '2' => {
                                                            'name' => 'baton',
                                                            'offset' => '16',
                                                            'type' => '234'
                                                          }
                                                 },
                                       'Name' => 'struct serf__authn_info_t',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '12705' => {
                                       'BaseType' => '12711',
                                       'Name' => 'serf__authn_scheme_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12711' => {
                                       'BaseType' => '12385',
                                       'Name' => 'serf__authn_scheme_t const',
                                       'Size' => '64',
                                       'Type' => 'Const'
                                     },
                          '12716' => {
                                       'BaseType' => '12656',
                                       'Header' => 'serf_private.h',
                                       'Line' => '83',
                                       'Name' => 'serf__authn_info_t',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '12727' => {
                                       'BaseType' => '8601',
                                       'Name' => 'apr_array_header_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12733' => {
                                       'BaseType' => '285',
                                       'Name' => 'struct iovec[1024]',
                                       'Size' => '16384',
                                       'Type' => 'Array'
                                     },
                          '12750' => {
                                       'BaseType' => '12761',
                                       'Header' => 'serf_private.h',
                                       'Line' => '230',
                                       'Name' => 'serf__auth_handler_func_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '12761' => {
                                       'Name' => 'apr_status_t(*)(int, serf_request_t*, serf_bucket_t*, char const*, char const*, void*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '191'
                                                           },
                                                    '1' => {
                                                             'type' => '11675'
                                                           },
                                                    '2' => {
                                                             'type' => '1217'
                                                           },
                                                    '3' => {
                                                             'type' => '369'
                                                           },
                                                    '4' => {
                                                             'type' => '369'
                                                           },
                                                    '5' => {
                                                             'type' => '234'
                                                           },
                                                    '6' => {
                                                             'type' => '4754'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12812' => {
                                       'BaseType' => '12823',
                                       'Header' => 'serf_private.h',
                                       'Line' => '244',
                                       'Name' => 'serf__init_context_func_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '12823' => {
                                       'Name' => 'apr_status_t(*)(int, serf_context_t*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '191'
                                                           },
                                                    '1' => {
                                                             'type' => '11906'
                                                           },
                                                    '2' => {
                                                             'type' => '4754'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12854' => {
                                       'BaseType' => '12865',
                                       'Header' => 'serf_private.h',
                                       'Line' => '254',
                                       'Name' => 'serf__init_conn_func_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '12865' => {
                                       'Name' => 'apr_status_t(*)(int, serf_connection_t*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '191'
                                                           },
                                                    '1' => {
                                                             'type' => '11725'
                                                           },
                                                    '2' => {
                                                             'type' => '4754'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12896' => {
                                       'BaseType' => '12908',
                                       'Header' => 'serf_private.h',
                                       'Line' => '265',
                                       'Name' => 'serf__setup_request_func_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '12908' => {
                                       'Name' => 'apr_status_t(*)(int, serf_connection_t*, char const*, char const*, serf_bucket_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '191'
                                                           },
                                                    '1' => {
                                                             'type' => '11725'
                                                           },
                                                    '2' => {
                                                             'type' => '369'
                                                           },
                                                    '3' => {
                                                             'type' => '369'
                                                           },
                                                    '4' => {
                                                             'type' => '1217'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12949' => {
                                       'BaseType' => '12961',
                                       'Header' => 'serf_private.h',
                                       'Line' => '277',
                                       'Name' => 'serf__validate_response_func_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '12961' => {
                                       'Name' => 'apr_status_t(*)(int, serf_connection_t*, serf_request_t*, serf_bucket_t*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '191'
                                                           },
                                                    '1' => {
                                                             'type' => '11725'
                                                           },
                                                    '2' => {
                                                             'type' => '11675'
                                                           },
                                                    '3' => {
                                                             'type' => '1217'
                                                           },
                                                    '4' => {
                                                             'type' => '4754'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1306' => {
                                      'Name' => 'apr_status_t(*)(serf_bucket_t*, int, int*, char const**, apr_size_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1217'
                                                          },
                                                   '1' => {
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'type' => '328'
                                                          },
                                                   '3' => {
                                                            'type' => '1253'
                                                          },
                                                   '4' => {
                                                            'type' => '1259'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1347' => {
                                      'Name' => 'apr_status_t(*)(serf_bucket_t*, apr_size_t, int, struct iovec*, int*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1217'
                                                          },
                                                   '1' => {
                                                            'type' => '334'
                                                          },
                                                   '2' => {
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'type' => '322'
                                                          },
                                                   '4' => {
                                                            'type' => '328'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1393' => {
                                      'BaseType' => '886',
                                      'Name' => 'apr_hdtr_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1399' => {
                                      'BaseType' => '963',
                                      'Name' => 'apr_file_t**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1405' => {
                                      'BaseType' => '346',
                                      'Name' => 'apr_off_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1411' => {
                                      'Name' => 'apr_status_t(*)(serf_bucket_t*, apr_size_t, apr_hdtr_t*, apr_file_t**, apr_off_t*, apr_size_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1217'
                                                          },
                                                   '1' => {
                                                            'type' => '334'
                                                          },
                                                   '2' => {
                                                            'type' => '1393'
                                                          },
                                                   '3' => {
                                                            'type' => '1399'
                                                          },
                                                   '4' => {
                                                            'type' => '1405'
                                                          },
                                                   '5' => {
                                                            'type' => '1259'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1437' => {
                                      'BaseType' => '1443',
                                      'Name' => 'serf_bucket_type_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1443' => {
                                      'BaseType' => '1033',
                                      'Name' => 'serf_bucket_type_t const',
                                      'Size' => '88',
                                      'Type' => 'Const'
                                    },
                          '1448' => {
                                      'Name' => 'serf_bucket_t*(*)(serf_bucket_t*, serf_bucket_type_t const*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1217'
                                                          },
                                                   '1' => {
                                                            'type' => '1437'
                                                          }
                                                 },
                                      'Return' => '1217',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '14748' => {
                                       'BaseType' => '11525',
                                       'Name' => 'serf_progress_t const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '1479' => {
                                      'Name' => 'apr_status_t(*)(serf_bucket_t*, char const**, apr_size_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1217'
                                                          },
                                                   '1' => {
                                                            'type' => '1253'
                                                          },
                                                   '2' => {
                                                            'type' => '1259'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '149' => {
                                     'Name' => 'unsigned char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '1496' => {
                                      'Name' => 'void(*)(serf_bucket_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1217'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1517' => {
                                      'Name' => 'apr_status_t(*)(serf_bucket_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1217'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1538' => {
                                      'Name' => 'int(*)(serf_bucket_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1217'
                                                          }
                                                 },
                                      'Return' => '191',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1544' => {
                                      'BaseType' => '1201',
                                      'Name' => 'serf_bucket_alloc_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1550' => {
                                      'BaseType' => '1561',
                                      'Header' => 'serf_bucket_types.h',
                                      'Line' => '192',
                                      'Name' => 'serf_bucket_aggregate_eof_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '156' => {
                                     'Name' => 'unsigned short',
                                     'Size' => '2',
                                     'Type' => 'Intrinsic'
                                   },
                          '1561' => {
                                      'Name' => 'apr_status_t(*)(void*, serf_bucket_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '234'
                                                          },
                                                   '1' => {
                                                            'type' => '1217'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1587' => {
                                      'BaseType' => '1598',
                                      'Header' => 'serf_bucket_types.h',
                                      'Line' => '250',
                                      'Name' => 'serf_simple_freefunc_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1598' => {
                                      'Name' => 'void(*)(void*, char const*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '234'
                                                          },
                                                   '1' => {
                                                            'type' => '369'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '163' => {
                                     'Name' => 'unsigned int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '16835' => {
                                       'Header' => 'serf.h',
                                       'Line' => '958',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'SERF_LINEBUF_EMPTY',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'SERF_LINEBUF_READY',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'SERF_LINEBUF_PARTIAL',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'SERF_LINEBUF_CRLF_SPLIT',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'anon-enum-serf.h-958',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '16919' => {
                                       'BaseType' => '242',
                                       'Name' => 'char[8000]',
                                       'Size' => '8000',
                                       'Type' => 'Array'
                                     },
                          '16936' => {
                                       'Header' => 'serf.h',
                                       'Line' => '971',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state',
                                                            'offset' => '0',
                                                            'type' => '16835'
                                                          },
                                                   '1' => {
                                                            'name' => 'used',
                                                            'offset' => '8',
                                                            'type' => '334'
                                                          },
                                                   '2' => {
                                                            'name' => 'line',
                                                            'offset' => '16',
                                                            'type' => '16919'
                                                          }
                                                 },
                                       'Name' => 'struct serf_linebuf_t',
                                       'Size' => '8016',
                                       'Type' => 'Struct'
                                     },
                          '16955' => {
                                       'BaseType' => '16966',
                                       'Header' => 'serf_bucket_util.h',
                                       'Line' => '210',
                                       'Name' => 'serf_databuf_reader_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '16966' => {
                                       'Name' => 'apr_status_t(*)(void*, apr_size_t, char*, apr_size_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '334'
                                                           },
                                                    '2' => {
                                                             'type' => '236'
                                                           },
                                                    '3' => {
                                                             'type' => '1259'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '170' => {
                                     'Name' => 'unsigned long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '17084' => {
                                       'Header' => 'serf_bucket_util.h',
                                       'Line' => '242',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'current',
                                                            'offset' => '0',
                                                            'type' => '369'
                                                          },
                                                   '1' => {
                                                            'name' => 'remaining',
                                                            'offset' => '8',
                                                            'type' => '334'
                                                          },
                                                   '2' => {
                                                            'name' => 'read',
                                                            'offset' => '16',
                                                            'type' => '16955'
                                                          },
                                                   '3' => {
                                                            'name' => 'read_baton',
                                                            'offset' => '24',
                                                            'type' => '234'
                                                          },
                                                   '4' => {
                                                            'name' => 'status',
                                                            'offset' => '32',
                                                            'type' => '358'
                                                          },
                                                   '5' => {
                                                            'name' => 'buf',
                                                            'offset' => '36',
                                                            'type' => '16919'
                                                          }
                                                 },
                                       'Name' => 'struct serf_databuf_t',
                                       'Size' => '8040',
                                       'Type' => 'Struct'
                                     },
                          '17222' => {
                                       'BaseType' => '17084',
                                       'Name' => 'serf_databuf_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '184' => {
                                     'Name' => 'short',
                                     'Size' => '2',
                                     'Type' => 'Intrinsic'
                                   },
                          '191' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '19505' => {
                                       'BaseType' => '16936',
                                       'Name' => 'serf_linebuf_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '198' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '205' => {
                                     'BaseType' => '198',
                                     'Header' => 'types.h',
                                     'Line' => '131',
                                     'Name' => '__off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '234' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '236' => {
                                     'BaseType' => '242',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '242' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '24824' => {
                                       'BaseType' => '24835',
                                       'Header' => 'apr_mmap.h',
                                       'Line' => '51',
                                       'Name' => 'apr_mmap_t',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '24835' => {
                                       'Header' => 'apr_mmap.h',
                                       'Line' => '62',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cntxt',
                                                            'offset' => '0',
                                                            'type' => '4754'
                                                          },
                                                   '1' => {
                                                            'name' => 'mm',
                                                            'offset' => '8',
                                                            'type' => '234'
                                                          },
                                                   '2' => {
                                                            'name' => 'size',
                                                            'offset' => '16',
                                                            'type' => '334'
                                                          },
                                                   '3' => {
                                                            'name' => 'link',
                                                            'offset' => '24',
                                                            'type' => '24895'
                                                          }
                                                 },
                                       'Name' => 'struct apr_mmap_t',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '24895' => {
                                       'Header' => 'apr_mmap.h',
                                       'Line' => '85',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '24928'
                                                          },
                                                   '1' => {
                                                            'name' => 'prev',
                                                            'offset' => '8',
                                                            'type' => '24928'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-apr_mmap.h-85',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '249' => {
                                     'BaseType' => '205',
                                     'Header' => 'types.h',
                                     'Line' => '86',
                                     'Name' => 'off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '24928' => {
                                       'BaseType' => '26125',
                                       'Name' => 'struct apr_mmap_t*volatile',
                                       'Size' => '8',
                                       'Type' => 'Volatile'
                                     },
                          '260' => {
                                     'BaseType' => '170',
                                     'Header' => 'stddef.h',
                                     'Line' => '212',
                                     'Name' => 'size_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '26125' => {
                                       'BaseType' => '24824',
                                       'Name' => 'apr_mmap_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '285' => {
                                     'Header' => 'uio.h',
                                     'Line' => '43',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'iov_base',
                                                          'offset' => '0',
                                                          'type' => '234'
                                                        },
                                                 '1' => {
                                                          'name' => 'iov_len',
                                                          'offset' => '8',
                                                          'type' => '260'
                                                        }
                                               },
                                     'Name' => 'struct iovec',
                                     'PrivateABI' => 1,
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '322' => {
                                     'BaseType' => '285',
                                     'Name' => 'struct iovec*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '328' => {
                                     'BaseType' => '191',
                                     'Name' => 'int*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '334' => {
                                     'BaseType' => '260',
                                     'Header' => 'apr.h',
                                     'Line' => '356',
                                     'Name' => 'apr_size_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '33558' => {
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '87',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'version',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'code',
                                                            'offset' => '4',
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'name' => 'reason',
                                                            'offset' => '8',
                                                            'type' => '369'
                                                          }
                                                 },
                                       'Name' => 'struct serf_status_line',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '346' => {
                                     'BaseType' => '249',
                                     'Header' => 'apr.h',
                                     'Line' => '358',
                                     'Name' => 'apr_off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '358' => {
                                     'BaseType' => '191',
                                     'Header' => 'apr_errno.h',
                                     'Line' => '44',
                                     'Name' => 'apr_status_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '35937' => {
                                       'BaseType' => '33558',
                                       'Name' => 'serf_status_line*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '36809' => {
                                       'Name' => 'int()(void*, char const*, char const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '369'
                                                           },
                                                    '2' => {
                                                             'type' => '369'
                                                           }
                                                  },
                                       'Return' => '191',
                                       'Type' => 'Func'
                                     },
                          '369' => {
                                     'BaseType' => '375',
                                     'Name' => 'char const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '375' => {
                                     'BaseType' => '242',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '380' => {
                                     'Name' => 'struct apr_file_t',
                                     'PrivateABI' => 1,
                                     'Type' => 'Struct'
                                   },
                          '38004' => {
                                       'BaseType' => '36809',
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '362',
                                       'Name' => 'serf_bucket_headers_do_callback_fn_t',
                                       'Type' => 'Typedef'
                                     },
                          '40530' => {
                                       'BaseType' => '38004',
                                       'Name' => 'serf_bucket_headers_do_callback_fn_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '41071' => {
                                       'BaseType' => '41082',
                                       'Header' => 'apr_allocator.h',
                                       'Line' => '41',
                                       'Name' => 'apr_allocator_t',
                                       'Type' => 'Typedef'
                                     },
                          '41082' => {
                                       'Name' => 'struct apr_allocator_t',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '41087' => {
                                       'BaseType' => '41098',
                                       'Header' => 'apr_allocator.h',
                                       'Line' => '43',
                                       'Name' => 'apr_memnode_t',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '41098' => {
                                       'Header' => 'apr_allocator.h',
                                       'Line' => '54',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '41183'
                                                          },
                                                   '1' => {
                                                            'name' => 'ref',
                                                            'offset' => '8',
                                                            'type' => '41189'
                                                          },
                                                   '2' => {
                                                            'name' => 'index',
                                                            'offset' => '16',
                                                            'type' => '8481'
                                                          },
                                                   '3' => {
                                                            'name' => 'free_index',
                                                            'offset' => '20',
                                                            'type' => '8481'
                                                          },
                                                   '4' => {
                                                            'name' => 'first_avail',
                                                            'offset' => '24',
                                                            'type' => '236'
                                                          },
                                                   '5' => {
                                                            'name' => 'endp',
                                                            'offset' => '32',
                                                            'type' => '236'
                                                          }
                                                 },
                                       'Name' => 'struct apr_memnode_t',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '41183' => {
                                       'BaseType' => '41087',
                                       'Name' => 'apr_memnode_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '41189' => {
                                       'BaseType' => '41183',
                                       'Name' => 'apr_memnode_t**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '42475' => {
                                       'BaseType' => '42487',
                                       'Header' => 'serf.h',
                                       'Line' => '905',
                                       'Name' => 'serf_unfreed_func_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '42487' => {
                                       'Name' => 'void(*)(void*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '234'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '42509' => {
                                       'Line' => '26',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '42726'
                                                          },
                                                   '1' => {
                                                            'name' => 'memnode',
                                                            'offset' => '0',
                                                            'type' => '41183'
                                                          }
                                                 },
                                       'Name' => 'anon-union-allocator.c-26',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Source' => 'allocator.c',
                                       'Type' => 'Union'
                                     },
                          '42540' => {
                                       'Line' => '24',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'size',
                                                            'offset' => '0',
                                                            'type' => '334'
                                                          },
                                                   '1' => {
                                                            'name' => 'u',
                                                            'offset' => '8',
                                                            'type' => '42509'
                                                          }
                                                 },
                                       'Name' => 'struct node_header_t',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Source' => 'allocator.c',
                                       'Type' => 'Struct'
                                     },
                          '42581' => {
                                       'BaseType' => '42540',
                                       'Line' => '31',
                                       'Name' => 'node_header_t',
                                       'Size' => '16',
                                       'Source' => 'allocator.c',
                                       'Type' => 'Typedef'
                                     },
                          '42625' => {
                                       'BaseType' => '42631',
                                       'Name' => 'serf_bucket_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '42631' => {
                                       'BaseType' => '969',
                                       'Name' => 'serf_bucket_t const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '42636' => {
                                       'Line' => '71',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'bucket',
                                                            'offset' => '0',
                                                            'type' => '42625'
                                                          },
                                                   '1' => {
                                                            'name' => 'last',
                                                            'offset' => '8',
                                                            'type' => '358'
                                                          }
                                                 },
                                       'Name' => 'struct read_status_t',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Source' => 'allocator.c',
                                       'Type' => 'Struct'
                                     },
                          '42693' => {
                                       'BaseType' => '42636',
                                       'Name' => 'read_status_t[100]',
                                       'Size' => '1600',
                                       'Type' => 'Array'
                                     },
                          '42709' => {
                                       'Line' => '80',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next_index',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'num_used',
                                                            'offset' => '4',
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'name' => 'info',
                                                            'offset' => '8',
                                                            'type' => '42693'
                                                          }
                                                 },
                                       'Name' => 'struct track_state_t',
                                       'PrivateABI' => 1,
                                       'Size' => '1608',
                                       'Source' => 'allocator.c',
                                       'Type' => 'Struct'
                                     },
                          '42720' => {
                                       'BaseType' => '41071',
                                       'Name' => 'apr_allocator_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '42726' => {
                                       'BaseType' => '42581',
                                       'Name' => 'node_header_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '42732' => {
                                       'BaseType' => '42709',
                                       'Name' => 'track_state_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '4738' => {
                                      'BaseType' => '4749',
                                      'Header' => 'apr_pools.h',
                                      'Line' => '60',
                                      'Name' => 'apr_pool_t',
                                      'Type' => 'Typedef'
                                    },
                          '4749' => {
                                      'Name' => 'struct apr_pool_t',
                                      'PrivateABI' => 1,
                                      'Type' => 'Struct'
                                    },
                          '4754' => {
                                      'BaseType' => '4738',
                                      'Name' => 'apr_pool_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7634' => {
                                      'BaseType' => '7640',
                                      'Name' => 'serf_bucket_alloc_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7640' => {
                                      'BaseType' => '1201',
                                      'Name' => 'serf_bucket_alloc_t const',
                                      'Type' => 'Const'
                                    },
                          '8092' => {
                                      'BaseType' => '163',
                                      'Header' => 'types.h',
                                      'Line' => '189',
                                      'Name' => '__socklen_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '8176' => {
                                      'BaseType' => '8092',
                                      'Header' => 'socket.h',
                                      'Line' => '33',
                                      'Name' => 'socklen_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '8187' => {
                                      'BaseType' => '156',
                                      'Header' => 'sockaddr.h',
                                      'Line' => '28',
                                      'Name' => 'sa_family_t',
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '8198' => {
                                      'Header' => 'socket.h',
                                      'Line' => '166',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ss_family',
                                                           'offset' => '0',
                                                           'type' => '8187'
                                                         },
                                                  '1' => {
                                                           'name' => '__ss_align',
                                                           'offset' => '8',
                                                           'type' => '170'
                                                         },
                                                  '2' => {
                                                           'name' => '__ss_padding',
                                                           'offset' => '16',
                                                           'type' => '8247'
                                                         }
                                                },
                                      'Name' => 'struct sockaddr_storage',
                                      'PrivateABI' => 1,
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '8247' => {
                                      'BaseType' => '242',
                                      'Name' => 'char[112]',
                                      'Size' => '112',
                                      'Type' => 'Array'
                                    },
                          '8269' => {
                                      'Header' => 'in.h',
                                      'Line' => '237',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sin_family',
                                                           'offset' => '0',
                                                           'type' => '8187'
                                                         },
                                                  '1' => {
                                                           'name' => 'sin_port',
                                                           'offset' => '2',
                                                           'type' => '9233'
                                                         },
                                                  '2' => {
                                                           'name' => 'sin_addr',
                                                           'offset' => '4',
                                                           'type' => '9208'
                                                         },
                                                  '3' => {
                                                           'name' => 'sin_zero',
                                                           'offset' => '8',
                                                           'type' => '9359'
                                                         }
                                                },
                                      'Name' => 'struct sockaddr_in',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '8330' => {
                                      'Header' => 'in.h',
                                      'Line' => '252',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sin6_family',
                                                           'offset' => '0',
                                                           'type' => '8187'
                                                         },
                                                  '1' => {
                                                           'name' => 'sin6_port',
                                                           'offset' => '2',
                                                           'type' => '9233'
                                                         },
                                                  '2' => {
                                                           'name' => 'sin6_flowinfo',
                                                           'offset' => '4',
                                                           'type' => '8428'
                                                         },
                                                  '3' => {
                                                           'name' => 'sin6_addr',
                                                           'offset' => '8',
                                                           'type' => '9334'
                                                         },
                                                  '4' => {
                                                           'name' => 'sin6_scope_id',
                                                           'offset' => '24',
                                                           'type' => '8428'
                                                         }
                                                },
                                      'Name' => 'struct sockaddr_in6',
                                      'PrivateABI' => 1,
                                      'Size' => '28',
                                      'Type' => 'Struct'
                                    },
                          '8406' => {
                                      'BaseType' => '149',
                                      'Header' => 'stdint.h',
                                      'Line' => '48',
                                      'Name' => 'uint8_t',
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '8417' => {
                                      'BaseType' => '156',
                                      'Header' => 'stdint.h',
                                      'Line' => '49',
                                      'Name' => 'uint16_t',
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '8428' => {
                                      'BaseType' => '163',
                                      'Header' => 'stdint.h',
                                      'Line' => '51',
                                      'Name' => 'uint32_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '8445' => {
                                      'BaseType' => '184',
                                      'Header' => 'apr.h',
                                      'Line' => '311',
                                      'Name' => 'apr_int16_t',
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '8457' => {
                                      'BaseType' => '156',
                                      'Header' => 'apr.h',
                                      'Line' => '312',
                                      'Name' => 'apr_uint16_t',
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '8469' => {
                                      'BaseType' => '191',
                                      'Header' => 'apr.h',
                                      'Line' => '314',
                                      'Name' => 'apr_int32_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '8481' => {
                                      'BaseType' => '163',
                                      'Header' => 'apr.h',
                                      'Line' => '315',
                                      'Name' => 'apr_uint32_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '8529' => {
                                      'BaseType' => '8176',
                                      'Header' => 'apr.h',
                                      'Line' => '359',
                                      'Name' => 'apr_socklen_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '8601' => {
                                      'BaseType' => '8612',
                                      'Header' => 'apr_tables.h',
                                      'Line' => '59',
                                      'Name' => 'apr_array_header_t',
                                      'Size' => '32',
                                      'Type' => 'Typedef'
                                    },
                          '8612' => {
                                      'Header' => 'apr_tables.h',
                                      'Line' => '62',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'pool',
                                                           'offset' => '0',
                                                           'type' => '4754'
                                                         },
                                                  '1' => {
                                                           'name' => 'elt_size',
                                                           'offset' => '8',
                                                           'type' => '191'
                                                         },
                                                  '2' => {
                                                           'name' => 'nelts',
                                                           'offset' => '12',
                                                           'type' => '191'
                                                         },
                                                  '3' => {
                                                           'name' => 'nalloc',
                                                           'offset' => '16',
                                                           'type' => '191'
                                                         },
                                                  '4' => {
                                                           'name' => 'elts',
                                                           'offset' => '24',
                                                           'type' => '236'
                                                         }
                                                },
                                      'Name' => 'struct apr_array_header_t',
                                      'PrivateABI' => 1,
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '875' => {
                                     'BaseType' => '380',
                                     'Header' => 'apr_file_io.h',
                                     'Line' => '188',
                                     'Name' => 'apr_file_t',
                                     'Type' => 'Typedef'
                                   },
                          '886' => {
                                     'BaseType' => '897',
                                     'Header' => 'apr_network_io.h',
                                     'Line' => '197',
                                     'Name' => 'apr_hdtr_t',
                                     'Size' => '32',
                                     'Type' => 'Typedef'
                                   },
                          '897' => {
                                     'Header' => 'apr_network_io.h',
                                     'Line' => '263',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'headers',
                                                          'offset' => '0',
                                                          'type' => '322'
                                                        },
                                                 '1' => {
                                                          'name' => 'numheaders',
                                                          'offset' => '8',
                                                          'type' => '191'
                                                        },
                                                 '2' => {
                                                          'name' => 'trailers',
                                                          'offset' => '16',
                                                          'type' => '322'
                                                        },
                                                 '3' => {
                                                          'name' => 'numtrailers',
                                                          'offset' => '24',
                                                          'type' => '191'
                                                        }
                                               },
                                     'Name' => 'struct apr_hdtr_t',
                                     'PrivateABI' => 1,
                                     'Size' => '32',
                                     'Type' => 'Struct'
                                   },
                          '9197' => {
                                      'BaseType' => '8428',
                                      'Header' => 'in.h',
                                      'Line' => '30',
                                      'Name' => 'in_addr_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '9208' => {
                                      'Header' => 'in.h',
                                      'Line' => '31',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 's_addr',
                                                           'offset' => '0',
                                                           'type' => '9197'
                                                         }
                                                },
                                      'Name' => 'struct in_addr',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '9233' => {
                                      'BaseType' => '8417',
                                      'Header' => 'in.h',
                                      'Line' => '117',
                                      'Name' => 'in_port_t',
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '9244' => {
                                      'Header' => 'in.h',
                                      'Line' => '211',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '__u6_addr8',
                                                           'offset' => '0',
                                                           'type' => '9286'
                                                         },
                                                  '1' => {
                                                           'name' => '__u6_addr16',
                                                           'offset' => '0',
                                                           'type' => '9302'
                                                         },
                                                  '2' => {
                                                           'name' => '__u6_addr32',
                                                           'offset' => '0',
                                                           'type' => '9318'
                                                         }
                                                },
                                      'Name' => 'anon-union-in.h-211',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Union'
                                    },
                          '9286' => {
                                      'BaseType' => '8406',
                                      'Name' => 'uint8_t[16]',
                                      'Size' => '16',
                                      'Type' => 'Array'
                                    },
                          '9302' => {
                                      'BaseType' => '8417',
                                      'Name' => 'uint16_t[8]',
                                      'Size' => '16',
                                      'Type' => 'Array'
                                    },
                          '9318' => {
                                      'BaseType' => '8428',
                                      'Name' => 'uint32_t[4]',
                                      'Size' => '16',
                                      'Type' => 'Array'
                                    },
                          '9334' => {
                                      'Header' => 'in.h',
                                      'Line' => '209',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '__in6_u',
                                                           'offset' => '0',
                                                           'type' => '9244'
                                                         }
                                                },
                                      'Name' => 'struct in6_addr',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '9359' => {
                                      'BaseType' => '149',
                                      'Name' => 'unsigned char[8]',
                                      'Size' => '8',
                                      'Type' => 'Array'
                                    },
                          '9375' => {
                                      'BaseType' => '9386',
                                      'Header' => 'apr_network_io.h',
                                      'Line' => '193',
                                      'Name' => 'apr_socket_t',
                                      'Type' => 'Typedef'
                                    },
                          '9386' => {
                                      'Name' => 'struct apr_socket_t',
                                      'PrivateABI' => 1,
                                      'Type' => 'Struct'
                                    },
                          '9468' => {
                                      'BaseType' => '8457',
                                      'Header' => 'apr_network_io.h',
                                      'Line' => '204',
                                      'Name' => 'apr_port_t',
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '9479' => {
                                      'BaseType' => '9490',
                                      'Header' => 'apr_network_io.h',
                                      'Line' => '209',
                                      'Name' => 'apr_sockaddr_t',
                                      'Size' => '192',
                                      'Type' => 'Typedef'
                                    },
                          '9490' => {
                                      'Header' => 'apr_network_io.h',
                                      'Line' => '213',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'pool',
                                                           'offset' => '0',
                                                           'type' => '4754'
                                                         },
                                                  '1' => {
                                                           'name' => 'hostname',
                                                           'offset' => '8',
                                                           'type' => '236'
                                                         },
                                                  '10' => {
                                                            'name' => 'sa',
                                                            'offset' => '64',
                                                            'type' => '9634'
                                                          },
                                                  '2' => {
                                                           'name' => 'servname',
                                                           'offset' => '16',
                                                           'type' => '236'
                                                         },
                                                  '3' => {
                                                           'name' => 'port',
                                                           'offset' => '24',
                                                           'type' => '9468'
                                                         },
                                                  '4' => {
                                                           'name' => 'family',
                                                           'offset' => '28',
                                                           'type' => '8469'
                                                         },
                                                  '5' => {
                                                           'name' => 'salen',
                                                           'offset' => '32',
                                                           'type' => '8529'
                                                         },
                                                  '6' => {
                                                           'name' => 'ipaddr_len',
                                                           'offset' => '36',
                                                           'type' => '191'
                                                         },
                                                  '7' => {
                                                           'name' => 'addr_str_len',
                                                           'offset' => '40',
                                                           'type' => '191'
                                                         },
                                                  '8' => {
                                                           'name' => 'ipaddr_ptr',
                                                           'offset' => '48',
                                                           'type' => '234'
                                                         },
                                                  '9' => {
                                                           'name' => 'next',
                                                           'offset' => '56',
                                                           'type' => '9676'
                                                         }
                                                },
                                      'Name' => 'struct apr_sockaddr_t',
                                      'PrivateABI' => 1,
                                      'Size' => '192',
                                      'Type' => 'Struct'
                                    },
                          '963' => {
                                     'BaseType' => '875',
                                     'Name' => 'apr_file_t*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '9634' => {
                                      'Header' => 'apr_network_io.h',
                                      'Line' => '238',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sin',
                                                           'offset' => '0',
                                                           'type' => '8269'
                                                         },
                                                  '1' => {
                                                           'name' => 'sin6',
                                                           'offset' => '0',
                                                           'type' => '8330'
                                                         },
                                                  '2' => {
                                                           'name' => 'sas',
                                                           'offset' => '0',
                                                           'type' => '8198'
                                                         }
                                                },
                                      'Name' => 'anon-union-apr_network_io.h-238',
                                      'PrivateABI' => 1,
                                      'Size' => '128',
                                      'Type' => 'Union'
                                    },
                          '9676' => {
                                      'BaseType' => '9479',
                                      'Name' => 'apr_sockaddr_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '969' => {
                                     'BaseType' => '980',
                                     'Header' => 'serf.h',
                                     'Line' => '42',
                                     'Name' => 'serf_bucket_t',
                                     'Size' => '24',
                                     'Type' => 'Typedef'
                                   },
                          '9715' => {
                                      'Header' => 'apr_poll.h',
                                      'Line' => '96',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'APR_NO_DESC',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'APR_POLL_SOCKET',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'APR_POLL_FILE',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'APR_POLL_LASTDESC',
                                                           'value' => '3'
                                                         }
                                                },
                                      'Name' => 'enum apr_datatype_e',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '9759' => {
                                      'BaseType' => '9375',
                                      'Name' => 'apr_socket_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9765' => {
                                      'Header' => 'apr_poll.h',
                                      'Line' => '102',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'f',
                                                           'offset' => '0',
                                                           'type' => '963'
                                                         },
                                                  '1' => {
                                                           'name' => 's',
                                                           'offset' => '0',
                                                           'type' => '9759'
                                                         }
                                                },
                                      'Name' => 'union apr_descriptor',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Union'
                                    },
                          '9776' => {
                                      'BaseType' => '9787',
                                      'Header' => 'apr_poll.h',
                                      'Line' => '105',
                                      'Name' => 'apr_pollfd_t',
                                      'Size' => '32',
                                      'Type' => 'Typedef'
                                    },
                          '9787' => {
                                      'Header' => 'apr_poll.h',
                                      'Line' => '108',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'p',
                                                           'offset' => '0',
                                                           'type' => '4754'
                                                         },
                                                  '1' => {
                                                           'name' => 'desc_type',
                                                           'offset' => '8',
                                                           'type' => '9715'
                                                         },
                                                  '2' => {
                                                           'name' => 'reqevents',
                                                           'offset' => '12',
                                                           'type' => '8445'
                                                         },
                                                  '3' => {
                                                           'name' => 'rtnevents',
                                                           'offset' => '14',
                                                           'type' => '8445'
                                                         },
                                                  '4' => {
                                                           'name' => 'desc',
                                                           'offset' => '16',
                                                           'type' => '9765'
                                                         },
                                                  '5' => {
                                                           'name' => 'client_data',
                                                           'offset' => '24',
                                                           'type' => '234'
                                                         }
                                                },
                                      'Name' => 'struct apr_pollfd_t',
                                      'PrivateABI' => 1,
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '980' => {
                                     'Header' => 'serf.h',
                                     'Line' => '879',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'type',
                                                          'offset' => '0',
                                                          'type' => '1437'
                                                        },
                                                 '1' => {
                                                          'name' => 'data',
                                                          'offset' => '8',
                                                          'type' => '234'
                                                        },
                                                 '2' => {
                                                          'name' => 'allocator',
                                                          'offset' => '16',
                                                          'type' => '1544'
                                                        }
                                               },
                                     'Name' => 'struct serf_bucket_t',
                                     'Size' => '24',
                                     'Type' => 'Struct'
                                   },
                          '9886' => {
                                      'BaseType' => '9776',
                                      'Name' => 'apr_pollfd_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9892' => {
                                      'BaseType' => '9903',
                                      'Header' => 'apr_uri.h',
                                      'Line' => '80',
                                      'Name' => 'apr_uri_t',
                                      'Size' => '88',
                                      'Type' => 'Typedef'
                                    },
                          '9903' => {
                                      'Header' => 'apr_uri.h',
                                      'Line' => '85',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'scheme',
                                                           'offset' => '0',
                                                           'type' => '236'
                                                         },
                                                  '1' => {
                                                           'name' => 'hostinfo',
                                                           'offset' => '8',
                                                           'type' => '236'
                                                         },
                                                  '10' => {
                                                            'name' => 'port',
                                                            'offset' => '80',
                                                            'type' => '9468'
                                                          },
                                                  '11' => {
                                                            'bitfield' => '1',
                                                            'name' => 'is_initialized',
                                                            'offset' => '80',
                                                            'type' => '163'
                                                          },
                                                  '12' => {
                                                            'bitfield' => '1',
                                                            'name' => 'dns_looked_up',
                                                            'offset' => '80',
                                                            'type' => '163'
                                                          },
                                                  '13' => {
                                                            'bitfield' => '1',
                                                            'name' => 'dns_resolved',
                                                            'offset' => '80',
                                                            'type' => '163'
                                                          },
                                                  '2' => {
                                                           'name' => 'user',
                                                           'offset' => '16',
                                                           'type' => '236'
                                                         },
                                                  '3' => {
                                                           'name' => 'password',
                                                           'offset' => '24',
                                                           'type' => '236'
                                                         },
                                                  '4' => {
                                                           'name' => 'hostname',
                                                           'offset' => '32',
                                                           'type' => '236'
                                                         },
                                                  '5' => {
                                                           'name' => 'port_str',
                                                           'offset' => '40',
                                                           'type' => '236'
                                                         },
                                                  '6' => {
                                                           'name' => 'path',
                                                           'offset' => '48',
                                                           'type' => '236'
                                                         },
                                                  '7' => {
                                                           'name' => 'query',
                                                           'offset' => '56',
                                                           'type' => '236'
                                                         },
                                                  '8' => {
                                                           'name' => 'fragment',
                                                           'offset' => '64',
                                                           'type' => '236'
                                                         },
                                                  '9' => {
                                                           'name' => 'hostent',
                                                           'offset' => '72',
                                                           'type' => '10098'
                                                         }
                                                },
                                      'Name' => 'struct apr_uri_t',
                                      'PrivateABI' => 1,
                                      'Size' => '88',
                                      'Type' => 'Struct'
                                    }
                        },
          'UndefinedSymbols' => {
                                  'libserf-0.so.0.0.0' => {
                                                            'ASN1_TIME_print' => 0,
                                                            'BIO_clear_flags' => 0,
                                                            'BIO_free' => 0,
                                                            'BIO_new' => 0,
                                                            'BIO_read' => 0,
                                                            'BIO_s_mem' => 0,
                                                            'BIO_set_flags' => 0,
                                                            'BIO_test_flags' => 0,
                                                            'CRYPTO_num_locks' => 0,
                                                            'CRYPTO_set_dynlock_create_callback' => 0,
                                                            'CRYPTO_set_dynlock_destroy_callback' => 0,
                                                            'CRYPTO_set_dynlock_lock_callback' => 0,
                                                            'CRYPTO_set_id_callback' => 0,
                                                            'CRYPTO_set_locking_callback' => 0,
                                                            'CRYPTO_set_mem_functions' => 0,
                                                            'ERR_clear_error' => 0,
                                                            'ERR_get_error' => 0,
                                                            'ERR_load_crypto_strings' => 0,
                                                            'EVP_sha1' => 0,
                                                            'OPENSSL_add_all_algorithms_noconf' => 0,
                                                            'PEM_read_X509' => 0,
                                                            'PKCS12_free' => 0,
                                                            'PKCS12_parse' => 0,
                                                            'SSL_CTX_ctrl' => 0,
                                                            'SSL_CTX_free' => 0,
                                                            'SSL_CTX_get_cert_store' => 0,
                                                            'SSL_CTX_new' => 0,
                                                            'SSL_CTX_set_client_cert_cb' => 0,
                                                            'SSL_CTX_set_verify' => 0,
                                                            'SSL_free' => 0,
                                                            'SSL_get_error' => 0,
                                                            'SSL_get_ex_data' => 0,
                                                            'SSL_get_ex_data_X509_STORE_CTX_idx' => 0,
                                                            'SSL_library_init' => 0,
                                                            'SSL_load_error_strings' => 0,
                                                            'SSL_new' => 0,
                                                            'SSL_read' => 0,
                                                            'SSL_set_bio' => 0,
                                                            'SSL_set_connect_state' => 0,
                                                            'SSL_set_ex_data' => 0,
                                                            'SSL_write' => 0,
                                                            'SSLv23_client_method' => 0,
                                                            'X509_NAME_get_text_by_NID' => 0,
                                                            'X509_STORE_CTX_get_current_cert' => 0,
                                                            'X509_STORE_CTX_get_error' => 0,
                                                            'X509_STORE_CTX_get_error_depth' => 0,
                                                            'X509_STORE_CTX_get_ex_data' => 0,
                                                            'X509_STORE_add_cert' => 0,
                                                            'X509_STORE_set_default_paths' => 0,
                                                            'X509_cmp_current_time' => 0,
                                                            'X509_digest' => 0,
                                                            'X509_get_issuer_name' => 0,
                                                            'X509_get_subject_name' => 0,
                                                            '_ITM_deregisterTMCloneTable' => 0,
                                                            '_ITM_registerTMCloneTable' => 0,
                                                            '_Jv_RegisterClasses' => 0,
                                                            '__ctype_b_loc@GLIBC_2.3' => 0,
                                                            '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                            '__errno_location@GLIBC_2.2.5' => 0,
                                                            '__gmon_start__' => 0,
                                                            'abort@GLIBC_2.2.5' => 0,
                                                            'apr_allocator_alloc' => 0,
                                                            'apr_allocator_create' => 0,
                                                            'apr_allocator_free' => 0,
                                                            'apr_array_make' => 0,
                                                            'apr_array_push' => 0,
                                                            'apr_atomic_xchg32' => 0,
                                                            'apr_base64_encode' => 0,
                                                            'apr_base64_encode_len' => 0,
                                                            'apr_cpystrn' => 0,
                                                            'apr_date_checkmask' => 0,
                                                            'apr_file_close' => 0,
                                                            'apr_file_name_get' => 0,
                                                            'apr_file_open' => 0,
                                                            'apr_file_read' => 0,
                                                            'apr_file_write' => 0,
                                                            'apr_hash_make' => 0,
                                                            'apr_hash_set' => 0,
                                                            'apr_md5' => 0,
                                                            'apr_mmap_create' => 0,
                                                            'apr_mmap_offset' => 0,
                                                            'apr_os_thread_current' => 0,
                                                            'apr_palloc' => 0,
                                                            'apr_pollset_add' => 0,
                                                            'apr_pollset_create' => 0,
                                                            'apr_pollset_poll' => 0,
                                                            'apr_pollset_remove' => 0,
                                                            'apr_pool_allocator_get' => 0,
                                                            'apr_pool_cleanup_null' => 0,
                                                            'apr_pool_cleanup_register' => 0,
                                                            'apr_pool_clear' => 0,
                                                            'apr_pool_create_ex' => 0,
                                                            'apr_pool_destroy' => 0,
                                                            'apr_pool_userdata_get' => 0,
                                                            'apr_pool_userdata_setn' => 0,
                                                            'apr_psprintf' => 0,
                                                            'apr_pstrcat' => 0,
                                                            'apr_pstrcatv' => 0,
                                                            'apr_pstrdup' => 0,
                                                            'apr_pstrmemdup' => 0,
                                                            'apr_snprintf' => 0,
                                                            'apr_sockaddr_info_get' => 0,
                                                            'apr_socket_accept' => 0,
                                                            'apr_socket_bind' => 0,
                                                            'apr_socket_close' => 0,
                                                            'apr_socket_connect' => 0,
                                                            'apr_socket_create' => 0,
                                                            'apr_socket_listen' => 0,
                                                            'apr_socket_opt_set' => 0,
                                                            'apr_socket_recv' => 0,
                                                            'apr_socket_sendv' => 0,
                                                            'apr_socket_timeout_set' => 0,
                                                            'apr_stat' => 0,
                                                            'apr_strtoi64' => 0,
                                                            'apr_strtok' => 0,
                                                            'apr_thread_mutex_create' => 0,
                                                            'apr_thread_mutex_destroy' => 0,
                                                            'apr_thread_mutex_lock' => 0,
                                                            'apr_thread_mutex_unlock' => 0,
                                                            'apr_uri_parse' => 0,
                                                            'apr_uri_unparse' => 0,
                                                            'apr_uuid_format' => 0,
                                                            'apr_uuid_get' => 0,
                                                            'crc32' => 0,
                                                            'd2i_PKCS12_bio' => 0,
                                                            'fclose@GLIBC_2.2.5' => 0,
                                                            'fopen@GLIBC_2.2.5' => 0,
                                                            'free@GLIBC_2.2.5' => 0,
                                                            'i2d_X509' => 0,
                                                            'inflate' => 0,
                                                            'inflateEnd' => 0,
                                                            'inflateInit2_' => 0,
                                                            'malloc@GLIBC_2.2.5' => 0,
                                                            'memchr@GLIBC_2.2.5' => 0,
                                                            'memcpy@GLIBC_2.14' => 0,
                                                            'memmove@GLIBC_2.2.5' => 0,
                                                            'memset@GLIBC_2.2.5' => 0,
                                                            'printf@GLIBC_2.2.5' => 0,
                                                            'realloc@GLIBC_2.2.5' => 0,
                                                            'strcasecmp@GLIBC_2.2.5' => 0,
                                                            'strchr@GLIBC_2.2.5' => 0,
                                                            'strcmp@GLIBC_2.2.5' => 0,
                                                            'strncasecmp@GLIBC_2.2.5' => 0
                                                          }
                                },
          'WordSize' => '8'
        };
