$VAR1 = {
          'ABI_DUMPER_VERSION' => '0.99.19',
          'ABI_DUMP_VERSION' => '3.3',
          'Arch' => 'x86_64',
          'GccVersion' => '4.8.5',
          'Headers' => {
                         'serf.h' => 1,
                         'serf_bucket_types.h' => 1,
                         'serf_bucket_util.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libserf-0.so.0.0.0',
          'LibraryVersion' => '0.3.0',
          'NameSpaces' => {},
          'Needed' => {
                        'libapr-1.so.0' => 1,
                        'libaprutil-1.so.0' => 1,
                        'libc.so.6' => 1,
                        'libcrypto.so.1.0.0' => 1,
                        'libdb-4.8.so' => 1,
                        'libdl.so.2' => 1,
                        'libexpat.so.1' => 1,
                        'liblber-2.4.so.2' => 1,
                        'libldap-2.4.so.2' => 1,
                        'libm.so.6' => 1,
                        'libpthread.so.0' => 1,
                        'librt.so.1' => 1,
                        'libssl.so.1.0.0' => 1,
                        'libz.so.1' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'aggregate_buckets.c' => 1,
                         'allocator.c' => 1,
                         'barrier_buckets.c' => 1,
                         'buckets.c' => 1,
                         'chunk_buckets.c' => 1,

                                                   'serf_debug__bucket_destroy' => 1,
                                                   'serf_debug__closed_conn' => 1,
                                                   'serf_debug__entered_loop' => 1,
                                                   'serf_debug__record_read' => 1,
                                                   'serf_default_destroy' => 1,
                                                   'serf_default_destroy_and_data' => 1,
                                                   'serf_default_is_snapshot_set' => 1,
                                                   'serf_default_read_bucket' => 1,
                                                   'serf_default_read_for_sendfile' => 1,
                                                   'serf_default_read_iovec' => 1,
                                                   'serf_default_restore_snapshot' => 1,
                                                   'serf_default_snapshot' => 1,
                                                   'serf_event_trigger' => 1,
                                                   'serf_linebuf_fetch' => 1,
                                                   'serf_linebuf_init' => 1,
                                                   'serf_request_bucket_request_create' => 1,
                                                   'serf_request_cancel' => 1,
                                                   'serf_request_get_alloc' => 1,
                                                   'serf_request_get_conn' => 1,
                                                   'serf_request_get_pool' => 1,
                                                   'serf_request_set_handler' => 1,
                                                   'serf_ssl_cert_certificate' => 1,
                                                   'serf_ssl_cert_depth' => 1,
                                                   'serf_ssl_cert_export' => 1,
                                                   'serf_ssl_cert_issuer' => 1,
                                                   'serf_ssl_cert_subject' => 1,
                                                   'serf_ssl_client_cert_password_set' => 1,
                                                   'serf_ssl_client_cert_provider_set' => 1,
                                                   'serf_ssl_load_cert_file' => 1,
                                                   'serf_ssl_server_cert_callback_set' => 1,
                                                   'serf_ssl_trust_cert' => 1,
                                                   'serf_ssl_use_default_certificates' => 1,
                                                   'serf_util_readline' => 1,
                                                   'ssl_locks' => -8,
                                                   'ssl_pool' => -8
                                                 }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '1033' => {
                                      'BaseType' => '1044',
                                      'Header' => 'serf.h',
                                      'Line' => '43',
                                      'Name' => 'serf_bucket_type_t',
                                      'Size' => '88',
                                      'Type' => 'Typedef'
                                    },
                          '1044' => {
                                      'Header' => 'serf.h',
                                      'Line' => '571',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'name',
                                                           'offset' => '0',
                                                           'type' => '369'
                                                         },
                                                  '1' => {
                                                           'name' => 'read',
                                                           'offset' => '8',
                                                           'type' => '1265'
                                                         },
                                                  '10' => {
                                                            'name' => 'is_snapshot_set',
                                                            'offset' => '80',
                                                            'type' => '1538'
                                                          },
                                                  '2' => {
                                                           'name' => 'readline',
                                                           'offset' => '16',
                                                           'type' => '1306'
                                                         },
                                                  '3' => {
                                                           'name' => 'read_iovec',
                                                           'offset' => '24',
                                                           'type' => '1347'
                                                         },
                                                  '4' => {
                                                           'name' => 'read_for_sendfile',
                                                           'offset' => '32',
                                                           'type' => '1411'
                                                         },
                                                  '5' => {
                                                           'name' => 'read_bucket',
                                                           'offset' => '40',
                                                           'type' => '1448'
                                                         },
                                                  '6' => {
                                                           'name' => 'peek',
                                                           'offset' => '48',
                                                           'type' => '1479'
                                                         },
                                                  '7' => {
                                                           'name' => 'destroy',
                                                           'offset' => '56',
                                                           'type' => '1496'
                                                         },
                                                  '8' => {
                                                           'name' => 'snapshot',
                                                           'offset' => '64',
                                                           'type' => '1517'
                                                         },
                                                  '9' => {
                                                           'name' => 'restore_snapshot',
                                                           'offset' => '72',
                                                           'type' => '1517'
                                                         }
                                                },
                                      'Name' => 'struct serf_bucket_type_t',
                                      'Size' => '88',
                                      'Type' => 'Struct'
                                    },
                          '10888' => {
                                       'BaseType' => '10899',
                                       'Header' => 'serf.h',
                                       'Line' => '160',
                                       'Name' => 'serf_progress_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10899' => {
                                       'Name' => 'void(*)(void*, apr_off_t, apr_off_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '346'
                                                           },
                                                    '2' => {
                                                             'type' => '346'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11543' => {
                                       'BaseType' => '11555',
                                       'Header' => 'serf.h',
                                       'Line' => '812',
                                       'Name' => 'serf_unfreed_func_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11555' => {
                                       'Name' => 'void(*)(void*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '234'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1201' => {
                                      'BaseType' => '1212',
                                      'Header' => 'serf.h',
                                      'Line' => '44',
                                      'Name' => 'serf_bucket_alloc_t',
                                      'Type' => 'Typedef'
                                    },
                          '1212' => {
                                      'Line' => '83',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'pool',
                                                           'offset' => '0',
                                                           'type' => '4440'
                                                         },
                                                  '1' => {
                                                           'name' => 'allocator',
                                                           'offset' => '8',
                                                           'type' => '18693'
                                                         },
                                                  '2' => {
                                                           'name' => 'unfreed',
                                                           'offset' => '16',
                                                           'type' => '11543'
                                                         },
                                                  '3' => {
                                                           'name' => 'unfreed_baton',
                                                           'offset' => '24',
                                                           'type' => '234'
                                                         },
                                                  '4' => {
                                                           'name' => 'num_alloc',
                                                           'offset' => '32',
                                                           'type' => '8235'
                                                         },
                                                  '5' => {
                                                           'name' => 'freelist',
                                                           'offset' => '40',
                                                           'type' => '46606'
                                                         },
                                                  '6' => {
                                                           'name' => 'blocks',
                                                           'offset' => '48',
                                                           'type' => '45063'
                                                         },
                                                  '7' => {
                                                           'name' => 'track',
                                                           'offset' => '56',
                                                           'type' => '46612'
                                                         }
                                                },
                                      'Name' => 'struct serf_bucket_alloc_t',
                                      'PrivateABI' => 1,
                                      'Size' => '64',
                                      'Source' => 'allocator.c',
                                      'Type' => 'Struct'
                                    },
                          '1217' => {
                                      'BaseType' => '969',
                                      'Name' => 'serf_bucket_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1253' => {
                                      'BaseType' => '369',
                                      'Name' => 'char const**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1259' => {
                                      'BaseType' => '334',
                                      'Name' => 'apr_size_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1265' => {
                                      'Name' => 'apr_status_t(*)(serf_bucket_t*, apr_size_t, char const**, apr_size_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1217'
                                                          },
                                                   '1' => {
                                                            'type' => '334'
                                                          },
                                                   '2' => {
                                                            'type' => '1253'
                                                          },
                                                   '3' => {
                                                            'type' => '1259'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1306' => {
                                      'Name' => 'apr_status_t(*)(serf_bucket_t*, int, int*, char const**, apr_size_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1217'
                                                          },
                                                   '1' => {
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'type' => '328'
                                                          },
                                                   '3' => {
                                                            'type' => '1253'
                                                          },
                                                   '4' => {
                                                            'type' => '1259'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1347' => {
                                      'Name' => 'apr_status_t(*)(serf_bucket_t*, apr_size_t, int, struct iovec*, int*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1217'
                                                          },
                                                   '1' => {
                                                            'type' => '334'
                                                          },
                                                   '2' => {
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'type' => '322'
                                                          },
                                                   '4' => {
                                                            'type' => '328'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1393' => {
                                      'BaseType' => '886',
                                      'Name' => 'apr_hdtr_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1399' => {
                                      'BaseType' => '963',
                                      'Name' => 'apr_file_t**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1405' => {
                                      'BaseType' => '346',
                                      'Name' => 'apr_off_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1411' => {
                                      'Name' => 'apr_status_t(*)(serf_bucket_t*, apr_size_t, apr_hdtr_t*, apr_file_t**, apr_off_t*, apr_size_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1217'
                                                          },
                                                   '1' => {
                                                            'type' => '334'
                                                          },
                                                   '2' => {
                                                            'type' => '1393'
                                                          },
                                                   '3' => {
                                                            'type' => '1399'
                                                          },
                                                   '4' => {
                                                            'type' => '1405'
                                                          },
                                                   '5' => {
                                                            'type' => '1259'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1437' => {
                                      'BaseType' => '1443',
                                      'Name' => 'serf_bucket_type_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1443' => {
                                      'BaseType' => '1033',
                                      'Name' => 'serf_bucket_type_t const',
                                      'Size' => '88',
                                      'Type' => 'Const'
                                    },
                          '1448' => {
                                      'Name' => 'serf_bucket_t*(*)(serf_bucket_t*, serf_bucket_type_t const*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1217'
                                                          },
                                                   '1' => {
                                                            'type' => '1437'
                                                          }
                                                 },
                                      'Return' => '1217',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1479' => {
                                      'Name' => 'apr_status_t(*)(serf_bucket_t*, char const**, apr_size_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1217'
                                                          },
                                                   '1' => {
                                                            'type' => '1253'
                                                          },
                                                   '2' => {
                                                            'type' => '1259'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1496' => {
                                      'Name' => 'void(*)(serf_bucket_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1217'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1517' => {
                                      'Name' => 'apr_status_t(*)(serf_bucket_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1217'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1538' => {
                                      'Name' => 'int(*)(serf_bucket_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1217'
                                                          }
                                                 },
                                      'Return' => '191',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1544' => {
                                      'BaseType' => '1201',
                                      'Name' => 'serf_bucket_alloc_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1550' => {
                                      'BaseType' => '1561',
                                      'Header' => 'serf_bucket_types.h',
                                      'Line' => '195',
                                      'Name' => 'serf_simple_freefunc_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1561' => {
                                      'Name' => 'void(*)(void*, char const*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '234'
                                                          },
                                                   '1' => {
                                                            'type' => '369'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '15978' => {
                                       'BaseType' => '10888',
                                       'Name' => 'serf_progress_t const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '163' => {
                                     'Name' => 'unsigned int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '170' => {
                                     'Name' => 'unsigned long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '18693' => {
                                       'BaseType' => '8365',
                                       'Name' => 'apr_allocator_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '191' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '198' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '205' => {
                                     'BaseType' => '198',
                                     'Header' => 'types.h',
                                     'Line' => '131',
                                     'Name' => '__off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '20751' => {
                                       'Header' => 'serf.h',
                                       'Line' => '865',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'SERF_LINEBUF_EMPTY',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'SERF_LINEBUF_READY',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'SERF_LINEBUF_PARTIAL',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'SERF_LINEBUF_CRLF_SPLIT',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'anon-enum-serf.h-865',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '20835' => {
                                       'BaseType' => '242',
                                       'Name' => 'char[8000]',
                                       'Size' => '8000',
                                       'Type' => 'Array'
                                     },
                          '20852' => {
                                       'Header' => 'serf.h',
                                       'Line' => '878',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state',
                                                            'offset' => '0',
                                                            'type' => '20751'
                                                          },
                                                   '1' => {
                                                            'name' => 'used',
                                                            'offset' => '8',
                                                            'type' => '334'
                                                          },
                                                   '2' => {
                                                            'name' => 'line',
                                                            'offset' => '16',
                                                            'type' => '20835'
                                                          }
                                                 },
                                       'Name' => 'struct serf_linebuf_t',
                                       'Size' => '8016',
                                       'Type' => 'Struct'
                                     },
                          '20871' => {
                                       'BaseType' => '20882',
                                       'Header' => 'serf_bucket_util.h',
                                       'Line' => '210',
                                       'Name' => 'serf_databuf_reader_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '20882' => {
                                       'Name' => 'apr_status_t(*)(void*, apr_size_t, char*, apr_size_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '334'
                                                           },
                                                    '2' => {
                                                             'type' => '236'
                                                           },
                                                    '3' => {
                                                             'type' => '1259'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '21000' => {
                                       'Header' => 'serf_bucket_util.h',
                                       'Line' => '242',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'current',
                                                            'offset' => '0',
                                                            'type' => '369'
                                                          },
                                                   '1' => {
                                                            'name' => 'remaining',
                                                            'offset' => '8',
                                                            'type' => '334'
                                                          },
                                                   '2' => {
                                                            'name' => 'read',
                                                            'offset' => '16',
                                                            'type' => '20871'
                                                          },
                                                   '3' => {
                                                            'name' => 'read_baton',
                                                            'offset' => '24',
                                                            'type' => '234'
                                                          },
                                                   '4' => {
                                                            'name' => 'status',
                                                            'offset' => '32',
                                                            'type' => '358'
                                                          },
                                                   '5' => {
                                                            'name' => 'buf',
                                                            'offset' => '36',
                                                            'type' => '20835'
                                                          }
                                                 },
                                       'Name' => 'struct serf_databuf_t',
                                       'Size' => '8040',
                                       'Type' => 'Struct'
                                     },
                          '21138' => {
                                       'BaseType' => '21000',
                                       'Name' => 'serf_databuf_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '234' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '23421' => {
                                       'BaseType' => '20852',
                                       'Name' => 'serf_linebuf_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '236' => {
                                     'BaseType' => '242',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '242' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '249' => {
                                     'BaseType' => '205',
                                     'Header' => 'types.h',
                                     'Line' => '86',
                                     'Name' => 'off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '260' => {
                                     'BaseType' => '170',
                                     'Header' => 'stddef.h',
                                     'Line' => '212',
                                     'Name' => 'size_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '285' => {
                                     'Header' => 'uio.h',
                                     'Line' => '43',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'iov_base',
                                                          'offset' => '0',
                                                          'type' => '234'
                                                        },
                                                 '1' => {
                                                          'name' => 'iov_len',
                                                          'offset' => '8',
                                                          'type' => '260'
                                                        }
                                               },
                                     'Name' => 'struct iovec',
                                     'PrivateABI' => 1,
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '28740' => {
                                       'BaseType' => '28751',
                                       'Header' => 'apr_mmap.h',
                                       'Line' => '51',
                                       'Name' => 'apr_mmap_t',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '28751' => {
                                       'Header' => 'apr_mmap.h',
                                       'Line' => '62',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cntxt',
                                                            'offset' => '0',
                                                            'type' => '4440'
                                                          },
                                                   '1' => {
                                                            'name' => 'mm',
                                                            'offset' => '8',
                                                            'type' => '234'
                                                          },
                                                   '2' => {
                                                            'name' => 'size',
                                                            'offset' => '16',
                                                            'type' => '334'
                                                          },
                                                   '3' => {
                                                            'name' => 'link',
                                                            'offset' => '24',
                                                            'type' => '28811'
                                                          }
                                                 },
                                       'Name' => 'struct apr_mmap_t',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '28811' => {
                                       'Header' => 'apr_mmap.h',
                                       'Line' => '85',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '28844'
                                                          },
                                                   '1' => {
                                                            'name' => 'prev',
                                                            'offset' => '8',
                                                            'type' => '28844'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-apr_mmap.h-85',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '28844' => {
                                       'BaseType' => '30041',
                                       'Name' => 'struct apr_mmap_t*volatile',
                                       'Size' => '8',
                                       'Type' => 'Volatile'
                                     },
                          '30041' => {
                                       'BaseType' => '28740',
                                       'Name' => 'apr_mmap_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '322' => {
                                     'BaseType' => '285',
                                     'Name' => 'struct iovec*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '328' => {
                                     'BaseType' => '191',
                                     'Name' => 'int*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '334' => {
                                     'BaseType' => '260',
                                     'Header' => 'apr.h',
                                     'Line' => '356',
                                     'Name' => 'apr_size_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '346' => {
                                     'BaseType' => '249',
                                     'Header' => 'apr.h',
                                     'Line' => '358',
                                     'Name' => 'apr_off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '358' => {
                                     'BaseType' => '191',
                                     'Header' => 'apr_errno.h',
                                     'Line' => '44',
                                     'Name' => 'apr_status_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '369' => {
                                     'BaseType' => '375',
                                     'Name' => 'char const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '375' => {
                                     'BaseType' => '242',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '380' => {
                                     'Name' => 'struct apr_file_t',
                                     'PrivateABI' => 1,
                                     'Type' => 'Struct'
                                   },
                          '4424' => {
                                      'BaseType' => '4435',
                                      'Header' => 'apr_pools.h',
                                      'Line' => '60',
                                      'Name' => 'apr_pool_t',
                                      'Type' => 'Typedef'
                                    },
                          '4435' => {
                                      'Name' => 'struct apr_pool_t',
                                      'PrivateABI' => 1,
                                      'Type' => 'Struct'
                                    },
                          '4440' => {
                                      'BaseType' => '4424',
                                      'Name' => 'apr_pool_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '44967' => {
                                       'BaseType' => '44978',
                                       'Header' => 'apr_allocator.h',
                                       'Line' => '43',
                                       'Name' => 'apr_memnode_t',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '44978' => {
                                       'Header' => 'apr_allocator.h',
                                       'Line' => '54',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '45063'
                                                          },
                                                   '1' => {
                                                            'name' => 'ref',
                                                            'offset' => '8',
                                                            'type' => '45069'
                                                          },
                                                   '2' => {
                                                            'name' => 'index',
                                                            'offset' => '16',
                                                            'type' => '8235'
                                                          },
                                                   '3' => {
                                                            'name' => 'free_index',
                                                            'offset' => '20',
                                                            'type' => '8235'
                                                          },
                                                   '4' => {
                                                            'name' => 'first_avail',
                                                            'offset' => '24',
                                                            'type' => '236'
                                                          },
                                                   '5' => {
                                                            'name' => 'endp',
                                                            'offset' => '32',
                                                            'type' => '236'
                                                          }
                                                 },
                                       'Name' => 'struct apr_memnode_t',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '45063' => {
                                       'BaseType' => '44967',
                                       'Name' => 'apr_memnode_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '45069' => {
                                       'BaseType' => '45063',
                                       'Name' => 'apr_memnode_t**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '46389' => {
                                       'Line' => '26',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '46606'
                                                          },
                                                   '1' => {
                                                            'name' => 'memnode',
                                                            'offset' => '0',
                                                            'type' => '45063'
                                                          }
                                                 },
                                       'Name' => 'anon-union-allocator.c-26',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Source' => 'allocator.c',
                                       'Type' => 'Union'
                                     },
                          '46420' => {
                                       'Line' => '24',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'size',
                                                            'offset' => '0',
                                                            'type' => '334'
                                                          },
                                                   '1' => {
                                                            'name' => 'u',
                                                            'offset' => '8',
                                                            'type' => '46389'
                                                          }
                                                 },
                                       'Name' => 'struct node_header_t',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Source' => 'allocator.c',
                                       'Type' => 'Struct'
                                     },
                          '46461' => {
                                       'BaseType' => '46420',
                                       'Line' => '31',
                                       'Name' => 'node_header_t',
                                       'Size' => '16',
                                       'Source' => 'allocator.c',
                                       'Type' => 'Typedef'
                                     },
                          '46505' => {
                                       'BaseType' => '46511',
                                       'Name' => 'serf_bucket_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '46511' => {
                                       'BaseType' => '969',
                                       'Name' => 'serf_bucket_t const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '46516' => {
                                       'Line' => '71',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'bucket',
                                                            'offset' => '0',
                                                            'type' => '46505'
                                                          },
                                                   '1' => {
                                                            'name' => 'last',
                                                            'offset' => '8',
                                                            'type' => '358'
                                                          }
                                                 },
                                       'Name' => 'struct read_status_t',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Source' => 'allocator.c',
                                       'Type' => 'Struct'
                                     },
                          '46573' => {
                                       'BaseType' => '46516',
                                       'Name' => 'read_status_t[100]',
                                       'Size' => '1600',
                                       'Type' => 'Array'
                                     },
                          '46589' => {
                                       'Line' => '80',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next_index',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'num_used',
                                                            'offset' => '4',
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'name' => 'info',
                                                            'offset' => '8',
                                                            'type' => '46573'
                                                          }
                                                 },
                                       'Name' => 'struct track_state_t',
                                       'PrivateABI' => 1,
                                       'Size' => '1608',
                                       'Source' => 'allocator.c',
                                       'Type' => 'Struct'
                                     },
                          '46606' => {
                                       'BaseType' => '46461',
                                       'Name' => 'node_header_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '46612' => {
                                       'BaseType' => '46589',
                                       'Name' => 'track_state_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '7320' => {
                                      'BaseType' => '7326',
                                      'Name' => 'serf_bucket_alloc_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7326' => {
                                      'BaseType' => '1201',
                                      'Name' => 'serf_bucket_alloc_t const',
                                      'Type' => 'Const'
                                    },
                          '8235' => {
                                      'BaseType' => '163',
                                      'Header' => 'apr.h',
                                      'Line' => '315',
                                      'Name' => 'apr_uint32_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '8365' => {
                                      'BaseType' => '8376',
                                      'Header' => 'apr_allocator.h',
                                      'Line' => '41',
                                      'Name' => 'apr_allocator_t',
                                      'Type' => 'Typedef'
                                    },
                          '8376' => {
                                      'Name' => 'struct apr_allocator_t',
                                      'PrivateABI' => 1,
                                      'Type' => 'Struct'
                                    },
                          '875' => {
                                     'BaseType' => '380',
                                     'Header' => 'apr_file_io.h',
                                     'Line' => '188',
                                     'Name' => 'apr_file_t',
                                     'Type' => 'Typedef'
                                   },
                          '886' => {
                                     'BaseType' => '897',
                                     'Header' => 'apr_network_io.h',
                                     'Line' => '197',
                                     'Name' => 'apr_hdtr_t',
                                     'Size' => '32',
                                     'Type' => 'Typedef'
                                   },
                          '897' => {
                                     'Header' => 'apr_network_io.h',
                                     'Line' => '263',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'headers',
                                                          'offset' => '0',
                                                          'type' => '322'
                                                        },
                                                 '1' => {
                                                          'name' => 'numheaders',
                                                          'offset' => '8',
                                                          'type' => '191'
                                                        },
                                                 '2' => {
                                                          'name' => 'trailers',
                                                          'offset' => '16',
                                                          'type' => '322'
                                                        },
                                                 '3' => {
                                                          'name' => 'numtrailers',
                                                          'offset' => '24',
                                                          'type' => '191'
                                                        }
                                               },
                                     'Name' => 'struct apr_hdtr_t',
                                     'PrivateABI' => 1,
                                     'Size' => '32',
                                     'Type' => 'Struct'
                                   },
                          '9177' => {
                                      'BaseType' => '9188',
                                      'Header' => 'apr_network_io.h',
                                      'Line' => '193',
                                      'Name' => 'apr_socket_t',
                                      'Type' => 'Typedef'
                                    },
                          '9188' => {
                                      'Name' => 'struct apr_socket_t',
                                      'PrivateABI' => 1,
                                      'Type' => 'Struct'
                                    },
                          '9561' => {
                                      'BaseType' => '9177',
                                      'Name' => 'apr_socket_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '963' => {
                                     'BaseType' => '875',
                                     'Name' => 'apr_file_t*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '969' => {
                                     'BaseType' => '980',
                                     'Header' => 'serf.h',
                                     'Line' => '42',
                                     'Name' => 'serf_bucket_t',
                                     'Size' => '24',
                                     'Type' => 'Typedef'
                                   },
                          '980' => {
                                     'Header' => 'serf.h',
                                     'Line' => '786',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'type',
                                                          'offset' => '0',
                                                          'type' => '1437'
                                                        },
                                                 '1' => {
                                                          'name' => 'data',
                                                          'offset' => '8',
                                                          'type' => '234'
                                                        },
                                                 '2' => {
                                                          'name' => 'allocator',
                                                          'offset' => '16',
                                                          'type' => '1544'
                                                        }
                                               },
                                     'Name' => 'struct serf_bucket_t',
                                     'Size' => '24',
                                     'Type' => 'Struct'
                                   }
                        },
          'UndefinedSymbols' => {
                                  'libserf-0.so.0.0.0' => {
                                                            'ASN1_TIME_print' => 0,
                                                            'BIO_clear_flags' => 0,
                                                            'BIO_free' => 0,
                                                            'BIO_new' => 0,
                                                            'BIO_read' => 0,
                                                            'BIO_s_mem' => 0,
                                                            'BIO_set_flags' => 0,
                                                            'BIO_test_flags' => 0,
                                                            'CRYPTO_num_locks' => 0,
                                                            'CRYPTO_set_dynlock_create_callback' => 0,
                                                            'CRYPTO_set_dynlock_destroy_callback' => 0,
                                                            'CRYPTO_set_dynlock_lock_callback' => 0,
                                                            'CRYPTO_set_id_callback' => 0,
                                                            'CRYPTO_set_locking_callback' => 0,
                                                            'CRYPTO_set_mem_functions' => 0,
                                                            'ERR_clear_error' => 0,
                                                            'ERR_get_error' => 0,
                                                            'ERR_load_crypto_strings' => 0,
                                                            'EVP_sha1' => 0,
                                                            'OPENSSL_add_all_algorithms_noconf' => 0,
                                                            'PEM_read_X509' => 0,
                                                            'PKCS12_free' => 0,
                                                            'PKCS12_parse' => 0,
                                                            'SSL_CTX_ctrl' => 0,
                                                            'SSL_CTX_free' => 0,
                                                            'SSL_CTX_get_cert_store' => 0,
                                                            'SSL_CTX_new' => 0,
                                                            'SSL_CTX_set_client_cert_cb' => 0,
                                                            'SSL_CTX_set_verify' => 0,
                                                            'SSL_free' => 0,
                                                            'SSL_get_error' => 0,
                                                            'SSL_get_ex_data' => 0,
                                                            'SSL_get_ex_data_X509_STORE_CTX_idx' => 0,
                                                            'SSL_library_init' => 0,
                                                            'SSL_load_error_strings' => 0,
                                                            'SSL_new' => 0,
                                                            'SSL_read' => 0,
                                                            'SSL_set_bio' => 0,
                                                            'SSL_set_connect_state' => 0,
                                                            'SSL_set_ex_data' => 0,
                                                            'SSL_write' => 0,
                                                            'SSLv23_client_method' => 0,
                                                            'X509_NAME_get_text_by_NID' => 0,
                                                            'X509_STORE_CTX_get_current_cert' => 0,
                                                            'X509_STORE_CTX_get_error' => 0,
                                                            'X509_STORE_CTX_get_error_depth' => 0,
                                                            'X509_STORE_CTX_get_ex_data' => 0,
                                                            'X509_STORE_add_cert' => 0,
                                                            'X509_STORE_set_default_paths' => 0,
                                                            'X509_cmp_current_time' => 0,
                                                            'X509_digest' => 0,
                                                            'X509_get_issuer_name' => 0,
                                                            'X509_get_subject_name' => 0,
                                                            '_ITM_deregisterTMCloneTable' => 0,
                                                            '_ITM_registerTMCloneTable' => 0,
                                                            '_Jv_RegisterClasses' => 0,
                                                            '__ctype_b_loc@GLIBC_2.3' => 0,
                                                            '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                            '__errno_location@GLIBC_2.2.5' => 0,
                                                            '__gmon_start__' => 0,
                                                            'abort@GLIBC_2.2.5' => 0,
                                                            'apr_allocator_alloc' => 0,
                                                            'apr_allocator_free' => 0,
                                                            'apr_array_make' => 0,
                                                            'apr_array_push' => 0,
                                                            'apr_atomic_xchg32' => 0,
                                                            'apr_base64_encode' => 0,
                                                            'apr_base64_encode_len' => 0,
                                                            'apr_date_checkmask' => 0,
                                                            'apr_file_close' => 0,
                                                            'apr_file_name_get' => 0,
                                                            'apr_file_open' => 0,
                                                            'apr_file_read' => 0,
                                                            'apr_file_write' => 0,
                                                            'apr_hash_make' => 0,
                                                            'apr_hash_set' => 0,
                                                            'apr_mmap_create' => 0,
                                                            'apr_mmap_offset' => 0,
                                                            'apr_os_thread_current' => 0,
                                                            'apr_palloc' => 0,
                                                            'apr_pollset_add' => 0,
                                                            'apr_pollset_create' => 0,
                                                            'apr_pollset_poll' => 0,
                                                            'apr_pollset_remove' => 0,
                                                            'apr_pool_allocator_get' => 0,
                                                            'apr_pool_cleanup_null' => 0,
                                                            'apr_pool_cleanup_register' => 0,
                                                            'apr_pool_clear' => 0,
                                                            'apr_pool_create_ex' => 0,
                                                            'apr_pool_destroy' => 0,
                                                            'apr_pool_userdata_get' => 0,
                                                            'apr_pool_userdata_setn' => 0,
                                                            'apr_pstrcat' => 0,
                                                            'apr_pstrcatv' => 0,
                                                            'apr_pstrdup' => 0,
                                                            'apr_snprintf' => 0,
                                                            'apr_sockaddr_info_get' => 0,
                                                            'apr_socket_close' => 0,
                                                            'apr_socket_connect' => 0,
                                                            'apr_socket_create' => 0,
                                                            'apr_socket_opt_set' => 0,
                                                            'apr_socket_recv' => 0,
                                                            'apr_socket_sendv' => 0,
                                                            'apr_socket_timeout_set' => 0,
                                                            'apr_stat' => 0,
                                                            'apr_strtoi64' => 0,
                                                            'apr_thread_mutex_create' => 0,
                                                            'apr_thread_mutex_destroy' => 0,
                                                            'apr_thread_mutex_lock' => 0,
                                                            'apr_thread_mutex_unlock' => 0,
                                                            'apr_uri_unparse' => 0,
                                                            'crc32' => 0,
                                                            'd2i_PKCS12_bio' => 0,
                                                            'fclose@GLIBC_2.2.5' => 0,
                                                            'fopen@GLIBC_2.2.5' => 0,
                                                            'free@GLIBC_2.2.5' => 0,
                                                            'i2d_X509' => 0,
                                                            'inflate' => 0,
                                                            'inflateEnd' => 0,
                                                            'inflateInit2_' => 0,
                                                            'malloc@GLIBC_2.2.5' => 0,
                                                            'memchr@GLIBC_2.2.5' => 0,
                                                            'memcpy@GLIBC_2.14' => 0,
                                                            'memmove@GLIBC_2.2.5' => 0,
                                                            'memset@GLIBC_2.2.5' => 0,
                                                            'printf@GLIBC_2.2.5' => 0,
                                                            'realloc@GLIBC_2.2.5' => 0,
                                                            'strcasecmp@GLIBC_2.2.5' => 0,
                                                            'strncasecmp@GLIBC_2.2.5' => 0
                                                          }
                                },
          'WordSize' => '8'
        };
