$VAR1 = {
          'ABI_DUMPER_VERSION' => '0.99.19',
          'ABI_DUMP_VERSION' => '3.3',
          'Arch' => 'x86_64',
          'GccVersion' => '4.8.5',
          'Headers' => {
                         'serf.h' => 1,
                         'serf_bucket_types.h' => 1,
                         'serf_bucket_util.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libserf-1.so.0.0.0',
          'LibraryVersion' => '1.2.0',
          'NameSpaces' => {},
          'Needed' => {
                        'libapr-1.so.0' => 1,
                        'libaprutil-1.so.0' => 1,
                        'libc.so.6' => 1,
                        'libcrypto.so.1.0.0' => 1,
                        'libdb-4.8.so' => 1,
                        'libdl.so.2' => 1,
                        'libexpat.so.1' => 1,
                        'liblber-2.4.so.2' => 1,
                        'libldap-2.4.so.2' => 1,
                        'libm.so.6' => 1,
                        'libpthread.so.0' => 1,
                        'librt.so.1' => 1,
                        'libssl.so.1.0.0' => 1,
                        'libz.so.1' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'aggregate_buckets.c' => 1,
                         'allocator.c' => 1,
                         'barrier_buckets.c' => 1,
                         'buckets.c' => 1,
                         'bwtp_buckets.c' => 1,

                                                   'serf_default_destroy' => 1,
                                                   'serf_default_destroy_and_data' => 1,
                                                   'serf_default_read_bucket' => 1,
                                                   'serf_default_read_for_sendfile' => 1,
                                                   'serf_default_read_iovec' => 1,
                                                   'serf_error_string' => 1,
                                                   'serf_event_trigger' => 1,
                                                   'serf_incoming_create' => 1,
                                                   'serf_lib_version' => 1,
                                                   'serf_linebuf_fetch' => 1,
                                                   'serf_linebuf_init' => 1,
                                                   'serf_listener_create' => 1,
                                                   'serf_request_bucket_request_create' => 1,
                                                   'serf_request_cancel' => 1,
                                                   'serf_request_get_alloc' => 1,
                                                   'serf_request_get_conn' => 1,
                                                   'serf_request_get_pool' => 1,
                                                   'serf_request_is_written' => 1,
                                                   'serf_request_set_handler' => 1,
                                                   'serf_response_full_become_aggregate' => 1,
                                                   'serf_ssl_cert_certificate' => 1,
                                                   'serf_ssl_cert_depth' => 1,
                                                   'serf_ssl_cert_export' => 1,
                                                   'serf_ssl_cert_issuer' => 1,
                                                   'serf_ssl_cert_subject' => 1,
                                                   'serf_ssl_client_cert_password_set' => 1,
                                                   'serf_ssl_client_cert_provider_set' => 1,
                                                   'serf_ssl_load_cert_file' => 1,
                                                   'serf_ssl_server_cert_callback_set' => 1,
                                                   'serf_ssl_server_cert_chain_callback_set' => 1,
                                                   'serf_ssl_set_hostname' => 1,
                                                   'serf_ssl_trust_cert' => 1,
                                                   'serf_ssl_use_compression' => 1,
                                                   'serf_ssl_use_default_certificates' => 1,
                                                   'serf_util_readline' => 1
                                                 }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '10130' => {
                                       'Name' => 'struct hostent',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '10135' => {
                                       'BaseType' => '10130',
                                       'Name' => 'struct hostent*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10141' => {
                                       'BaseType' => '10152',
                                       'Header' => 'serf.h',
                                       'Line' => '38',
                                       'Name' => 'serf_context_t',
                                       'Size' => '152',
                                       'Type' => 'Typedef'
                                     },
                          '10152' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '96',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pool',
                                                            'offset' => '0',
                                                            'type' => '4575'
                                                          },
                                                   '1' => {
                                                            'name' => 'pollset_baton',
                                                            'offset' => '8',
                                                            'type' => '234'
                                                          },
                                                   '10' => {
                                                             'name' => 'progress_written',
                                                             'offset' => '80',
                                                             'type' => '346'
                                                           },
                                                   '11' => {
                                                             'name' => 'authn_info',
                                                             'offset' => '88',
                                                             'type' => '12699'
                                                           },
                                                   '12' => {
                                                             'name' => 'proxy_authn_info',
                                                             'offset' => '112',
                                                             'type' => '12699'
                                                           },
                                                   '13' => {
                                                             'name' => 'authn_types',
                                                             'offset' => '136',
                                                             'type' => '191'
                                                           },
                                                   '14' => {
                                                             'name' => 'cred_cb',
                                                             'offset' => '144',
                                                             'type' => '11804'
                                                           },
                                                   '2' => {
                                                            'name' => 'pollset_add',
                                                            'offset' => '16',
                                                            'type' => '11496'
                                                          },
                                                   '3' => {
                                                            'name' => 'pollset_rm',
                                                            'offset' => '24',
                                                            'type' => '11538'
                                                          },
                                                   '4' => {
                                                            'name' => 'dirty_pollset',
                                                            'offset' => '32',
                                                            'type' => '191'
                                                          },
                                                   '5' => {
                                                            'name' => 'conns',
                                                            'offset' => '40',
                                                            'type' => '12710'
                                                          },
                                                   '6' => {
                                                            'name' => 'proxy_address',
                                                            'offset' => '48',
                                                            'type' => '9713'
                                                          },
                                                   '7' => {
                                                            'name' => 'progress_func',
                                                            'offset' => '56',
                                                            'type' => '11549'
                                                          },
                                                   '8' => {
                                                            'name' => 'progress_baton',
                                                            'offset' => '64',
                                                            'type' => '234'
                                                          },
                                                   '9' => {
                                                            'name' => 'progress_read',
                                                            'offset' => '72',
                                                            'type' => '346'
                                                          }
                                                 },
                                       'Name' => 'struct serf_context_t',
                                       'PrivateABI' => 1,
                                       'Size' => '152',
                                       'Type' => 'Struct'
                                     },
                          '1033' => {
                                      'BaseType' => '1044',
                                      'Header' => 'serf.h',
                                      'Line' => '41',
                                      'Name' => 'serf_bucket_type_t',
                                      'Size' => '64',
                                      'Type' => 'Typedef'
                                    },
                          '1044' => {
                                      'Header' => 'serf.h',
                                      'Line' => '740',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'name',
                                                           'offset' => '0',
                                                           'type' => '369'
                                                         },
                                                  '1' => {
                                                           'name' => 'read',
                                                           'offset' => '8',
                                                           'type' => '1226'
                                                         },
                                                  '2' => {
                                                           'name' => 'readline',
                                                           'offset' => '16',
                                                           'type' => '1267'
                                                         },
                                                  '3' => {
                                                           'name' => 'read_iovec',
                                                           'offset' => '24',
                                                           'type' => '1308'
                                                         },
                                                  '4' => {
                                                           'name' => 'read_for_sendfile',
                                                           'offset' => '32',
                                                           'type' => '1372'
                                                         },
                                                  '5' => {
                                                           'name' => 'read_bucket',
                                                           'offset' => '40',
                                                           'type' => '1409'
                                                         },
                                                  '6' => {
                                                           'name' => 'peek',
                                                           'offset' => '48',
                                                           'type' => '1440'
                                                         },
                                                  '7' => {
                                                           'name' => 'destroy',
                                                           'offset' => '56',
                                                           'type' => '1457'
                                                         }
                                                },
                                      'Name' => 'struct serf_bucket_type_t',
                                      'Size' => '64',
                                      'Type' => 'Struct'
                                    },
                          '10554' => {
                                       'BaseType' => '10565',
                                       'Header' => 'serf.h',
                                       'Line' => '44',
                                       'Name' => 'serf_connection_t',
                                       'Size' => '16752',
                                       'Type' => 'Typedef'
                                     },
                          '10565' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '158',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ctx',
                                                            'offset' => '0',
                                                            'type' => '11931'
                                                          },
                                                   '1' => {
                                                            'name' => 'status',
                                                            'offset' => '8',
                                                            'type' => '358'
                                                          },
                                                   '10' => {
                                                             'name' => 'dirty_conn',
                                                             'offset' => '76',
                                                             'type' => '191'
                                                           },
                                                   '11' => {
                                                             'name' => 'completed_requests',
                                                             'offset' => '80',
                                                             'type' => '163'
                                                           },
                                                   '12' => {
                                                             'name' => 'completed_responses',
                                                             'offset' => '84',
                                                             'type' => '163'
                                                           },
                                                   '13' => {
                                                             'name' => 'probable_keepalive_limit',
                                                             'offset' => '88',
                                                             'type' => '163'
                                                           },
                                                   '14' => {
                                                             'name' => 'state',
                                                             'offset' => '92',
                                                             'type' => '12749'
                                                           },
                                                   '15' => {
                                                             'name' => 'async_responses',
                                                             'offset' => '96',
                                                             'type' => '191'
                                                           },
                                                   '16' => {
                                                             'name' => 'current_async_response',
                                                             'offset' => '104',
                                                             'type' => '1178'
                                                           },
                                                   '17' => {
                                                             'name' => 'async_acceptor',
                                                             'offset' => '112',
                                                             'type' => '11652'
                                                           },
                                                   '18' => {
                                                             'name' => 'async_acceptor_baton',
                                                             'offset' => '120',
                                                             'type' => '234'
                                                           },
                                                   '19' => {
                                                             'name' => 'async_handler',
                                                             'offset' => '128',
                                                             'type' => '11756'
                                                           },
                                                   '2' => {
                                                            'name' => 'baton',
                                                            'offset' => '16',
                                                            'type' => '12580'
                                                          },
                                                   '20' => {
                                                             'name' => 'async_handler_baton',
                                                             'offset' => '136',
                                                             'type' => '234'
                                                           },
                                                   '21' => {
                                                             'name' => 'stream',
                                                             'offset' => '144',
                                                             'type' => '1178'
                                                           },
                                                   '22' => {
                                                             'name' => 'ostream_head',
                                                             'offset' => '152',
                                                             'type' => '1178'
                                                           },
                                                   '23' => {
                                                             'name' => 'ostream_tail',
                                                             'offset' => '160',
                                                             'type' => '1178'
                                                           },
                                                   '24' => {
                                                             'name' => 'ssltunnel_ostream',
                                                             'offset' => '168',
                                                             'type' => '1178'
                                                           },
                                                   '25' => {
                                                             'name' => 'requests',
                                                             'offset' => '176',
                                                             'type' => '11700'
                                                           },
                                                   '26' => {
                                                             'name' => 'requests_tail',
                                                             'offset' => '184',
                                                             'type' => '11700'
                                                           },
                                                   '27' => {
                                                             'name' => 'vec',
                                                             'offset' => '192',
                                                             'type' => '12760'
                                                           },
                                                   '28' => {
                                                             'name' => 'vec_len',
                                                             'offset' => '16576',
                                                             'type' => '191'
                                                           },
                                                   '29' => {
                                                             'name' => 'setup',
                                                             'offset' => '16584',
                                                             'type' => '11587'
                                                           },
                                                   '3' => {
                                                            'name' => 'pool',
                                                            'offset' => '32',
                                                            'type' => '4575'
                                                          },
                                                   '30' => {
                                                             'name' => 'setup_baton',
                                                             'offset' => '16592',
                                                             'type' => '234'
                                                           },
                                                   '31' => {
                                                             'name' => 'closed',
                                                             'offset' => '16600',
                                                             'type' => '11706'
                                                           },
                                                   '32' => {
                                                             'name' => 'closed_baton',
                                                             'offset' => '16608',
                                                             'type' => '234'
                                                           },
                                                   '33' => {
                                                             'name' => 'max_outstanding_requests',
                                                             'offset' => '16616',
                                                             'type' => '163'
                                                           },
                                                   '34' => {
                                                             'name' => 'hit_eof',
                                                             'offset' => '16620',
                                                             'type' => '191'
                                                           },
                                                   '35' => {
                                                             'name' => 'host_url',
                                                             'offset' => '16624',
                                                             'type' => '369'
                                                           },
                                                   '36' => {
                                                             'name' => 'host_info',
                                                             'offset' => '16632',
                                                             'type' => '9929'
                                                           },
                                                   '37' => {
                                                             'name' => 'authn_baton',
                                                             'offset' => '16720',
                                                             'type' => '234'
                                                           },
                                                   '38' => {
                                                             'name' => 'proxy_authn_baton',
                                                             'offset' => '16728',
                                                             'type' => '234'
                                                           },
                                                   '39' => {
                                                             'name' => 'connect_time',
                                                             'offset' => '16736',
                                                             'type' => '8605'
                                                           },
                                                   '4' => {
                                                            'name' => 'allocator',
                                                            'offset' => '40',
                                                            'type' => '1463'
                                                          },
                                                   '40' => {
                                                             'name' => 'latency',
                                                             'offset' => '16744',
                                                             'type' => '8616'
                                                           },
                                                   '5' => {
                                                            'name' => 'address',
                                                            'offset' => '48',
                                                            'type' => '9713'
                                                          },
                                                   '6' => {
                                                            'name' => 'skt',
                                                            'offset' => '56',
                                                            'type' => '9796'
                                                          },
                                                   '7' => {
                                                            'name' => 'skt_pool',
                                                            'offset' => '64',
                                                            'type' => '4575'
                                                          },
                                                   '8' => {
                                                            'name' => 'reqevents',
                                                            'offset' => '72',
                                                            'type' => '8471'
                                                          },
                                                   '9' => {
                                                            'name' => 'seen_in_pollset',
                                                            'offset' => '74',
                                                            'type' => '8471'
                                                          }
                                                 },
                                       'Name' => 'struct serf_connection_t',
                                       'PrivateABI' => 1,
                                       'Size' => '16752',
                                       'Type' => 'Struct'
                                     },
                          '11084' => {
                                       'BaseType' => '11095',
                                       'Header' => 'serf.h',
                                       'Line' => '45',
                                       'Name' => 'serf_listener_t',
                                       'Size' => '88',
                                       'Type' => 'Typedef'
                                     },
                          '11095' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '130',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ctx',
                                                            'offset' => '0',
                                                            'type' => '11931'
                                                          },
                                                   '1' => {
                                                            'name' => 'baton',
                                                            'offset' => '8',
                                                            'type' => '12580'
                                                          },
                                                   '2' => {
                                                            'name' => 'skt',
                                                            'offset' => '24',
                                                            'type' => '9796'
                                                          },
                                                   '3' => {
                                                            'name' => 'pool',
                                                            'offset' => '32',
                                                            'type' => '4575'
                                                          },
                                                   '4' => {
                                                            'name' => 'desc',
                                                            'offset' => '40',
                                                            'type' => '9813'
                                                          },
                                                   '5' => {
                                                            'name' => 'accept_baton',
                                                            'offset' => '72',
                                                            'type' => '234'
                                                          },
                                                   '6' => {
                                                            'name' => 'accept_func',
                                                            'offset' => '80',
                                                            'type' => '11878'
                                                          }
                                                 },
                                       'Name' => 'struct serf_listener_t',
                                       'PrivateABI' => 1,
                                       'Size' => '88',
                                       'Type' => 'Struct'
                                     },
                          '11192' => {
                                       'BaseType' => '11203',
                                       'Header' => 'serf.h',
                                       'Line' => '46',
                                       'Name' => 'serf_incoming_t',
                                       'Size' => '80',
                                       'Type' => 'Typedef'
                                     },
                          '11203' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '140',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ctx',
                                                            'offset' => '0',
                                                            'type' => '11931'
                                                          },
                                                   '1' => {
                                                            'name' => 'baton',
                                                            'offset' => '8',
                                                            'type' => '12580'
                                                          },
                                                   '2' => {
                                                            'name' => 'request_baton',
                                                            'offset' => '24',
                                                            'type' => '234'
                                                          },
                                                   '3' => {
                                                            'name' => 'request',
                                                            'offset' => '32',
                                                            'type' => '11943'
                                                          },
                                                   '4' => {
                                                            'name' => 'skt',
                                                            'offset' => '40',
                                                            'type' => '9796'
                                                          },
                                                   '5' => {
                                                            'name' => 'desc',
                                                            'offset' => '48',
                                                            'type' => '9813'
                                                          }
                                                 },
                                       'Name' => 'struct serf_incoming_t',
                                       'PrivateABI' => 1,
                                       'Size' => '80',
                                       'Type' => 'Struct'
                                     },
                          '11288' => {
                                       'BaseType' => '11299',
                                       'Header' => 'serf.h',
                                       'Line' => '47',
                                       'Name' => 'serf_incoming_request_t',
                                       'Type' => 'Typedef'
                                     },
                          '11299' => {
                                       'Name' => 'struct serf_incoming_request_t',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '11304' => {
                                       'BaseType' => '11315',
                                       'Header' => 'serf.h',
                                       'Line' => '49',
                                       'Name' => 'serf_request_t',
                                       'Size' => '104',
                                       'Type' => 'Typedef'
                                     },
                          '11315' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '55',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'conn',
                                                            'offset' => '0',
                                                            'type' => '11750'
                                                          },
                                                   '1' => {
                                                            'name' => 'respool',
                                                            'offset' => '8',
                                                            'type' => '4575'
                                                          },
                                                   '10' => {
                                                             'name' => 'resp_bkt',
                                                             'offset' => '80',
                                                             'type' => '1178'
                                                           },
                                                   '11' => {
                                                             'name' => 'written',
                                                             'offset' => '88',
                                                             'type' => '191'
                                                           },
                                                   '12' => {
                                                             'name' => 'priority',
                                                             'offset' => '92',
                                                             'type' => '191'
                                                           },
                                                   '13' => {
                                                             'name' => 'next',
                                                             'offset' => '96',
                                                             'type' => '11700'
                                                           },
                                                   '2' => {
                                                            'name' => 'allocator',
                                                            'offset' => '16',
                                                            'type' => '1463'
                                                          },
                                                   '3' => {
                                                            'name' => 'req_bkt',
                                                            'offset' => '24',
                                                            'type' => '1178'
                                                          },
                                                   '4' => {
                                                            'name' => 'setup',
                                                            'offset' => '32',
                                                            'type' => '11997'
                                                          },
                                                   '5' => {
                                                            'name' => 'setup_baton',
                                                            'offset' => '40',
                                                            'type' => '234'
                                                          },
                                                   '6' => {
                                                            'name' => 'acceptor',
                                                            'offset' => '48',
                                                            'type' => '11652'
                                                          },
                                                   '7' => {
                                                            'name' => 'acceptor_baton',
                                                            'offset' => '56',
                                                            'type' => '234'
                                                          },
                                                   '8' => {
                                                            'name' => 'handler',
                                                            'offset' => '64',
                                                            'type' => '11756'
                                                          },
                                                   '9' => {
                                                            'name' => 'handler_baton',
                                                            'offset' => '72',
                                                            'type' => '234'
                                                          }
                                                 },
                                       'Name' => 'struct serf_request_t',
                                       'PrivateABI' => 1,
                                       'Size' => '104',
                                       'Type' => 'Struct'
                                     },
                          '11496' => {
                                       'BaseType' => '11507',
                                       'Header' => 'serf.h',
                                       'Line' => '148',
                                       'Name' => 'serf_socket_add_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11507' => {
                                       'Name' => 'apr_status_t(*)(void*, apr_pollfd_t*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '9923'
                                                           },
                                                    '2' => {
                                                             'type' => '234'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '115277' => {
                                        'BaseType' => '12539',
                                        'Name' => 'serf_incoming_t**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '11538' => {
                                       'BaseType' => '11507',
                                       'Header' => 'serf.h',
                                       'Line' => '157',
                                       'Name' => 'serf_socket_remove_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11549' => {
                                       'BaseType' => '11560',
                                       'Header' => 'serf.h',
                                       'Line' => '227',
                                       'Name' => 'serf_progress_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11560' => {
                                       'Name' => 'void(*)(void*, apr_off_t, apr_off_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '346'
                                                           },
                                                    '2' => {
                                                             'type' => '346'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '115705' => {
                                        'BaseType' => '11937',
                                        'Name' => 'serf_listener_t**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '11587' => {
                                       'BaseType' => '11599',
                                       'Header' => 'serf.h',
                                       'Line' => '274',
                                       'Name' => 'serf_connection_setup_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11599' => {
                                       'Name' => 'apr_status_t(*)(apr_socket_t*, serf_bucket_t**, serf_bucket_t**, void*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '9796'
                                                           },
                                                    '1' => {
                                                             'type' => '11640'
                                                           },
                                                    '2' => {
                                                             'type' => '11640'
                                                           },
                                                    '3' => {
                                                             'type' => '234'
                                                           },
                                                    '4' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1162' => {
                                      'BaseType' => '1173',
                                      'Header' => 'serf.h',
                                      'Line' => '42',
                                      'Name' => 'serf_bucket_alloc_t',
                                      'Type' => 'Typedef'
                                    },
                          '11640' => {
                                       'BaseType' => '1178',
                                       'Name' => 'serf_bucket_t**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11652' => {
                                       'BaseType' => '11664',
                                       'Header' => 'serf.h',
                                       'Line' => '309',
                                       'Name' => 'serf_response_acceptor_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11664' => {
                                       'Name' => 'serf_bucket_t*(*)(serf_request_t*, serf_bucket_t*, void*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11700'
                                                           },
                                                    '1' => {
                                                             'type' => '1178'
                                                           },
                                                    '2' => {
                                                             'type' => '234'
                                                           },
                                                    '3' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '1178',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11700' => {
                                       'BaseType' => '11304',
                                       'Name' => 'serf_request_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11706' => {
                                       'BaseType' => '11718',
                                       'Header' => 'serf.h',
                                       'Line' => '327',
                                       'Name' => 'serf_connection_closed_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11718' => {
                                       'Name' => 'void(*)(serf_connection_t*, void*, apr_status_t, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11750'
                                                           },
                                                    '1' => {
                                                             'type' => '234'
                                                           },
                                                    '2' => {
                                                             'type' => '358'
                                                           },
                                                    '3' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1173' => {
                                      'Line' => '83',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'pool',
                                                           'offset' => '0',
                                                           'type' => '4575'
                                                         },
                                                  '1' => {
                                                           'name' => 'allocator',
                                                           'offset' => '8',
                                                           'type' => '47118'
                                                         },
                                                  '2' => {
                                                           'name' => 'own_allocator',
                                                           'offset' => '16',
                                                           'type' => '191'
                                                         },
                                                  '3' => {
                                                           'name' => 'unfreed',
                                                           'offset' => '24',
                                                           'type' => '46873'
                                                         },
                                                  '4' => {
                                                           'name' => 'unfreed_baton',
                                                           'offset' => '32',
                                                           'type' => '234'
                                                         },
                                                  '5' => {
                                                           'name' => 'num_alloc',
                                                           'offset' => '40',
                                                           'type' => '8507'
                                                         },
                                                  '6' => {
                                                           'name' => 'freelist',
                                                           'offset' => '48',
                                                           'type' => '47124'
                                                         },
                                                  '7' => {
                                                           'name' => 'blocks',
                                                           'offset' => '56',
                                                           'type' => '45650'
                                                         },
                                                  '8' => {
                                                           'name' => 'track',
                                                           'offset' => '64',
                                                           'type' => '47130'
                                                         }
                                                },
                                      'Name' => 'struct serf_bucket_alloc_t',
                                      'PrivateABI' => 1,
                                      'Size' => '72',
                                      'Source' => 'allocator.c',
                                      'Type' => 'Struct'
                                    },
                          '11750' => {
                                       'BaseType' => '10554',
                                       'Name' => 'serf_connection_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11756' => {
                                       'BaseType' => '11768',
                                       'Header' => 'serf.h',
                                       'Line' => '361',
                                       'Name' => 'serf_response_handler_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11768' => {
                                       'Name' => 'apr_status_t(*)(serf_request_t*, serf_bucket_t*, void*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11700'
                                                           },
                                                    '1' => {
                                                             'type' => '1178'
                                                           },
                                                    '2' => {
                                                             'type' => '234'
                                                           },
                                                    '3' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1178' => {
                                      'BaseType' => '969',
                                      'Name' => 'serf_bucket_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '11804' => {
                                       'BaseType' => '11816',
                                       'Header' => 'serf.h',
                                       'Line' => '374',
                                       'Name' => 'serf_credentials_callback_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11816' => {
                                       'Name' => 'apr_status_t(*)(char**, char**, serf_request_t*, void*, int, char const*, char const*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11872'
                                                           },
                                                    '1' => {
                                                             'type' => '11872'
                                                           },
                                                    '2' => {
                                                             'type' => '11700'
                                                           },
                                                    '3' => {
                                                             'type' => '234'
                                                           },
                                                    '4' => {
                                                             'type' => '191'
                                                           },
                                                    '5' => {
                                                             'type' => '369'
                                                           },
                                                    '6' => {
                                                             'type' => '369'
                                                           },
                                                    '7' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11872' => {
                                       'BaseType' => '236',
                                       'Name' => 'char**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11878' => {
                                       'BaseType' => '11890',
                                       'Header' => 'serf.h',
                                       'Line' => '447',
                                       'Name' => 'serf_accept_client_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11890' => {
                                       'Name' => 'apr_status_t(*)(serf_context_t*, serf_listener_t*, void*, apr_socket_t*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11931'
                                                           },
                                                    '1' => {
                                                             'type' => '11937'
                                                           },
                                                    '2' => {
                                                             'type' => '234'
                                                           },
                                                    '3' => {
                                                             'type' => '9796'
                                                           },
                                                    '4' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11931' => {
                                       'BaseType' => '10141',
                                       'Name' => 'serf_context_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11937' => {
                                       'BaseType' => '11084',
                                       'Name' => 'serf_listener_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11943' => {
                                       'BaseType' => '11955',
                                       'Header' => 'serf.h',
                                       'Line' => '463',
                                       'Name' => 'serf_incoming_request_cb_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11955' => {
                                       'Name' => 'apr_status_t(*)(serf_context_t*, serf_incoming_request_t*, void*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11931'
                                                           },
                                                    '1' => {
                                                             'type' => '11991'
                                                           },
                                                    '2' => {
                                                             'type' => '234'
                                                           },
                                                    '3' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11991' => {
                                       'BaseType' => '11288',
                                       'Name' => 'serf_incoming_request_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11997' => {
                                       'BaseType' => '12009',
                                       'Header' => 'serf.h',
                                       'Line' => '529',
                                       'Name' => 'serf_request_setup_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '12009' => {
                                       'Name' => 'apr_status_t(*)(serf_request_t*, void*, serf_bucket_t**, serf_response_acceptor_t*, void**, serf_response_handler_t*, void**, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11700'
                                                           },
                                                    '1' => {
                                                             'type' => '234'
                                                           },
                                                    '2' => {
                                                             'type' => '11640'
                                                           },
                                                    '3' => {
                                                             'type' => '12065'
                                                           },
                                                    '4' => {
                                                             'type' => '12071'
                                                           },
                                                    '5' => {
                                                             'type' => '12077'
                                                           },
                                                    '6' => {
                                                             'type' => '12071'
                                                           },
                                                    '7' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12065' => {
                                       'BaseType' => '11652',
                                       'Name' => 'serf_response_acceptor_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12071' => {
                                       'BaseType' => '234',
                                       'Name' => 'void**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12077' => {
                                       'BaseType' => '11756',
                                       'Name' => 'serf_response_handler_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1214' => {
                                      'BaseType' => '369',
                                      'Name' => 'char const**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1220' => {
                                      'BaseType' => '334',
                                      'Name' => 'apr_size_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1226' => {
                                      'Name' => 'apr_status_t(*)(serf_bucket_t*, apr_size_t, char const**, apr_size_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1178'
                                                          },
                                                   '1' => {
                                                            'type' => '334'
                                                          },
                                                   '2' => {
                                                            'type' => '1214'
                                                          },
                                                   '3' => {
                                                            'type' => '1220'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '12368' => {
                                       'BaseType' => '12379',
                                       'Header' => 'serf_private.h',
                                       'Line' => '43',
                                       'Name' => 'serf__authn_scheme_t',
                                       'Size' => '64',
                                       'Type' => 'Typedef'
                                     },
                          '12379' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '323',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'code',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'name',
                                                            'offset' => '8',
                                                            'type' => '369'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '16',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'init_ctx_func',
                                                            'offset' => '24',
                                                            'type' => '12874'
                                                          },
                                                   '4' => {
                                                            'name' => 'init_conn_func',
                                                            'offset' => '32',
                                                            'type' => '12917'
                                                          },
                                                   '5' => {
                                                            'name' => 'handle_func',
                                                            'offset' => '40',
                                                            'type' => '12811'
                                                          },
                                                   '6' => {
                                                            'name' => 'setup_request_func',
                                                            'offset' => '48',
                                                            'type' => '12960'
                                                          },
                                                   '7' => {
                                                            'name' => 'validate_response_func',
                                                            'offset' => '56',
                                                            'type' => '13018'
                                                          }
                                                 },
                                       'Name' => 'struct serf__authn_scheme_t',
                                       'PrivateABI' => 1,
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '12497' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '47',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'client',
                                                            'offset' => '0',
                                                            'type' => '12539'
                                                          },
                                                   '1' => {
                                                            'name' => 'conn',
                                                            'offset' => '0',
                                                            'type' => '11750'
                                                          },
                                                   '2' => {
                                                            'name' => 'listener',
                                                            'offset' => '0',
                                                            'type' => '11937'
                                                          }
                                                 },
                                       'Name' => 'anon-union-serf_private.h-47',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '12539' => {
                                       'BaseType' => '11192',
                                       'Name' => 'serf_incoming_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12545' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '45',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'u',
                                                            'offset' => '8',
                                                            'type' => '12497'
                                                          }
                                                 },
                                       'Name' => 'struct serf_io_baton_t',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '12580' => {
                                       'BaseType' => '12545',
                                       'Header' => 'serf_private.h',
                                       'Line' => '52',
                                       'Name' => 'serf_io_baton_t',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '12639' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '88',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'realm',
                                                            'offset' => '0',
                                                            'type' => '369'
                                                          },
                                                   '1' => {
                                                            'name' => 'scheme',
                                                            'offset' => '8',
                                                            'type' => '12688'
                                                          },
                                                   '2' => {
                                                            'name' => 'baton',
                                                            'offset' => '16',
                                                            'type' => '234'
                                                          }
                                                 },
                                       'Name' => 'struct serf__authn_info_t',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '1267' => {
                                      'Name' => 'apr_status_t(*)(serf_bucket_t*, int, int*, char const**, apr_size_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1178'
                                                          },
                                                   '1' => {
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'type' => '328'
                                                          },
                                                   '3' => {
                                                            'type' => '1214'
                                                          },
                                                   '4' => {
                                                            'type' => '1220'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '126739' => {
                                        'BaseType' => '11750',
                                        'Name' => 'serf_connection_t**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '12688' => {
                                       'BaseType' => '12694',
                                       'Name' => 'serf__authn_scheme_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12694' => {
                                       'BaseType' => '12368',
                                       'Name' => 'serf__authn_scheme_t const',
                                       'Size' => '64',
                                       'Type' => 'Const'
                                     },
                          '12699' => {
                                       'BaseType' => '12639',
                                       'Header' => 'serf_private.h',
                                       'Line' => '94',
                                       'Name' => 'serf__authn_info_t',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '12710' => {
                                       'BaseType' => '8638',
                                       'Name' => 'apr_array_header_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12749' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '156',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'SERF_CONN_INIT',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'SERF_CONN_SETUP_SSLTUNNEL',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'SERF_CONN_CONNECTED',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'SERF_CONN_CLOSING',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum serf__connection_state_t',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '12760' => {
                                       'BaseType' => '285',
                                       'Name' => 'struct iovec[1024]',
                                       'Size' => '16384',
                                       'Type' => 'Array'
                                     },
                          '12799' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '257',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PROXY',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'HOST',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum peer_t',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '128054' => {
                                        'BaseType' => '128060',
                                        'Name' => 'serf_request_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '128060' => {
                                        'BaseType' => '11304',
                                        'Name' => 'serf_request_t const',
                                        'Size' => '104',
                                        'Type' => 'Const'
                                      },
                          '12811' => {
                                       'BaseType' => '12823',
                                       'Header' => 'serf_private.h',
                                       'Line' => '265',
                                       'Name' => 'serf__auth_handler_func_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '12823' => {
                                       'Name' => 'apr_status_t(*)(int, serf_request_t*, serf_bucket_t*, char const*, char const*, void*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '191'
                                                           },
                                                    '1' => {
                                                             'type' => '11700'
                                                           },
                                                    '2' => {
                                                             'type' => '1178'
                                                           },
                                                    '3' => {
                                                             'type' => '369'
                                                           },
                                                    '4' => {
                                                             'type' => '369'
                                                           },
                                                    '5' => {
                                                             'type' => '234'
                                                           },
                                                    '6' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '128236' => {
                                        'BaseType' => '11756',
                                        'Name' => 'serf_response_handler_t const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '128241' => {
                                        'BaseType' => '18080',
                                        'Name' => 'void const**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '12874' => {
                                       'BaseType' => '12886',
                                       'Header' => 'serf_private.h',
                                       'Line' => '279',
                                       'Name' => 'serf__init_context_func_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '12886' => {
                                       'Name' => 'apr_status_t(*)(int, serf_context_t*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '191'
                                                           },
                                                    '1' => {
                                                             'type' => '11931'
                                                           },
                                                    '2' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12917' => {
                                       'BaseType' => '12929',
                                       'Header' => 'serf_private.h',
                                       'Line' => '289',
                                       'Name' => 'serf__init_conn_func_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '12929' => {
                                       'Name' => 'apr_status_t(*)(int, serf_connection_t*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '191'
                                                           },
                                                    '1' => {
                                                             'type' => '11750'
                                                           },
                                                    '2' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12960' => {
                                       'BaseType' => '12972',
                                       'Header' => 'serf_private.h',
                                       'Line' => '300',
                                       'Name' => 'serf__setup_request_func_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '12972' => {
                                       'Name' => 'apr_status_t(*)(peer_t, int, serf_connection_t*, char const*, char const*, serf_bucket_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '12799'
                                                           },
                                                    '1' => {
                                                             'type' => '191'
                                                           },
                                                    '2' => {
                                                             'type' => '11750'
                                                           },
                                                    '3' => {
                                                             'type' => '369'
                                                           },
                                                    '4' => {
                                                             'type' => '369'
                                                           },
                                                    '5' => {
                                                             'type' => '1178'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '13018' => {
                                       'BaseType' => '13030',
                                       'Header' => 'serf_private.h',
                                       'Line' => '313',
                                       'Name' => 'serf__validate_response_func_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '13030' => {
                                       'Name' => 'apr_status_t(*)(peer_t, int, serf_connection_t*, serf_request_t*, serf_bucket_t*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '12799'
                                                           },
                                                    '1' => {
                                                             'type' => '191'
                                                           },
                                                    '2' => {
                                                             'type' => '11750'
                                                           },
                                                    '3' => {
                                                             'type' => '11700'
                                                           },
                                                    '4' => {
                                                             'type' => '1178'
                                                           },
                                                    '5' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1308' => {
                                      'Name' => 'apr_status_t(*)(serf_bucket_t*, apr_size_t, int, struct iovec*, int*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1178'
                                                          },
                                                   '1' => {
                                                            'type' => '334'
                                                          },
                                                   '2' => {
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'type' => '322'
                                                          },
                                                   '4' => {
                                                            'type' => '328'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1354' => {
                                      'BaseType' => '886',
                                      'Name' => 'apr_hdtr_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1360' => {
                                      'BaseType' => '963',
                                      'Name' => 'apr_file_t**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1366' => {
                                      'BaseType' => '346',
                                      'Name' => 'apr_off_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1372' => {
                                      'Name' => 'apr_status_t(*)(serf_bucket_t*, apr_size_t, apr_hdtr_t*, apr_file_t**, apr_off_t*, apr_size_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1178'
                                                          },
                                                   '1' => {
                                                            'type' => '334'
                                                          },
                                                   '2' => {
                                                            'type' => '1354'
                                                          },
                                                   '3' => {
                                                            'type' => '1360'
                                                          },
                                                   '4' => {
                                                            'type' => '1366'
                                                          },
                                                   '5' => {
                                                            'type' => '1220'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1398' => {
                                      'BaseType' => '1404',
                                      'Name' => 'serf_bucket_type_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1404' => {
                                      'BaseType' => '1033',
                                      'Name' => 'serf_bucket_type_t const',
                                      'Size' => '64',
                                      'Type' => 'Const'
                                    },
                          '1409' => {
                                      'Name' => 'serf_bucket_t*(*)(serf_bucket_t*, serf_bucket_type_t const*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1178'
                                                          },
                                                   '1' => {
                                                            'type' => '1398'
                                                          }
                                                 },
                                      'Return' => '1178',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1440' => {
                                      'Name' => 'apr_status_t(*)(serf_bucket_t*, char const**, apr_size_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1178'
                                                          },
                                                   '1' => {
                                                            'type' => '1214'
                                                          },
                                                   '2' => {
                                                            'type' => '1220'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '14477' => {
                                       'BaseType' => '14483',
                                       'Name' => 'apr_pollfd_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14483' => {
                                       'BaseType' => '9813',
                                       'Name' => 'apr_pollfd_t const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '1457' => {
                                      'Name' => 'void(*)(serf_bucket_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1178'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1463' => {
                                      'BaseType' => '1162',
                                      'Name' => 'serf_bucket_alloc_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1469' => {
                                      'BaseType' => '1480',
                                      'Header' => 'serf_bucket_types.h',
                                      'Line' => '194',
                                      'Name' => 'serf_bucket_aggregate_eof_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1480' => {
                                      'Name' => 'apr_status_t(*)(void*, serf_bucket_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '234'
                                                          },
                                                   '1' => {
                                                            'type' => '1178'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '14831' => {
                                       'BaseType' => '11549',
                                       'Name' => 'serf_progress_t const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '149' => {
                                     'Name' => 'unsigned char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '1506' => {
                                      'BaseType' => '1518',
                                      'Header' => 'serf_bucket_types.h',
                                      'Line' => '290',
                                      'Name' => 'serf_simple_freefunc_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1518' => {
                                      'Name' => 'void(*)(void*, char const*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '234'
                                                          },
                                                   '1' => {
                                                            'type' => '369'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1540' => {
                                      'Line' => '21',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'bucket',
                                                           'offset' => '0',
                                                           'type' => '1178'
                                                         },
                                                  '1' => {
                                                           'name' => 'next',
                                                           'offset' => '8',
                                                           'type' => '1577'
                                                         }
                                                },
                                      'Name' => 'struct bucket_list',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Source' => 'aggregate_buckets.c',
                                      'Type' => 'Struct'
                                    },
                          '156' => {
                                     'Name' => 'unsigned short',
                                     'Size' => '2',
                                     'Type' => 'Intrinsic'
                                   },
                          '1577' => {
                                      'BaseType' => '1540',
                                      'Name' => 'struct bucket_list*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1583' => {
                                      'BaseType' => '1540',
                                      'Line' => '24',
                                      'Name' => 'bucket_list_t',
                                      'Size' => '16',
                                      'Source' => 'aggregate_buckets.c',
                                      'Type' => 'Typedef'
                                    },
                          '163' => {
                                     'Name' => 'unsigned int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '1675' => {
                                      'BaseType' => '1583',
                                      'Name' => 'bucket_list_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '170' => {
                                     'Name' => 'unsigned long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '17967' => {
                                       'Header' => 'serf.h',
                                       'Line' => '1013',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'SERF_LINEBUF_EMPTY',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'SERF_LINEBUF_READY',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'SERF_LINEBUF_PARTIAL',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'SERF_LINEBUF_CRLF_SPLIT',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'anon-enum-serf.h-1013',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '18051' => {
                                       'BaseType' => '242',
                                       'Name' => 'char[8000]',
                                       'Size' => '8000',
                                       'Type' => 'Array'
                                     },
                          '18068' => {
                                       'Header' => 'serf.h',
                                       'Line' => '1026',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state',
                                                            'offset' => '0',
                                                            'type' => '17967'
                                                          },
                                                   '1' => {
                                                            'name' => 'used',
                                                            'offset' => '8',
                                                            'type' => '334'
                                                          },
                                                   '2' => {
                                                            'name' => 'line',
                                                            'offset' => '16',
                                                            'type' => '18051'
                                                          }
                                                 },
                                       'Name' => 'struct serf_linebuf_t',
                                       'Size' => '8016',
                                       'Type' => 'Struct'
                                     },
                          '18080' => {
                                       'BaseType' => '18086',
                                       'Name' => 'void const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18086' => {
                                       'BaseType' => '1',
                                       'Name' => 'void const',
                                       'Type' => 'Const'
                                     },
                          '18087' => {
                                       'BaseType' => '18098',
                                       'Header' => 'serf_bucket_util.h',
                                       'Line' => '201',
                                       'Name' => 'serf_databuf_reader_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '18098' => {
                                       'Name' => 'apr_status_t(*)(void*, apr_size_t, char*, apr_size_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '334'
                                                           },
                                                    '2' => {
                                                             'type' => '236'
                                                           },
                                                    '3' => {
                                                             'type' => '1220'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18216' => {
                                       'Header' => 'serf_bucket_util.h',
                                       'Line' => '234',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'current',
                                                            'offset' => '0',
                                                            'type' => '369'
                                                          },
                                                   '1' => {
                                                            'name' => 'remaining',
                                                            'offset' => '8',
                                                            'type' => '334'
                                                          },
                                                   '2' => {
                                                            'name' => 'read',
                                                            'offset' => '16',
                                                            'type' => '18087'
                                                          },
                                                   '3' => {
                                                            'name' => 'read_baton',
                                                            'offset' => '24',
                                                            'type' => '234'
                                                          },
                                                   '4' => {
                                                            'name' => 'status',
                                                            'offset' => '32',
                                                            'type' => '358'
                                                          },
                                                   '5' => {
                                                            'name' => 'buf',
                                                            'offset' => '36',
                                                            'type' => '18051'
                                                          }
                                                 },
                                       'Name' => 'struct serf_databuf_t',
                                       'Size' => '8040',
                                       'Type' => 'Struct'
                                     },
                          '18354' => {
                                       'BaseType' => '18216',
                                       'Name' => 'serf_databuf_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '184' => {
                                     'Name' => 'short',
                                     'Size' => '2',
                                     'Type' => 'Intrinsic'
                                   },
                          '191' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '198' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '205' => {
                                     'BaseType' => '198',
                                     'Header' => 'types.h',
                                     'Line' => '131',
                                     'Name' => '__off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '20605' => {
                                       'BaseType' => '18068',
                                       'Name' => 'serf_linebuf_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '234' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '236' => {
                                     'BaseType' => '242',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '242' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '249' => {
                                     'BaseType' => '205',
                                     'Header' => 'types.h',
                                     'Line' => '86',
                                     'Name' => 'off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '260' => {
                                     'BaseType' => '170',
                                     'Header' => 'stddef.h',
                                     'Line' => '212',
                                     'Name' => 'size_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '26698' => {
                                       'BaseType' => '26709',
                                       'Header' => 'apr_mmap.h',
                                       'Line' => '51',
                                       'Name' => 'apr_mmap_t',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '26709' => {
                                       'Header' => 'apr_mmap.h',
                                       'Line' => '62',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cntxt',
                                                            'offset' => '0',
                                                            'type' => '4575'
                                                          },
                                                   '1' => {
                                                            'name' => 'mm',
                                                            'offset' => '8',
                                                            'type' => '234'
                                                          },
                                                   '2' => {
                                                            'name' => 'size',
                                                            'offset' => '16',
                                                            'type' => '334'
                                                          },
                                                   '3' => {
                                                            'name' => 'link',
                                                            'offset' => '24',
                                                            'type' => '26769'
                                                          }
                                                 },
                                       'Name' => 'struct apr_mmap_t',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '26769' => {
                                       'Header' => 'apr_mmap.h',
                                       'Line' => '85',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '26802'
                                                          },
                                                   '1' => {
                                                            'name' => 'prev',
                                                            'offset' => '8',
                                                            'type' => '26802'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-apr_mmap.h-85',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '26802' => {
                                       'BaseType' => '27999',
                                       'Name' => 'struct apr_mmap_t*volatile',
                                       'Size' => '8',
                                       'Type' => 'Volatile'
                                     },
                          '27999' => {
                                       'BaseType' => '26698',
                                       'Name' => 'apr_mmap_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '285' => {
                                     'Header' => 'uio.h',
                                     'Line' => '43',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'iov_base',
                                                          'offset' => '0',
                                                          'type' => '234'
                                                        },
                                                 '1' => {
                                                          'name' => 'iov_len',
                                                          'offset' => '8',
                                                          'type' => '260'
                                                        }
                                               },
                                     'Name' => 'struct iovec',
                                     'PrivateABI' => 1,
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '322' => {
                                     'BaseType' => '285',
                                     'Name' => 'struct iovec*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '328' => {
                                     'BaseType' => '191',
                                     'Name' => 'int*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '334' => {
                                     'BaseType' => '260',
                                     'Header' => 'apr.h',
                                     'Line' => '356',
                                     'Name' => 'apr_size_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '33897' => {
                                       'BaseType' => '170',
                                       'Header' => 'apr.h',
                                       'Line' => '353',
                                       'Name' => 'apr_uint64_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '346' => {
                                     'BaseType' => '249',
                                     'Header' => 'apr.h',
                                     'Line' => '358',
                                     'Name' => 'apr_off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '358' => {
                                     'BaseType' => '191',
                                     'Header' => 'apr_errno.h',
                                     'Line' => '44',
                                     'Name' => 'apr_status_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '369' => {
                                     'BaseType' => '375',
                                     'Name' => 'char const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '375' => {
                                     'BaseType' => '242',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '37504' => {
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '95',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'version',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'code',
                                                            'offset' => '4',
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'name' => 'reason',
                                                            'offset' => '8',
                                                            'type' => '369'
                                                          }
                                                 },
                                       'Name' => 'struct serf_status_line',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '380' => {
                                     'Name' => 'struct apr_file_t',
                                     'PrivateABI' => 1,
                                     'Type' => 'Struct'
                                   },
                          '39918' => {
                                       'BaseType' => '37504',
                                       'Name' => 'serf_status_line*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '41357' => {
                                       'Name' => 'int()(void*, char const*, char const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '369'
                                                           },
                                                    '2' => {
                                                             'type' => '369'
                                                           }
                                                  },
                                       'Return' => '191',
                                       'Type' => 'Func'
                                     },
                          '42471' => {
                                       'BaseType' => '41357',
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '410',
                                       'Name' => 'serf_bucket_headers_do_callback_fn_t',
                                       'Type' => 'Typedef'
                                     },
                          '44997' => {
                                       'BaseType' => '42471',
                                       'Name' => 'serf_bucket_headers_do_callback_fn_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '4501' => {
                                      'BaseType' => '198',
                                      'Header' => 'apr.h',
                                      'Line' => '352',
                                      'Name' => 'apr_int64_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '45538' => {
                                       'BaseType' => '45549',
                                       'Header' => 'apr_allocator.h',
                                       'Line' => '41',
                                       'Name' => 'apr_allocator_t',
                                       'Type' => 'Typedef'
                                     },
                          '45549' => {
                                       'Name' => 'struct apr_allocator_t',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '45554' => {
                                       'BaseType' => '45565',
                                       'Header' => 'apr_allocator.h',
                                       'Line' => '43',
                                       'Name' => 'apr_memnode_t',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '45565' => {
                                       'Header' => 'apr_allocator.h',
                                       'Line' => '54',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '45650'
                                                          },
                                                   '1' => {
                                                            'name' => 'ref',
                                                            'offset' => '8',
                                                            'type' => '45656'
                                                          },
                                                   '2' => {
                                                            'name' => 'index',
                                                            'offset' => '16',
                                                            'type' => '8507'
                                                          },
                                                   '3' => {
                                                            'name' => 'free_index',
                                                            'offset' => '20',
                                                            'type' => '8507'
                                                          },
                                                   '4' => {
                                                            'name' => 'first_avail',
                                                            'offset' => '24',
                                                            'type' => '236'
                                                          },
                                                   '5' => {
                                                            'name' => 'endp',
                                                            'offset' => '32',
                                                            'type' => '236'
                                                          }
                                                 },
                                       'Name' => 'struct apr_memnode_t',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '4559' => {
                                      'BaseType' => '4570',
                                      'Header' => 'apr_pools.h',
                                      'Line' => '60',
                                      'Name' => 'apr_pool_t',
                                      'Type' => 'Typedef'
                                    },
                          '45650' => {
                                       'BaseType' => '45554',
                                       'Name' => 'apr_memnode_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '45656' => {
                                       'BaseType' => '45650',
                                       'Name' => 'apr_memnode_t**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '4570' => {
                                      'Name' => 'struct apr_pool_t',
                                      'PrivateABI' => 1,
                                      'Type' => 'Struct'
                                    },
                          '4575' => {
                                      'BaseType' => '4559',
                                      'Name' => 'apr_pool_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '46873' => {
                                       'BaseType' => '46885',
                                       'Header' => 'serf.h',
                                       'Line' => '958',
                                       'Name' => 'serf_unfreed_func_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '46885' => {
                                       'Name' => 'void(*)(void*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '234'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '46907' => {
                                       'Line' => '26',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '47124'
                                                          },
                                                   '1' => {
                                                            'name' => 'memnode',
                                                            'offset' => '0',
                                                            'type' => '45650'
                                                          }
                                                 },
                                       'Name' => 'anon-union-allocator.c-26',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Source' => 'allocator.c',
                                       'Type' => 'Union'
                                     },
                          '46938' => {
                                       'Line' => '24',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'size',
                                                            'offset' => '0',
                                                            'type' => '334'
                                                          },
                                                   '1' => {
                                                            'name' => 'u',
                                                            'offset' => '8',
                                                            'type' => '46907'
                                                          }
                                                 },
                                       'Name' => 'struct node_header_t',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Source' => 'allocator.c',
                                       'Type' => 'Struct'
                                     },
                          '46979' => {
                                       'BaseType' => '46938',
                                       'Line' => '31',
                                       'Name' => 'node_header_t',
                                       'Size' => '16',
                                       'Source' => 'allocator.c',
                                       'Type' => 'Typedef'
                                     },
                          '47023' => {
                                       'BaseType' => '47029',
                                       'Name' => 'serf_bucket_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '47029' => {
                                       'BaseType' => '969',
                                       'Name' => 'serf_bucket_t const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '47034' => {
                                       'Line' => '71',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'bucket',
                                                            'offset' => '0',
                                                            'type' => '47023'
                                                          },
                                                   '1' => {
                                                            'name' => 'last',
                                                            'offset' => '8',
                                                            'type' => '358'
                                                          }
                                                 },
                                       'Name' => 'struct read_status_t',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Source' => 'allocator.c',
                                       'Type' => 'Struct'
                                     },
                          '47091' => {
                                       'BaseType' => '47034',
                                       'Name' => 'read_status_t[100]',
                                       'Size' => '1600',
                                       'Type' => 'Array'
                                     },
                          '47107' => {
                                       'Line' => '80',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next_index',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'num_used',
                                                            'offset' => '4',
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'name' => 'info',
                                                            'offset' => '8',
                                                            'type' => '47091'
                                                          }
                                                 },
                                       'Name' => 'struct track_state_t',
                                       'PrivateABI' => 1,
                                       'Size' => '1608',
                                       'Source' => 'allocator.c',
                                       'Type' => 'Struct'
                                     },
                          '47118' => {
                                       'BaseType' => '45538',
                                       'Name' => 'apr_allocator_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '47124' => {
                                       'BaseType' => '46979',
                                       'Name' => 'node_header_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '47130' => {
                                       'BaseType' => '47107',
                                       'Name' => 'track_state_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '51391' => {
                                       'BaseType' => '149',
                                       'Name' => 'unsigned char*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '56700' => {
                                       'BaseType' => '198',
                                       'Header' => 'types.h',
                                       'Line' => '139',
                                       'Name' => '__time_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '56711' => {
                                       'BaseType' => '198',
                                       'Header' => 'types.h',
                                       'Line' => '141',
                                       'Name' => '__suseconds_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '56770' => {
                                       'BaseType' => '56700',
                                       'Header' => 'time.h',
                                       'Line' => '75',
                                       'Name' => 'time_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '56792' => {
                                       'Header' => 'time.h',
                                       'Line' => '30',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tv_sec',
                                                            'offset' => '0',
                                                            'type' => '56700'
                                                          },
                                                   '1' => {
                                                            'name' => 'tv_usec',
                                                            'offset' => '8',
                                                            'type' => '56711'
                                                          }
                                                 },
                                       'Name' => 'struct timeval',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '56898' => {
                                       'Name' => 'void(*)()',
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '58408' => {
                                       'BaseType' => '58419',
                                       'Header' => 'apr_hash.h',
                                       'Line' => '52',
                                       'Name' => 'apr_hash_t',
                                       'Type' => 'Typedef'
                                     },
                          '58419' => {
                                       'Name' => 'struct apr_hash_t',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '58431' => {
                                       'BaseType' => '58443',
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '491',
                                       'Name' => 'serf_ssl_context_t',
                                       'Size' => '16328',
                                       'Type' => 'Typedef'
                                     },
                          '58443' => {
                                       'Line' => '141',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'refcount',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'pool',
                                                            'offset' => '8',
                                                            'type' => '4575'
                                                          },
                                                   '10' => {
                                                             'name' => 'cert_cache_pool',
                                                             'offset' => '16224',
                                                             'type' => '4575'
                                                           },
                                                   '11' => {
                                                             'name' => 'cert_file_success',
                                                             'offset' => '16232',
                                                             'type' => '369'
                                                           },
                                                   '12' => {
                                                             'name' => 'cert_pw_callback',
                                                             'offset' => '16240',
                                                             'type' => '58849'
                                                           },
                                                   '13' => {
                                                             'name' => 'cert_pw_userdata',
                                                             'offset' => '16248',
                                                             'type' => '234'
                                                           },
                                                   '14' => {
                                                             'name' => 'cert_pw_cache_pool',
                                                             'offset' => '16256',
                                                             'type' => '4575'
                                                           },
                                                   '15' => {
                                                             'name' => 'cert_pw_success',
                                                             'offset' => '16264',
                                                             'type' => '369'
                                                           },
                                                   '16' => {
                                                             'name' => 'server_cert_callback',
                                                             'offset' => '16272',
                                                             'type' => '58892'
                                                           },
                                                   '17' => {
                                                             'name' => 'server_cert_chain_callback',
                                                             'offset' => '16280',
                                                             'type' => '58946'
                                                           },
                                                   '18' => {
                                                             'name' => 'server_cert_userdata',
                                                             'offset' => '16288',
                                                             'type' => '234'
                                                           },
                                                   '19' => {
                                                             'name' => 'cert_path',
                                                             'offset' => '16296',
                                                             'type' => '369'
                                                           },
                                                   '2' => {
                                                            'name' => 'allocator',
                                                            'offset' => '16',
                                                            'type' => '1463'
                                                          },
                                                   '20' => {
                                                             'name' => 'cached_cert',
                                                             'offset' => '16304',
                                                             'type' => '67848'
                                                           },
                                                   '21' => {
                                                             'name' => 'cached_cert_pw',
                                                             'offset' => '16312',
                                                             'type' => '69479'
                                                           },
                                                   '22' => {
                                                             'name' => 'pending_err',
                                                             'offset' => '16320',
                                                             'type' => '358'
                                                           },
                                                   '23' => {
                                                             'name' => 'fatal_err',
                                                             'offset' => '16324',
                                                             'type' => '358'
                                                           },
                                                   '3' => {
                                                            'name' => 'ctx',
                                                            'offset' => '24',
                                                            'type' => '73327'
                                                          },
                                                   '4' => {
                                                            'name' => 'ssl',
                                                            'offset' => '32',
                                                            'type' => '72956'
                                                          },
                                                   '5' => {
                                                            'name' => 'bio',
                                                            'offset' => '40',
                                                            'type' => '66751'
                                                          },
                                                   '6' => {
                                                            'name' => 'encrypt',
                                                            'offset' => '48',
                                                            'type' => '78451'
                                                          },
                                                   '7' => {
                                                            'name' => 'decrypt',
                                                            'offset' => '8128',
                                                            'type' => '78451'
                                                          },
                                                   '8' => {
                                                            'name' => 'cert_callback',
                                                            'offset' => '16208',
                                                            'type' => '58811'
                                                          },
                                                   '9' => {
                                                            'name' => 'cert_userdata',
                                                            'offset' => '16216',
                                                            'type' => '234'
                                                          }
                                                 },
                                       'Name' => 'struct serf_ssl_context_t',
                                       'PrivateABI' => 1,
                                       'Size' => '16328',
                                       'Source' => 'ssl_buckets.c',
                                       'Type' => 'Struct'
                                     },
                          '58762' => {
                                       'BaseType' => '58774',
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '492',
                                       'Name' => 'serf_ssl_certificate_t',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '58774' => {
                                       'Line' => '199',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ssl_cert',
                                                            'offset' => '0',
                                                            'type' => '67848'
                                                          },
                                                   '1' => {
                                                            'name' => 'depth',
                                                            'offset' => '8',
                                                            'type' => '191'
                                                          }
                                                 },
                                       'Name' => 'struct serf_ssl_certificate_t',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Source' => 'ssl_buckets.c',
                                       'Type' => 'Struct'
                                     },
                          '58811' => {
                                       'BaseType' => '58823',
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '494',
                                       'Name' => 'serf_ssl_need_client_cert_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '58823' => {
                                       'Name' => 'apr_status_t(*)(void*, char const**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '1214'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '58849' => {
                                       'BaseType' => '58861',
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '498',
                                       'Name' => 'serf_ssl_need_cert_password_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '58861' => {
                                       'Name' => 'apr_status_t(*)(void*, char const*, char const**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '369'
                                                           },
                                                    '2' => {
                                                             'type' => '1214'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '58892' => {
                                       'BaseType' => '58904',
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '503',
                                       'Name' => 'serf_ssl_need_server_cert_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '58904' => {
                                       'Name' => 'apr_status_t(*)(void*, int, serf_ssl_certificate_t const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '191'
                                                           },
                                                    '2' => {
                                                             'type' => '58935'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '58935' => {
                                       'BaseType' => '58941',
                                       'Name' => 'serf_ssl_certificate_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '58941' => {
                                       'BaseType' => '58762',
                                       'Name' => 'serf_ssl_certificate_t const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '58946' => {
                                       'BaseType' => '58958',
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '508',
                                       'Name' => 'serf_ssl_server_cert_chain_cb_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '58958' => {
                                       'Name' => 'apr_status_t(*)(void*, int, int, serf_ssl_certificate_t const*const*, apr_size_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '191'
                                                           },
                                                    '2' => {
                                                             'type' => '191'
                                                           },
                                                    '3' => {
                                                             'type' => '58999'
                                                           },
                                                    '4' => {
                                                             'type' => '334'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '58999' => {
                                       'BaseType' => '59005',
                                       'Name' => 'serf_ssl_certificate_t const*const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '59005' => {
                                       'BaseType' => '58935',
                                       'Name' => 'serf_ssl_certificate_t const*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '59156' => {
                                       'Name' => 'int(*)(void const*, void const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '18080'
                                                           },
                                                    '1' => {
                                                             'type' => '18080'
                                                           }
                                                  },
                                       'Return' => '191',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '59182' => {
                                       'Header' => 'stack.h',
                                       'Line' => '66',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'num',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'data',
                                                            'offset' => '8',
                                                            'type' => '11872'
                                                          },
                                                   '2' => {
                                                            'name' => 'sorted',
                                                            'offset' => '16',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'num_alloc',
                                                            'offset' => '20',
                                                            'type' => '191'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp',
                                                            'offset' => '24',
                                                            'type' => '59156'
                                                          }
                                                 },
                                       'Name' => 'struct stack_st',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '59255' => {
                                       'BaseType' => '59182',
                                       'Header' => 'stack.h',
                                       'Line' => '72',
                                       'Name' => '_STACK',
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '59266' => {
                                       'BaseType' => '59277',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '83',
                                       'Name' => 'ASN1_INTEGER',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59277' => {
                                       'Header' => 'asn1.h',
                                       'Line' => '239',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'length',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'type',
                                                            'offset' => '4',
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'name' => 'data',
                                                            'offset' => '8',
                                                            'type' => '51391'
                                                          },
                                                   '3' => {
                                                            'name' => 'flags',
                                                            'offset' => '16',
                                                            'type' => '198'
                                                          }
                                                 },
                                       'Name' => 'struct asn1_string_st',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '59338' => {
                                       'BaseType' => '59277',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '84',
                                       'Name' => 'ASN1_ENUMERATED',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59349' => {
                                       'BaseType' => '59277',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '85',
                                       'Name' => 'ASN1_BIT_STRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59360' => {
                                       'BaseType' => '59277',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '86',
                                       'Name' => 'ASN1_OCTET_STRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59371' => {
                                       'BaseType' => '59277',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '87',
                                       'Name' => 'ASN1_PRINTABLESTRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59382' => {
                                       'BaseType' => '59277',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '88',
                                       'Name' => 'ASN1_T61STRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59393' => {
                                       'BaseType' => '59277',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '89',
                                       'Name' => 'ASN1_IA5STRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59404' => {
                                       'BaseType' => '59277',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '90',
                                       'Name' => 'ASN1_GENERALSTRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59415' => {
                                       'BaseType' => '59277',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '91',
                                       'Name' => 'ASN1_UNIVERSALSTRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59426' => {
                                       'BaseType' => '59277',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '92',
                                       'Name' => 'ASN1_BMPSTRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59437' => {
                                       'BaseType' => '59277',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '93',
                                       'Name' => 'ASN1_UTCTIME',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59448' => {
                                       'BaseType' => '59277',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '94',
                                       'Name' => 'ASN1_TIME',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59459' => {
                                       'BaseType' => '59277',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '95',
                                       'Name' => 'ASN1_GENERALIZEDTIME',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59470' => {
                                       'BaseType' => '59277',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '96',
                                       'Name' => 'ASN1_VISIBLESTRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59481' => {
                                       'BaseType' => '59277',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '97',
                                       'Name' => 'ASN1_UTF8STRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59492' => {
                                       'BaseType' => '59277',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '98',
                                       'Name' => 'ASN1_STRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59503' => {
                                       'BaseType' => '191',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '99',
                                       'Name' => 'ASN1_BOOLEAN',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '59514' => {
                                       'BaseType' => '59525',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '103',
                                       'Name' => 'ASN1_OBJECT',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '59525' => {
                                       'Header' => 'asn1.h',
                                       'Line' => '210',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sn',
                                                            'offset' => '0',
                                                            'type' => '369'
                                                          },
                                                   '1' => {
                                                            'name' => 'ln',
                                                            'offset' => '8',
                                                            'type' => '369'
                                                          },
                                                   '2' => {
                                                            'name' => 'nid',
                                                            'offset' => '16',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'length',
                                                            'offset' => '20',
                                                            'type' => '191'
                                                          },
                                                   '4' => {
                                                            'name' => 'data',
                                                            'offset' => '24',
                                                            'type' => '67333'
                                                          },
                                                   '5' => {
                                                            'name' => 'flags',
                                                            'offset' => '32',
                                                            'type' => '191'
                                                          }
                                                 },
                                       'Name' => 'struct asn1_object_st',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '59608' => {
                                       'BaseType' => '59619',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '120',
                                       'Name' => 'BIGNUM',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59619' => {
                                       'Header' => 'bn.h',
                                       'Line' => '313',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'd',
                                                            'offset' => '0',
                                                            'type' => '67188'
                                                          },
                                                   '1' => {
                                                            'name' => 'top',
                                                            'offset' => '8',
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'name' => 'dmax',
                                                            'offset' => '12',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'neg',
                                                            'offset' => '16',
                                                            'type' => '191'
                                                          },
                                                   '4' => {
                                                            'name' => 'flags',
                                                            'offset' => '20',
                                                            'type' => '191'
                                                          }
                                                 },
                                       'Name' => 'struct bignum_st',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '59696' => {
                                       'BaseType' => '59707',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '121',
                                       'Name' => 'BN_CTX',
                                       'Type' => 'Typedef'
                                     },
                          '59707' => {
                                       'Name' => 'struct bignum_ctx',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '59712' => {
                                       'BaseType' => '59723',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '122',
                                       'Name' => 'BN_BLINDING',
                                       'Type' => 'Typedef'
                                     },
                          '59723' => {
                                       'Name' => 'struct bn_blinding_st',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '59728' => {
                                       'BaseType' => '59739',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '123',
                                       'Name' => 'BN_MONT_CTX',
                                       'Size' => '104',
                                       'Type' => 'Typedef'
                                     },
                          '59739' => {
                                       'Header' => 'bn.h',
                                       'Line' => '324',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ri',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'RR',
                                                            'offset' => '8',
                                                            'type' => '59608'
                                                          },
                                                   '2' => {
                                                            'name' => 'N',
                                                            'offset' => '32',
                                                            'type' => '59608'
                                                          },
                                                   '3' => {
                                                            'name' => 'Ni',
                                                            'offset' => '56',
                                                            'type' => '59608'
                                                          },
                                                   '4' => {
                                                            'name' => 'n0',
                                                            'offset' => '80',
                                                            'type' => '67194'
                                                          },
                                                   '5' => {
                                                            'name' => 'flags',
                                                            'offset' => '96',
                                                            'type' => '191'
                                                          }
                                                 },
                                       'Name' => 'struct bn_mont_ctx_st',
                                       'PrivateABI' => 1,
                                       'Size' => '104',
                                       'Type' => 'Struct'
                                     },
                          '59825' => {
                                       'BaseType' => '59836',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '125',
                                       'Name' => 'BN_GENCB',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59836' => {
                                       'Header' => 'bn.h',
                                       'Line' => '349',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ver',
                                                            'offset' => '0',
                                                            'type' => '163'
                                                          },
                                                   '1' => {
                                                            'name' => 'arg',
                                                            'offset' => '8',
                                                            'type' => '234'
                                                          },
                                                   '2' => {
                                                            'name' => 'cb',
                                                            'offset' => '16',
                                                            'type' => '67210'
                                                          }
                                                 },
                                       'Name' => 'struct bn_gencb_st',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '59888' => {
                                       'BaseType' => '59899',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '127',
                                       'Name' => 'BUF_MEM',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59899' => {
                                       'Header' => 'buffer.h',
                                       'Line' => '77',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'length',
                                                            'offset' => '0',
                                                            'type' => '260'
                                                          },
                                                   '1' => {
                                                            'name' => 'data',
                                                            'offset' => '8',
                                                            'type' => '236'
                                                          },
                                                   '2' => {
                                                            'name' => 'max',
                                                            'offset' => '16',
                                                            'type' => '260'
                                                          }
                                                 },
                                       'Name' => 'struct buf_mem_st',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '59948' => {
                                       'BaseType' => '59959',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '129',
                                       'Name' => 'EVP_CIPHER',
                                       'Size' => '88',
                                       'Type' => 'Typedef'
                                     },
                          '59959' => {
                                       'Header' => 'evp.h',
                                       'Line' => '311',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'nid',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'block_size',
                                                            'offset' => '4',
                                                            'type' => '191'
                                                          },
                                                   '10' => {
                                                             'name' => 'get_asn1_parameters',
                                                             'offset' => '64',
                                                             'type' => '68433'
                                                           },
                                                   '11' => {
                                                             'name' => 'ctrl',
                                                             'offset' => '72',
                                                             'type' => '68469'
                                                           },
                                                   '12' => {
                                                             'name' => 'app_data',
                                                             'offset' => '80',
                                                             'type' => '234'
                                                           },
                                                   '2' => {
                                                            'name' => 'key_len',
                                                            'offset' => '8',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'iv_len',
                                                            'offset' => '12',
                                                            'type' => '191'
                                                          },
                                                   '4' => {
                                                            'name' => 'flags',
                                                            'offset' => '16',
                                                            'type' => '170'
                                                          },
                                                   '5' => {
                                                            'name' => 'init',
                                                            'offset' => '24',
                                                            'type' => '68344'
                                                          },
                                                   '6' => {
                                                            'name' => 'do_cipher',
                                                            'offset' => '32',
                                                            'type' => '68380'
                                                          },
                                                   '7' => {
                                                            'name' => 'cleanup',
                                                            'offset' => '40',
                                                            'type' => '68401'
                                                          },
                                                   '8' => {
                                                            'name' => 'ctx_size',
                                                            'offset' => '48',
                                                            'type' => '191'
                                                          },
                                                   '9' => {
                                                            'name' => 'set_asn1_parameters',
                                                            'offset' => '56',
                                                            'type' => '68433'
                                                          }
                                                 },
                                       'Name' => 'struct evp_cipher_st',
                                       'PrivateABI' => 1,
                                       'Size' => '88',
                                       'Type' => 'Struct'
                                     },
                          '60142' => {
                                       'BaseType' => '60153',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '130',
                                       'Name' => 'EVP_CIPHER_CTX',
                                       'Size' => '168',
                                       'Type' => 'Typedef'
                                     },
                          '60153' => {
                                       'Header' => 'evp.h',
                                       'Line' => '452',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cipher',
                                                            'offset' => '0',
                                                            'type' => '68475'
                                                          },
                                                   '1' => {
                                                            'name' => 'engine',
                                                            'offset' => '8',
                                                            'type' => '67983'
                                                          },
                                                   '10' => {
                                                             'name' => 'flags',
                                                             'offset' => '112',
                                                             'type' => '170'
                                                           },
                                                   '11' => {
                                                             'name' => 'cipher_data',
                                                             'offset' => '120',
                                                             'type' => '234'
                                                           },
                                                   '12' => {
                                                             'name' => 'final_used',
                                                             'offset' => '128',
                                                             'type' => '191'
                                                           },
                                                   '13' => {
                                                             'name' => 'block_mask',
                                                             'offset' => '132',
                                                             'type' => '191'
                                                           },
                                                   '14' => {
                                                             'name' => 'final',
                                                             'offset' => '136',
                                                             'type' => '68502'
                                                           },
                                                   '2' => {
                                                            'name' => 'encrypt',
                                                            'offset' => '16',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'buf_len',
                                                            'offset' => '20',
                                                            'type' => '191'
                                                          },
                                                   '4' => {
                                                            'name' => 'oiv',
                                                            'offset' => '24',
                                                            'type' => '68486'
                                                          },
                                                   '5' => {
                                                            'name' => 'iv',
                                                            'offset' => '40',
                                                            'type' => '68486'
                                                          },
                                                   '6' => {
                                                            'name' => 'buf',
                                                            'offset' => '56',
                                                            'type' => '68502'
                                                          },
                                                   '7' => {
                                                            'name' => 'num',
                                                            'offset' => '88',
                                                            'type' => '191'
                                                          },
                                                   '8' => {
                                                            'name' => 'app_data',
                                                            'offset' => '96',
                                                            'type' => '234'
                                                          },
                                                   '9' => {
                                                            'name' => 'key_len',
                                                            'offset' => '104',
                                                            'type' => '191'
                                                          }
                                                 },
                                       'Name' => 'struct evp_cipher_ctx_st',
                                       'PrivateABI' => 1,
                                       'Size' => '168',
                                       'Type' => 'Struct'
                                     },
                          '60361' => {
                                       'BaseType' => '60372',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '131',
                                       'Name' => 'EVP_MD',
                                       'Size' => '120',
                                       'Type' => 'Typedef'
                                     },
                          '60372' => {
                                       'Header' => 'evp.h',
                                       'Line' => '164',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'pkey_type',
                                                            'offset' => '4',
                                                            'type' => '191'
                                                          },
                                                   '10' => {
                                                             'name' => 'verify',
                                                             'offset' => '72',
                                                             'type' => '68233'
                                                           },
                                                   '11' => {
                                                             'name' => 'required_pkey_type',
                                                             'offset' => '80',
                                                             'type' => '68239'
                                                           },
                                                   '12' => {
                                                             'name' => 'block_size',
                                                             'offset' => '100',
                                                             'type' => '191'
                                                           },
                                                   '13' => {
                                                             'name' => 'ctx_size',
                                                             'offset' => '104',
                                                             'type' => '191'
                                                           },
                                                   '14' => {
                                                             'name' => 'md_ctrl',
                                                             'offset' => '112',
                                                             'type' => '68285'
                                                           },
                                                   '2' => {
                                                            'name' => 'md_size',
                                                            'offset' => '8',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'flags',
                                                            'offset' => '16',
                                                            'type' => '170'
                                                          },
                                                   '4' => {
                                                            'name' => 'init',
                                                            'offset' => '24',
                                                            'type' => '68041'
                                                          },
                                                   '5' => {
                                                            'name' => 'update',
                                                            'offset' => '32',
                                                            'type' => '68072'
                                                          },
                                                   '6' => {
                                                            'name' => 'final',
                                                            'offset' => '40',
                                                            'type' => '68098'
                                                          },
                                                   '7' => {
                                                            'name' => 'copy',
                                                            'offset' => '48',
                                                            'type' => '68135'
                                                          },
                                                   '8' => {
                                                            'name' => 'cleanup',
                                                            'offset' => '56',
                                                            'type' => '68041'
                                                          },
                                                   '9' => {
                                                            'name' => 'sign',
                                                            'offset' => '64',
                                                            'type' => '68187'
                                                          }
                                                 },
                                       'Name' => 'struct env_md_st',
                                       'PrivateABI' => 1,
                                       'Size' => '120',
                                       'Type' => 'Struct'
                                     },
                          '60565' => {
                                       'BaseType' => '60576',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '132',
                                       'Name' => 'EVP_MD_CTX',
                                       'Size' => '48',
                                       'Type' => 'Typedef'
                                     },
                          '60576' => {
                                       'Header' => 'evp.h',
                                       'Line' => '272',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'digest',
                                                            'offset' => '0',
                                                            'type' => '68291'
                                                          },
                                                   '1' => {
                                                            'name' => 'engine',
                                                            'offset' => '8',
                                                            'type' => '67983'
                                                          },
                                                   '2' => {
                                                            'name' => 'flags',
                                                            'offset' => '16',
                                                            'type' => '170'
                                                          },
                                                   '3' => {
                                                            'name' => 'md_data',
                                                            'offset' => '24',
                                                            'type' => '234'
                                                          },
                                                   '4' => {
                                                            'name' => 'pctx',
                                                            'offset' => '32',
                                                            'type' => '68302'
                                                          },
                                                   '5' => {
                                                            'name' => 'update',
                                                            'offset' => '40',
                                                            'type' => '68072'
                                                          }
                                                 },
                                       'Name' => 'struct env_md_ctx_st',
                                       'PrivateABI' => 1,
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '60668' => {
                                       'BaseType' => '60679',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '133',
                                       'Name' => 'EVP_PKEY',
                                       'Size' => '56',
                                       'Type' => 'Typedef'
                                     },
                          '60679' => {
                                       'Header' => 'evp.h',
                                       'Line' => '133',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'save_type',
                                                            'offset' => '4',
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'name' => 'references',
                                                            'offset' => '8',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'ameth',
                                                            'offset' => '16',
                                                            'type' => '67972'
                                                          },
                                                   '4' => {
                                                            'name' => 'engine',
                                                            'offset' => '24',
                                                            'type' => '67983'
                                                          },
                                                   '5' => {
                                                            'name' => 'pkey',
                                                            'offset' => '32',
                                                            'type' => '67881'
                                                          },
                                                   '6' => {
                                                            'name' => 'save_parameters',
                                                            'offset' => '40',
                                                            'type' => '191'
                                                          },
                                                   '7' => {
                                                            'name' => 'attributes',
                                                            'offset' => '48',
                                                            'type' => '68014'
                                                          }
                                                 },
                                       'Name' => 'struct evp_pkey_st',
                                       'PrivateABI' => 1,
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '60788' => {
                                       'BaseType' => '60799',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '135',
                                       'Name' => 'EVP_PKEY_ASN1_METHOD',
                                       'Type' => 'Typedef'
                                     },
                          '60799' => {
                                       'Name' => 'struct evp_pkey_asn1_method_st',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '60804' => {
                                       'BaseType' => '60815',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '138',
                                       'Name' => 'EVP_PKEY_CTX',
                                       'Type' => 'Typedef'
                                     },
                          '60815' => {
                                       'Name' => 'struct evp_pkey_ctx_st',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '60820' => {
                                       'BaseType' => '60830',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '140',
                                       'Name' => 'DH',
                                       'Size' => '144',
                                       'Type' => 'Typedef'
                                     },
                          '60830' => {
                                       'Header' => 'dh.h',
                                       'Line' => '138',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pad',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '4',
                                                            'type' => '191'
                                                          },
                                                   '10' => {
                                                             'name' => 'j',
                                                             'offset' => '72',
                                                             'type' => '68530'
                                                           },
                                                   '11' => {
                                                             'name' => 'seed',
                                                             'offset' => '80',
                                                             'type' => '51391'
                                                           },
                                                   '12' => {
                                                             'name' => 'seedlen',
                                                             'offset' => '88',
                                                             'type' => '191'
                                                           },
                                                   '13' => {
                                                             'name' => 'counter',
                                                             'offset' => '96',
                                                             'type' => '68530'
                                                           },
                                                   '14' => {
                                                             'name' => 'references',
                                                             'offset' => '104',
                                                             'type' => '191'
                                                           },
                                                   '15' => {
                                                             'name' => 'ex_data',
                                                             'offset' => '112',
                                                             'type' => '66192'
                                                           },
                                                   '16' => {
                                                             'name' => 'meth',
                                                             'offset' => '128',
                                                             'type' => '69027'
                                                           },
                                                   '17' => {
                                                             'name' => 'engine',
                                                             'offset' => '136',
                                                             'type' => '67983'
                                                           },
                                                   '2' => {
                                                            'name' => 'p',
                                                            'offset' => '8',
                                                            'type' => '68530'
                                                          },
                                                   '3' => {
                                                            'name' => 'g',
                                                            'offset' => '16',
                                                            'type' => '68530'
                                                          },
                                                   '4' => {
                                                            'name' => 'length',
                                                            'offset' => '24',
                                                            'type' => '198'
                                                          },
                                                   '5' => {
                                                            'name' => 'pub_key',
                                                            'offset' => '32',
                                                            'type' => '68530'
                                                          },
                                                   '6' => {
                                                            'name' => 'priv_key',
                                                            'offset' => '40',
                                                            'type' => '68530'
                                                          },
                                                   '7' => {
                                                            'name' => 'flags',
                                                            'offset' => '48',
                                                            'type' => '191'
                                                          },
                                                   '8' => {
                                                            'name' => 'method_mont_p',
                                                            'offset' => '56',
                                                            'type' => '68676'
                                                          },
                                                   '9' => {
                                                            'name' => 'q',
                                                            'offset' => '64',
                                                            'type' => '68530'
                                                          }
                                                 },
                                       'Name' => 'struct dh_st',
                                       'PrivateABI' => 1,
                                       'Size' => '144',
                                       'Type' => 'Struct'
                                     },
                          '61051' => {
                                       'BaseType' => '61062',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '141',
                                       'Name' => 'DH_METHOD',
                                       'Size' => '72',
                                       'Type' => 'Typedef'
                                     },
                          '61062' => {
                                       'Header' => 'dh.h',
                                       'Line' => '120',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '369'
                                                          },
                                                   '1' => {
                                                            'name' => 'generate_key',
                                                            'offset' => '8',
                                                            'type' => '68892'
                                                          },
                                                   '2' => {
                                                            'name' => 'compute_key',
                                                            'offset' => '16',
                                                            'type' => '68923'
                                                          },
                                                   '3' => {
                                                            'name' => 'bn_mod_exp',
                                                            'offset' => '24',
                                                            'type' => '68985'
                                                          },
                                                   '4' => {
                                                            'name' => 'init',
                                                            'offset' => '32',
                                                            'type' => '68892'
                                                          },
                                                   '5' => {
                                                            'name' => 'finish',
                                                            'offset' => '40',
                                                            'type' => '68892'
                                                          },
                                                   '6' => {
                                                            'name' => 'flags',
                                                            'offset' => '48',
                                                            'type' => '191'
                                                          },
                                                   '7' => {
                                                            'name' => 'app_data',
                                                            'offset' => '56',
                                                            'type' => '236'
                                                          },
                                                   '8' => {
                                                            'name' => 'generate_params',
                                                            'offset' => '64',
                                                            'type' => '69021'
                                                          }
                                                 },
                                       'Name' => 'struct dh_method',
                                       'PrivateABI' => 1,
                                       'Size' => '72',
                                       'Type' => 'Struct'
                                     },
                          '61183' => {
                                       'BaseType' => '61194',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '143',
                                       'Name' => 'DSA',
                                       'Size' => '136',
                                       'Type' => 'Typedef'
                                     },
                          '61194' => {
                                       'Header' => 'dsa.h',
                                       'Line' => '158',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pad',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '8',
                                                            'type' => '198'
                                                          },
                                                   '10' => {
                                                             'name' => 'flags',
                                                             'offset' => '80',
                                                             'type' => '191'
                                                           },
                                                   '11' => {
                                                             'name' => 'method_mont_p',
                                                             'offset' => '88',
                                                             'type' => '68676'
                                                           },
                                                   '12' => {
                                                             'name' => 'references',
                                                             'offset' => '96',
                                                             'type' => '191'
                                                           },
                                                   '13' => {
                                                             'name' => 'ex_data',
                                                             'offset' => '104',
                                                             'type' => '66192'
                                                           },
                                                   '14' => {
                                                             'name' => 'meth',
                                                             'offset' => '120',
                                                             'type' => '69387'
                                                           },
                                                   '15' => {
                                                             'name' => 'engine',
                                                             'offset' => '128',
                                                             'type' => '67983'
                                                           },
                                                   '2' => {
                                                            'name' => 'write_params',
                                                            'offset' => '16',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'p',
                                                            'offset' => '24',
                                                            'type' => '68530'
                                                          },
                                                   '4' => {
                                                            'name' => 'q',
                                                            'offset' => '32',
                                                            'type' => '68530'
                                                          },
                                                   '5' => {
                                                            'name' => 'g',
                                                            'offset' => '40',
                                                            'type' => '68530'
                                                          },
                                                   '6' => {
                                                            'name' => 'pub_key',
                                                            'offset' => '48',
                                                            'type' => '68530'
                                                          },
                                                   '7' => {
                                                            'name' => 'priv_key',
                                                            'offset' => '56',
                                                            'type' => '68530'
                                                          },
                                                   '8' => {
                                                            'name' => 'kinv',
                                                            'offset' => '64',
                                                            'type' => '68530'
                                                          },
                                                   '9' => {
                                                            'name' => 'r',
                                                            'offset' => '72',
                                                            'type' => '68530'
                                                          }
                                                 },
                                       'Name' => 'struct dsa_st',
                                       'PrivateABI' => 1,
                                       'Size' => '136',
                                       'Type' => 'Struct'
                                     },
                          '61391' => {
                                       'BaseType' => '61402',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '144',
                                       'Name' => 'DSA_METHOD',
                                       'Size' => '96',
                                       'Type' => 'Typedef'
                                     },
                          '61402' => {
                                       'Header' => 'dsa.h',
                                       'Line' => '132',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '369'
                                                          },
                                                   '1' => {
                                                            'name' => 'dsa_do_sign',
                                                            'offset' => '8',
                                                            'type' => '69119'
                                                          },
                                                   '10' => {
                                                             'name' => 'dsa_paramgen',
                                                             'offset' => '80',
                                                             'type' => '69381'
                                                           },
                                                   '11' => {
                                                             'name' => 'dsa_keygen',
                                                             'offset' => '88',
                                                             'type' => '69330'
                                                           },
                                                   '2' => {
                                                            'name' => 'dsa_sign_setup',
                                                            'offset' => '16',
                                                            'type' => '69161'
                                                          },
                                                   '3' => {
                                                            'name' => 'dsa_do_verify',
                                                            'offset' => '24',
                                                            'type' => '69197'
                                                          },
                                                   '4' => {
                                                            'name' => 'dsa_mod_exp',
                                                            'offset' => '32',
                                                            'type' => '69258'
                                                          },
                                                   '5' => {
                                                            'name' => 'bn_mod_exp',
                                                            'offset' => '40',
                                                            'type' => '69309'
                                                          },
                                                   '6' => {
                                                            'name' => 'init',
                                                            'offset' => '48',
                                                            'type' => '69330'
                                                          },
                                                   '7' => {
                                                            'name' => 'finish',
                                                            'offset' => '56',
                                                            'type' => '69330'
                                                          },
                                                   '8' => {
                                                            'name' => 'flags',
                                                            'offset' => '64',
                                                            'type' => '191'
                                                          },
                                                   '9' => {
                                                            'name' => 'app_data',
                                                            'offset' => '72',
                                                            'type' => '236'
                                                          }
                                                 },
                                       'Name' => 'struct dsa_method',
                                       'PrivateABI' => 1,
                                       'Size' => '96',
                                       'Type' => 'Struct'
                                     },
                          '61559' => {
                                       'BaseType' => '61570',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '146',
                                       'Name' => 'RSA',
                                       'Size' => '168',
                                       'Type' => 'Typedef'
                                     },
                          '61570' => {
                                       'Header' => 'rsa.h',
                                       'Line' => '132',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pad',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '8',
                                                            'type' => '198'
                                                          },
                                                   '10' => {
                                                             'name' => 'dmq1',
                                                             'offset' => '80',
                                                             'type' => '68530'
                                                           },
                                                   '11' => {
                                                             'name' => 'iqmp',
                                                             'offset' => '88',
                                                             'type' => '68530'
                                                           },
                                                   '12' => {
                                                             'name' => 'ex_data',
                                                             'offset' => '96',
                                                             'type' => '66192'
                                                           },
                                                   '13' => {
                                                             'name' => 'references',
                                                             'offset' => '112',
                                                             'type' => '191'
                                                           },
                                                   '14' => {
                                                             'name' => 'flags',
                                                             'offset' => '116',
                                                             'type' => '191'
                                                           },
                                                   '15' => {
                                                             'name' => '_method_mod_n',
                                                             'offset' => '120',
                                                             'type' => '68676'
                                                           },
                                                   '16' => {
                                                             'name' => '_method_mod_p',
                                                             'offset' => '128',
                                                             'type' => '68676'
                                                           },
                                                   '17' => {
                                                             'name' => '_method_mod_q',
                                                             'offset' => '136',
                                                             'type' => '68676'
                                                           },
                                                   '18' => {
                                                             'name' => 'bignum_data',
                                                             'offset' => '144',
                                                             'type' => '236'
                                                           },
                                                   '19' => {
                                                             'name' => 'blinding',
                                                             'offset' => '152',
                                                             'type' => '68859'
                                                           },
                                                   '2' => {
                                                            'name' => 'meth',
                                                            'offset' => '16',
                                                            'type' => '68848'
                                                          },
                                                   '20' => {
                                                             'name' => 'mt_blinding',
                                                             'offset' => '160',
                                                             'type' => '68859'
                                                           },
                                                   '3' => {
                                                            'name' => 'engine',
                                                            'offset' => '24',
                                                            'type' => '67983'
                                                          },
                                                   '4' => {
                                                            'name' => 'n',
                                                            'offset' => '32',
                                                            'type' => '68530'
                                                          },
                                                   '5' => {
                                                            'name' => 'e',
                                                            'offset' => '40',
                                                            'type' => '68530'
                                                          },
                                                   '6' => {
                                                            'name' => 'd',
                                                            'offset' => '48',
                                                            'type' => '68530'
                                                          },
                                                   '7' => {
                                                            'name' => 'p',
                                                            'offset' => '56',
                                                            'type' => '68530'
                                                          },
                                                   '8' => {
                                                            'name' => 'q',
                                                            'offset' => '64',
                                                            'type' => '68530'
                                                          },
                                                   '9' => {
                                                            'name' => 'dmp1',
                                                            'offset' => '72',
                                                            'type' => '68530'
                                                          }
                                                 },
                                       'Name' => 'struct rsa_st',
                                       'PrivateABI' => 1,
                                       'Size' => '168',
                                       'Type' => 'Struct'
                                     },
                          '61825' => {
                                       'BaseType' => '61836',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '147',
                                       'Name' => 'RSA_METHOD',
                                       'Size' => '112',
                                       'Type' => 'Typedef'
                                     },
                          '61836' => {
                                       'Header' => 'rsa.h',
                                       'Line' => '85',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '369'
                                                          },
                                                   '1' => {
                                                            'name' => 'rsa_pub_enc',
                                                            'offset' => '8',
                                                            'type' => '68577'
                                                          },
                                                   '10' => {
                                                             'name' => 'app_data',
                                                             'offset' => '80',
                                                             'type' => '236'
                                                           },
                                                   '11' => {
                                                             'name' => 'rsa_sign',
                                                             'offset' => '88',
                                                             'type' => '68760'
                                                           },
                                                   '12' => {
                                                             'name' => 'rsa_verify',
                                                             'offset' => '96',
                                                             'type' => '68806'
                                                           },
                                                   '13' => {
                                                             'name' => 'rsa_keygen',
                                                             'offset' => '104',
                                                             'type' => '68842'
                                                           },
                                                   '2' => {
                                                            'name' => 'rsa_pub_dec',
                                                            'offset' => '16',
                                                            'type' => '68577'
                                                          },
                                                   '3' => {
                                                            'name' => 'rsa_priv_enc',
                                                            'offset' => '24',
                                                            'type' => '68577'
                                                          },
                                                   '4' => {
                                                            'name' => 'rsa_priv_dec',
                                                            'offset' => '32',
                                                            'type' => '68577'
                                                          },
                                                   '5' => {
                                                            'name' => 'rsa_mod_exp',
                                                            'offset' => '40',
                                                            'type' => '68630'
                                                          },
                                                   '6' => {
                                                            'name' => 'bn_mod_exp',
                                                            'offset' => '48',
                                                            'type' => '68682'
                                                          },
                                                   '7' => {
                                                            'name' => 'init',
                                                            'offset' => '56',
                                                            'type' => '68703'
                                                          },
                                                   '8' => {
                                                            'name' => 'finish',
                                                            'offset' => '64',
                                                            'type' => '68703'
                                                          },
                                                   '9' => {
                                                            'name' => 'flags',
                                                            'offset' => '72',
                                                            'type' => '191'
                                                          }
                                                 },
                                       'Name' => 'struct rsa_meth_st',
                                       'PrivateABI' => 1,
                                       'Size' => '112',
                                       'Type' => 'Struct'
                                     },
                          '62017' => {
                                       'BaseType' => '62028',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '154',
                                       'Name' => 'X509',
                                       'Size' => '184',
                                       'Type' => 'Typedef'
                                     },
                          '62028' => {
                                       'Header' => 'x509.h',
                                       'Line' => '270',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cert_info',
                                                            'offset' => '0',
                                                            'type' => '69914'
                                                          },
                                                   '1' => {
                                                            'name' => 'sig_alg',
                                                            'offset' => '8',
                                                            'type' => '68865'
                                                          },
                                                   '10' => {
                                                             'name' => 'ex_kusage',
                                                             'offset' => '80',
                                                             'type' => '170'
                                                           },
                                                   '11' => {
                                                             'name' => 'ex_xkusage',
                                                             'offset' => '88',
                                                             'type' => '170'
                                                           },
                                                   '12' => {
                                                             'name' => 'ex_nscert',
                                                             'offset' => '96',
                                                             'type' => '170'
                                                           },
                                                   '13' => {
                                                             'name' => 'skid',
                                                             'offset' => '104',
                                                             'type' => '67724'
                                                           },
                                                   '14' => {
                                                             'name' => 'akid',
                                                             'offset' => '112',
                                                             'type' => '69920'
                                                           },
                                                   '15' => {
                                                             'name' => 'policy_cache',
                                                             'offset' => '120',
                                                             'type' => '69926'
                                                           },
                                                   '16' => {
                                                             'name' => 'crldp',
                                                             'offset' => '128',
                                                             'type' => '69959'
                                                           },
                                                   '17' => {
                                                             'name' => 'altname',
                                                             'offset' => '136',
                                                             'type' => '69990'
                                                           },
                                                   '18' => {
                                                             'name' => 'nc',
                                                             'offset' => '144',
                                                             'type' => '69996'
                                                           },
                                                   '19' => {
                                                             'name' => 'sha1_hash',
                                                             'offset' => '152',
                                                             'type' => '70002'
                                                           },
                                                   '2' => {
                                                            'name' => 'signature',
                                                            'offset' => '16',
                                                            'type' => '67718'
                                                          },
                                                   '20' => {
                                                             'name' => 'aux',
                                                             'offset' => '176',
                                                             'type' => '70018'
                                                           },
                                                   '3' => {
                                                            'name' => 'valid',
                                                            'offset' => '24',
                                                            'type' => '191'
                                                          },
                                                   '4' => {
                                                            'name' => 'references',
                                                            'offset' => '28',
                                                            'type' => '191'
                                                          },
                                                   '5' => {
                                                            'name' => 'name',
                                                            'offset' => '32',
                                                            'type' => '236'
                                                          },
                                                   '6' => {
                                                            'name' => 'ex_data',
                                                            'offset' => '40',
                                                            'type' => '66192'
                                                          },
                                                   '7' => {
                                                            'name' => 'ex_pathlen',
                                                            'offset' => '56',
                                                            'type' => '198'
                                                          },
                                                   '8' => {
                                                            'name' => 'ex_pcpathlen',
                                                            'offset' => '64',
                                                            'type' => '198'
                                                          },
                                                   '9' => {
                                                            'name' => 'ex_flags',
                                                            'offset' => '72',
                                                            'type' => '170'
                                                          }
                                                 },
                                       'Name' => 'struct x509_st',
                                       'PrivateABI' => 1,
                                       'Size' => '184',
                                       'Type' => 'Struct'
                                     },
                          '62314' => {
                                       'BaseType' => '62325',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '155',
                                       'Name' => 'X509_ALGOR',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '62325' => {
                                       'Header' => 'x509.h',
                                       'Line' => '143',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'algorithm',
                                                            'offset' => '0',
                                                            'type' => '67700'
                                                          },
                                                   '1' => {
                                                            'name' => 'parameter',
                                                            'offset' => '8',
                                                            'type' => '68427'
                                                          }
                                                 },
                                       'Name' => 'struct X509_algor_st',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '62362' => {
                                       'BaseType' => '62373',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '156',
                                       'Name' => 'X509_CRL',
                                       'Size' => '120',
                                       'Type' => 'Typedef'
                                     },
                          '62373' => {
                                       'Header' => 'x509.h',
                                       'Line' => '452',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'crl',
                                                            'offset' => '0',
                                                            'type' => '70214'
                                                          },
                                                   '1' => {
                                                            'name' => 'sig_alg',
                                                            'offset' => '8',
                                                            'type' => '68865'
                                                          },
                                                   '10' => {
                                                             'name' => 'base_crl_number',
                                                             'offset' => '64',
                                                             'type' => '67706'
                                                           },
                                                   '11' => {
                                                             'name' => 'sha1_hash',
                                                             'offset' => '72',
                                                             'type' => '70002'
                                                           },
                                                   '12' => {
                                                             'name' => 'issuers',
                                                             'offset' => '96',
                                                             'type' => '70231'
                                                           },
                                                   '13' => {
                                                             'name' => 'meth',
                                                             'offset' => '104',
                                                             'type' => '70237'
                                                           },
                                                   '14' => {
                                                             'name' => 'meth_data',
                                                             'offset' => '112',
                                                             'type' => '234'
                                                           },
                                                   '2' => {
                                                            'name' => 'signature',
                                                            'offset' => '16',
                                                            'type' => '67718'
                                                          },
                                                   '3' => {
                                                            'name' => 'references',
                                                            'offset' => '24',
                                                            'type' => '191'
                                                          },
                                                   '4' => {
                                                            'name' => 'flags',
                                                            'offset' => '28',
                                                            'type' => '191'
                                                          },
                                                   '5' => {
                                                            'name' => 'akid',
                                                            'offset' => '32',
                                                            'type' => '69920'
                                                          },
                                                   '6' => {
                                                            'name' => 'idp',
                                                            'offset' => '40',
                                                            'type' => '70220'
                                                          },
                                                   '7' => {
                                                            'name' => 'idp_flags',
                                                            'offset' => '48',
                                                            'type' => '191'
                                                          },
                                                   '8' => {
                                                            'name' => 'idp_reasons',
                                                            'offset' => '52',
                                                            'type' => '191'
                                                          },
                                                   '9' => {
                                                            'name' => 'crl_number',
                                                            'offset' => '56',
                                                            'type' => '67706'
                                                          }
                                                 },
                                       'Name' => 'struct X509_crl_st',
                                       'PrivateABI' => 1,
                                       'Size' => '120',
                                       'Type' => 'Struct'
                                     },
                          '62582' => {
                                       'BaseType' => '62593',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '157',
                                       'Name' => 'X509_CRL_METHOD',
                                       'Type' => 'Typedef'
                                     },
                          '62593' => {
                                       'Name' => 'struct x509_crl_method_st',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '62598' => {
                                       'BaseType' => '62609',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '159',
                                       'Name' => 'X509_NAME',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '62609' => {
                                       'Header' => 'x509.h',
                                       'Line' => '179',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entries',
                                                            'offset' => '0',
                                                            'type' => '69558'
                                                          },
                                                   '1' => {
                                                            'name' => 'modified',
                                                            'offset' => '8',
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'name' => 'bytes',
                                                            'offset' => '16',
                                                            'type' => '69564'
                                                          },
                                                   '3' => {
                                                            'name' => 'canon_enc',
                                                            'offset' => '24',
                                                            'type' => '51391'
                                                          },
                                                   '4' => {
                                                            'name' => 'canon_enclen',
                                                            'offset' => '32',
                                                            'type' => '191'
                                                          }
                                                 },
                                       'Name' => 'struct X509_name_st',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '62682' => {
                                       'BaseType' => '62693',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '160',
                                       'Name' => 'X509_PUBKEY',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '62693' => {
                                       'Header' => 'x509.h',
                                       'Line' => '157',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'algor',
                                                            'offset' => '0',
                                                            'type' => '68865'
                                                          },
                                                   '1' => {
                                                            'name' => 'public_key',
                                                            'offset' => '8',
                                                            'type' => '67718'
                                                          },
                                                   '2' => {
                                                            'name' => 'pkey',
                                                            'offset' => '16',
                                                            'type' => '69479'
                                                          }
                                                 },
                                       'Name' => 'struct X509_pubkey_st',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '62742' => {
                                       'BaseType' => '62753',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '161',
                                       'Name' => 'X509_STORE',
                                       'Size' => '144',
                                       'Type' => 'Typedef'
                                     },
                          '62753' => {
                                       'Header' => 'x509_vfy.h',
                                       'Line' => '186',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cache',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'objs',
                                                            'offset' => '8',
                                                            'type' => '70490'
                                                          },
                                                   '10' => {
                                                             'name' => 'check_crl',
                                                             'offset' => '80',
                                                             'type' => '70686'
                                                           },
                                                   '11' => {
                                                             'name' => 'cert_crl',
                                                             'offset' => '88',
                                                             'type' => '70717'
                                                           },
                                                   '12' => {
                                                             'name' => 'lookup_certs',
                                                             'offset' => '96',
                                                             'type' => '70743'
                                                           },
                                                   '13' => {
                                                             'name' => 'lookup_crls',
                                                             'offset' => '104',
                                                             'type' => '70775'
                                                           },
                                                   '14' => {
                                                             'name' => 'cleanup',
                                                             'offset' => '112',
                                                             'type' => '70529'
                                                           },
                                                   '15' => {
                                                             'name' => 'ex_data',
                                                             'offset' => '120',
                                                             'type' => '66192'
                                                           },
                                                   '16' => {
                                                             'name' => 'references',
                                                             'offset' => '136',
                                                             'type' => '191'
                                                           },
                                                   '2' => {
                                                            'name' => 'get_cert_methods',
                                                            'offset' => '16',
                                                            'type' => '70496'
                                                          },
                                                   '3' => {
                                                            'name' => 'param',
                                                            'offset' => '24',
                                                            'type' => '70502'
                                                          },
                                                   '4' => {
                                                            'name' => 'verify',
                                                            'offset' => '32',
                                                            'type' => '70529'
                                                          },
                                                   '5' => {
                                                            'name' => 'verify_cb',
                                                            'offset' => '40',
                                                            'type' => '70555'
                                                          },
                                                   '6' => {
                                                            'name' => 'get_issuer',
                                                            'offset' => '48',
                                                            'type' => '70592'
                                                          },
                                                   '7' => {
                                                            'name' => 'check_issued',
                                                            'offset' => '56',
                                                            'type' => '70623'
                                                          },
                                                   '8' => {
                                                            'name' => 'check_revocation',
                                                            'offset' => '64',
                                                            'type' => '70529'
                                                          },
                                                   '9' => {
                                                            'name' => 'get_crl',
                                                            'offset' => '72',
                                                            'type' => '70660'
                                                          }
                                                 },
                                       'Name' => 'struct x509_store_st',
                                       'PrivateABI' => 1,
                                       'Size' => '144',
                                       'Type' => 'Struct'
                                     },
                          '62970' => {
                                       'BaseType' => '62981',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '162',
                                       'Name' => 'X509_STORE_CTX',
                                       'Size' => '248',
                                       'Type' => 'Typedef'
                                     },
                          '62981' => {
                                       'Header' => 'x509_vfy.h',
                                       'Line' => '236',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ctx',
                                                            'offset' => '0',
                                                            'type' => '70781'
                                                          },
                                                   '1' => {
                                                            'name' => 'current_method',
