$VAR1 = {
          'ABI_DUMPER_VERSION' => '0.99.19',
          'ABI_DUMP_VERSION' => '3.3',
          'Arch' => 'x86_64',
          'GccVersion' => '4.8.5',
          'Headers' => {
                         'serf.h' => 1,
                         'serf_bucket_types.h' => 1,
                         'serf_bucket_util.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libserf-1.so.0.0.0',
          'LibraryVersion' => '1.2.1',
          'NameSpaces' => {},
          'Needed' => {
                        'libapr-1.so.0' => 1,
                        'libaprutil-1.so.0' => 1,
                        'libc.so.6' => 1,
                        'libcrypto.so.1.0.0' => 1,
                        'libdb-4.8.so' => 1,
                        'libdl.so.2' => 1,
                        'libexpat.so.1' => 1,
                        'liblber-2.4.so.2' => 1,
                        'libldap-2.4.so.2' => 1,
                        'libm.so.6' => 1,
                        'libpthread.so.0' => 1,
                        'librt.so.1' => 1,
                        'libssl.so.1.0.0' => 1,
                        'libz.so.1' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'aggregate_buckets.c' => 1,
                         'allocator.c' => 1,
                         'barrier_buckets.c' => 1,
                         'buckets.c' => 1,
                         'bwtp_buckets.c' => 1,

                                                   'serf_default_destroy' => 1,
                                                   'serf_default_destroy_and_data' => 1,
                                                   'serf_default_read_bucket' => 1,
                                                   'serf_default_read_for_sendfile' => 1,
                                                   'serf_default_read_iovec' => 1,
                                                   'serf_error_string' => 1,
                                                   'serf_event_trigger' => 1,
                                                   'serf_incoming_create' => 1,
                                                   'serf_lib_version' => 1,
                                                   'serf_linebuf_fetch' => 1,
                                                   'serf_linebuf_init' => 1,
                                                   'serf_listener_create' => 1,
                                                   'serf_request_bucket_request_create' => 1,
                                                   'serf_request_cancel' => 1,
                                                   'serf_request_get_alloc' => 1,
                                                   'serf_request_get_conn' => 1,
                                                   'serf_request_get_pool' => 1,
                                                   'serf_request_is_written' => 1,
                                                   'serf_request_set_handler' => 1,
                                                   'serf_response_full_become_aggregate' => 1,
                                                   'serf_ssl_cert_certificate' => 1,
                                                   'serf_ssl_cert_depth' => 1,
                                                   'serf_ssl_cert_export' => 1,
                                                   'serf_ssl_cert_issuer' => 1,
                                                   'serf_ssl_cert_subject' => 1,
                                                   'serf_ssl_client_cert_password_set' => 1,
                                                   'serf_ssl_client_cert_provider_set' => 1,
                                                   'serf_ssl_load_cert_file' => 1,
                                                   'serf_ssl_server_cert_callback_set' => 1,
                                                   'serf_ssl_server_cert_chain_callback_set' => 1,
                                                   'serf_ssl_set_hostname' => 1,
                                                   'serf_ssl_trust_cert' => 1,
                                                   'serf_ssl_use_compression' => 1,
                                                   'serf_ssl_use_default_certificates' => 1,
                                                   'serf_util_readline' => 1
                                                 }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '10130' => {
                                       'Name' => 'struct hostent',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '10135' => {
                                       'BaseType' => '10130',
                                       'Name' => 'struct hostent*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10141' => {
                                       'BaseType' => '10152',
                                       'Header' => 'serf.h',
                                       'Line' => '38',
                                       'Name' => 'serf_context_t',
                                       'Size' => '152',
                                       'Type' => 'Typedef'
                                     },
                          '10152' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '103',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pool',
                                                            'offset' => '0',
                                                            'type' => '4575'
                                                          },
                                                   '1' => {
                                                            'name' => 'pollset_baton',
                                                            'offset' => '8',
                                                            'type' => '234'
                                                          },
                                                   '10' => {
                                                             'name' => 'progress_written',
                                                             'offset' => '80',
                                                             'type' => '346'
                                                           },
                                                   '11' => {
                                                             'name' => 'authn_info',
                                                             'offset' => '88',
                                                             'type' => '12711'
                                                           },
                                                   '12' => {
                                                             'name' => 'proxy_authn_info',
                                                             'offset' => '112',
                                                             'type' => '12711'
                                                           },
                                                   '13' => {
                                                             'name' => 'authn_types',
                                                             'offset' => '136',
                                                             'type' => '191'
                                                           },
                                                   '14' => {
                                                             'name' => 'cred_cb',
                                                             'offset' => '144',
                                                             'type' => '11816'
                                                           },
                                                   '2' => {
                                                            'name' => 'pollset_add',
                                                            'offset' => '16',
                                                            'type' => '11508'
                                                          },
                                                   '3' => {
                                                            'name' => 'pollset_rm',
                                                            'offset' => '24',
                                                            'type' => '11550'
                                                          },
                                                   '4' => {
                                                            'name' => 'dirty_pollset',
                                                            'offset' => '32',
                                                            'type' => '191'
                                                          },
                                                   '5' => {
                                                            'name' => 'conns',
                                                            'offset' => '40',
                                                            'type' => '12722'
                                                          },
                                                   '6' => {
                                                            'name' => 'proxy_address',
                                                            'offset' => '48',
                                                            'type' => '9713'
                                                          },
                                                   '7' => {
                                                            'name' => 'progress_func',
                                                            'offset' => '56',
                                                            'type' => '11561'
                                                          },
                                                   '8' => {
                                                            'name' => 'progress_baton',
                                                            'offset' => '64',
                                                            'type' => '234'
                                                          },
                                                   '9' => {
                                                            'name' => 'progress_read',
                                                            'offset' => '72',
                                                            'type' => '346'
                                                          }
                                                 },
                                       'Name' => 'struct serf_context_t',
                                       'PrivateABI' => 1,
                                       'Size' => '152',
                                       'Type' => 'Struct'
                                     },
                          '1033' => {
                                      'BaseType' => '1044',
                                      'Header' => 'serf.h',
                                      'Line' => '41',
                                      'Name' => 'serf_bucket_type_t',
                                      'Size' => '64',
                                      'Type' => 'Typedef'
                                    },
                          '1044' => {
                                      'Header' => 'serf.h',
                                      'Line' => '740',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'name',
                                                           'offset' => '0',
                                                           'type' => '369'
                                                         },
                                                  '1' => {
                                                           'name' => 'read',
                                                           'offset' => '8',
                                                           'type' => '1226'
                                                         },
                                                  '2' => {
                                                           'name' => 'readline',
                                                           'offset' => '16',
                                                           'type' => '1267'
                                                         },
                                                  '3' => {
                                                           'name' => 'read_iovec',
                                                           'offset' => '24',
                                                           'type' => '1308'
                                                         },
                                                  '4' => {
                                                           'name' => 'read_for_sendfile',
                                                           'offset' => '32',
                                                           'type' => '1372'
                                                         },
                                                  '5' => {
                                                           'name' => 'read_bucket',
                                                           'offset' => '40',
                                                           'type' => '1409'
                                                         },
                                                  '6' => {
                                                           'name' => 'peek',
                                                           'offset' => '48',
                                                           'type' => '1440'
                                                         },
                                                  '7' => {
                                                           'name' => 'destroy',
                                                           'offset' => '56',
                                                           'type' => '1457'
                                                         }
                                                },
                                      'Name' => 'struct serf_bucket_type_t',
                                      'Size' => '64',
                                      'Type' => 'Struct'
                                    },
                          '10554' => {
                                       'BaseType' => '10565',
                                       'Header' => 'serf.h',
                                       'Line' => '44',
                                       'Name' => 'serf_connection_t',
                                       'Size' => '16752',
                                       'Type' => 'Typedef'
                                     },
                          '10565' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '165',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ctx',
                                                            'offset' => '0',
                                                            'type' => '11943'
                                                          },
                                                   '1' => {
                                                            'name' => 'status',
                                                            'offset' => '8',
                                                            'type' => '358'
                                                          },
                                                   '10' => {
                                                             'name' => 'dirty_conn',
                                                             'offset' => '76',
                                                             'type' => '191'
                                                           },
                                                   '11' => {
                                                             'name' => 'completed_requests',
                                                             'offset' => '80',
                                                             'type' => '163'
                                                           },
                                                   '12' => {
                                                             'name' => 'completed_responses',
                                                             'offset' => '84',
                                                             'type' => '163'
                                                           },
                                                   '13' => {
                                                             'name' => 'probable_keepalive_limit',
                                                             'offset' => '88',
                                                             'type' => '163'
                                                           },
                                                   '14' => {
                                                             'name' => 'state',
                                                             'offset' => '92',
                                                             'type' => '12761'
                                                           },
                                                   '15' => {
                                                             'name' => 'async_responses',
                                                             'offset' => '96',
                                                             'type' => '191'
                                                           },
                                                   '16' => {
                                                             'name' => 'current_async_response',
                                                             'offset' => '104',
                                                             'type' => '1178'
                                                           },
                                                   '17' => {
                                                             'name' => 'async_acceptor',
                                                             'offset' => '112',
                                                             'type' => '11664'
                                                           },
                                                   '18' => {
                                                             'name' => 'async_acceptor_baton',
                                                             'offset' => '120',
                                                             'type' => '234'
                                                           },
                                                   '19' => {
                                                             'name' => 'async_handler',
                                                             'offset' => '128',
                                                             'type' => '11768'
                                                           },
                                                   '2' => {
                                                            'name' => 'baton',
                                                            'offset' => '16',
                                                            'type' => '12592'
                                                          },
                                                   '20' => {
                                                             'name' => 'async_handler_baton',
                                                             'offset' => '136',
                                                             'type' => '234'
                                                           },
                                                   '21' => {
                                                             'name' => 'stream',
                                                             'offset' => '144',
                                                             'type' => '1178'
                                                           },
                                                   '22' => {
                                                             'name' => 'ostream_head',
                                                             'offset' => '152',
                                                             'type' => '1178'
                                                           },
                                                   '23' => {
                                                             'name' => 'ostream_tail',
                                                             'offset' => '160',
                                                             'type' => '1178'
                                                           },
                                                   '24' => {
                                                             'name' => 'ssltunnel_ostream',
                                                             'offset' => '168',
                                                             'type' => '1178'
                                                           },
                                                   '25' => {
                                                             'name' => 'requests',
                                                             'offset' => '176',
                                                             'type' => '11712'
                                                           },
                                                   '26' => {
                                                             'name' => 'requests_tail',
                                                             'offset' => '184',
                                                             'type' => '11712'
                                                           },
                                                   '27' => {
                                                             'name' => 'vec',
                                                             'offset' => '192',
                                                             'type' => '12772'
                                                           },
                                                   '28' => {
                                                             'name' => 'vec_len',
                                                             'offset' => '16576',
                                                             'type' => '191'
                                                           },
                                                   '29' => {
                                                             'name' => 'setup',
                                                             'offset' => '16584',
                                                             'type' => '11599'
                                                           },
                                                   '3' => {
                                                            'name' => 'pool',
                                                            'offset' => '32',
                                                            'type' => '4575'
                                                          },
                                                   '30' => {
                                                             'name' => 'setup_baton',
                                                             'offset' => '16592',
                                                             'type' => '234'
                                                           },
                                                   '31' => {
                                                             'name' => 'closed',
                                                             'offset' => '16600',
                                                             'type' => '11718'
                                                           },
                                                   '32' => {
                                                             'name' => 'closed_baton',
                                                             'offset' => '16608',
                                                             'type' => '234'
                                                           },
                                                   '33' => {
                                                             'name' => 'max_outstanding_requests',
                                                             'offset' => '16616',
                                                             'type' => '163'
                                                           },
                                                   '34' => {
                                                             'name' => 'hit_eof',
                                                             'offset' => '16620',
                                                             'type' => '191'
                                                           },
                                                   '35' => {
                                                             'name' => 'host_url',
                                                             'offset' => '16624',
                                                             'type' => '369'
                                                           },
                                                   '36' => {
                                                             'name' => 'host_info',
                                                             'offset' => '16632',
                                                             'type' => '9929'
                                                           },
                                                   '37' => {
                                                             'name' => 'authn_baton',
                                                             'offset' => '16720',
                                                             'type' => '234'
                                                           },
                                                   '38' => {
                                                             'name' => 'proxy_authn_baton',
                                                             'offset' => '16728',
                                                             'type' => '234'
                                                           },
                                                   '39' => {
                                                             'name' => 'connect_time',
                                                             'offset' => '16736',
                                                             'type' => '8605'
                                                           },
                                                   '4' => {
                                                            'name' => 'allocator',
                                                            'offset' => '40',
                                                            'type' => '1463'
                                                          },
                                                   '40' => {
                                                             'name' => 'latency',
                                                             'offset' => '16744',
                                                             'type' => '8616'
                                                           },
                                                   '5' => {
                                                            'name' => 'address',
                                                            'offset' => '48',
                                                            'type' => '9713'
                                                          },
                                                   '6' => {
                                                            'name' => 'skt',
                                                            'offset' => '56',
                                                            'type' => '9796'
                                                          },
                                                   '7' => {
                                                            'name' => 'skt_pool',
                                                            'offset' => '64',
                                                            'type' => '4575'
                                                          },
                                                   '8' => {
                                                            'name' => 'reqevents',
                                                            'offset' => '72',
                                                            'type' => '8471'
                                                          },
                                                   '9' => {
                                                            'name' => 'seen_in_pollset',
                                                            'offset' => '74',
                                                            'type' => '8471'
                                                          }
                                                 },
                                       'Name' => 'struct serf_connection_t',
                                       'PrivateABI' => 1,
                                       'Size' => '16752',
                                       'Type' => 'Struct'
                                     },
                          '11084' => {
                                       'BaseType' => '11095',
                                       'Header' => 'serf.h',
                                       'Line' => '45',
                                       'Name' => 'serf_listener_t',
                                       'Size' => '88',
                                       'Type' => 'Typedef'
                                     },
                          '11095' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '137',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ctx',
                                                            'offset' => '0',
                                                            'type' => '11943'
                                                          },
                                                   '1' => {
                                                            'name' => 'baton',
                                                            'offset' => '8',
                                                            'type' => '12592'
                                                          },
                                                   '2' => {
                                                            'name' => 'skt',
                                                            'offset' => '24',
                                                            'type' => '9796'
                                                          },
                                                   '3' => {
                                                            'name' => 'pool',
                                                            'offset' => '32',
                                                            'type' => '4575'
                                                          },
                                                   '4' => {
                                                            'name' => 'desc',
                                                            'offset' => '40',
                                                            'type' => '9813'
                                                          },
                                                   '5' => {
                                                            'name' => 'accept_baton',
                                                            'offset' => '72',
                                                            'type' => '234'
                                                          },
                                                   '6' => {
                                                            'name' => 'accept_func',
                                                            'offset' => '80',
                                                            'type' => '11890'
                                                          }
                                                 },
                                       'Name' => 'struct serf_listener_t',
                                       'PrivateABI' => 1,
                                       'Size' => '88',
                                       'Type' => 'Struct'
                                     },
                          '11192' => {
                                       'BaseType' => '11203',
                                       'Header' => 'serf.h',
                                       'Line' => '46',
                                       'Name' => 'serf_incoming_t',
                                       'Size' => '80',
                                       'Type' => 'Typedef'
                                     },
                          '11203' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '147',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ctx',
                                                            'offset' => '0',
                                                            'type' => '11943'
                                                          },
                                                   '1' => {
                                                            'name' => 'baton',
                                                            'offset' => '8',
                                                            'type' => '12592'
                                                          },
                                                   '2' => {
                                                            'name' => 'request_baton',
                                                            'offset' => '24',
                                                            'type' => '234'
                                                          },
                                                   '3' => {
                                                            'name' => 'request',
                                                            'offset' => '32',
                                                            'type' => '11955'
                                                          },
                                                   '4' => {
                                                            'name' => 'skt',
                                                            'offset' => '40',
                                                            'type' => '9796'
                                                          },
                                                   '5' => {
                                                            'name' => 'desc',
                                                            'offset' => '48',
                                                            'type' => '9813'
                                                          }
                                                 },
                                       'Name' => 'struct serf_incoming_t',
                                       'PrivateABI' => 1,
                                       'Size' => '80',
                                       'Type' => 'Struct'
                                     },
                          '11288' => {
                                       'BaseType' => '11299',
                                       'Header' => 'serf.h',
                                       'Line' => '47',
                                       'Name' => 'serf_incoming_request_t',
                                       'Type' => 'Typedef'
                                     },
                          '11299' => {
                                       'Name' => 'struct serf_incoming_request_t',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '11304' => {
                                       'BaseType' => '11315',
                                       'Header' => 'serf.h',
                                       'Line' => '49',
                                       'Name' => 'serf_request_t',
                                       'Size' => '112',
                                       'Type' => 'Typedef'
                                     },
                          '11315' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '55',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'conn',
                                                            'offset' => '0',
                                                            'type' => '11762'
                                                          },
                                                   '1' => {
                                                            'name' => 'respool',
                                                            'offset' => '8',
                                                            'type' => '4575'
                                                          },
                                                   '10' => {
                                                             'name' => 'resp_bkt',
                                                             'offset' => '80',
                                                             'type' => '1178'
                                                           },
                                                   '11' => {
                                                             'name' => 'written',
                                                             'offset' => '88',
                                                             'type' => '191'
                                                           },
                                                   '12' => {
                                                             'name' => 'priority',
                                                             'offset' => '92',
                                                             'type' => '191'
                                                           },
                                                   '13' => {
                                                             'name' => 'auth_baton',
                                                             'offset' => '96',
                                                             'type' => '234'
                                                           },
                                                   '14' => {
                                                             'name' => 'next',
                                                             'offset' => '104',
                                                             'type' => '11712'
                                                           },
                                                   '2' => {
                                                            'name' => 'allocator',
                                                            'offset' => '16',
                                                            'type' => '1463'
                                                          },
                                                   '3' => {
                                                            'name' => 'req_bkt',
                                                            'offset' => '24',
                                                            'type' => '1178'
                                                          },
                                                   '4' => {
                                                            'name' => 'setup',
                                                            'offset' => '32',
                                                            'type' => '12009'
                                                          },
                                                   '5' => {
                                                            'name' => 'setup_baton',
                                                            'offset' => '40',
                                                            'type' => '234'
                                                          },
                                                   '6' => {
                                                            'name' => 'acceptor',
                                                            'offset' => '48',
                                                            'type' => '11664'
                                                          },
                                                   '7' => {
                                                            'name' => 'acceptor_baton',
                                                            'offset' => '56',
                                                            'type' => '234'
                                                          },
                                                   '8' => {
                                                            'name' => 'handler',
                                                            'offset' => '64',
                                                            'type' => '11768'
                                                          },
                                                   '9' => {
                                                            'name' => 'handler_baton',
                                                            'offset' => '72',
                                                            'type' => '234'
                                                          }
                                                 },
                                       'Name' => 'struct serf_request_t',
                                       'PrivateABI' => 1,
                                       'Size' => '112',
                                       'Type' => 'Struct'
                                     },
                          '11508' => {
                                       'BaseType' => '11519',
                                       'Header' => 'serf.h',
                                       'Line' => '148',
                                       'Name' => 'serf_socket_add_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11519' => {
                                       'Name' => 'apr_status_t(*)(void*, apr_pollfd_t*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '9923'
                                                           },
                                                    '2' => {
                                                             'type' => '234'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '115311' => {
                                        'BaseType' => '12551',
                                        'Name' => 'serf_incoming_t**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '11550' => {
                                       'BaseType' => '11519',
                                       'Header' => 'serf.h',
                                       'Line' => '157',
                                       'Name' => 'serf_socket_remove_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11561' => {
                                       'BaseType' => '11572',
                                       'Header' => 'serf.h',
                                       'Line' => '227',
                                       'Name' => 'serf_progress_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11572' => {
                                       'Name' => 'void(*)(void*, apr_off_t, apr_off_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '346'
                                                           },
                                                    '2' => {
                                                             'type' => '346'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '115739' => {
                                        'BaseType' => '11949',
                                        'Name' => 'serf_listener_t**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '11599' => {
                                       'BaseType' => '11611',
                                       'Header' => 'serf.h',
                                       'Line' => '274',
                                       'Name' => 'serf_connection_setup_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11611' => {
                                       'Name' => 'apr_status_t(*)(apr_socket_t*, serf_bucket_t**, serf_bucket_t**, void*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '9796'
                                                           },
                                                    '1' => {
                                                             'type' => '11652'
                                                           },
                                                    '2' => {
                                                             'type' => '11652'
                                                           },
                                                    '3' => {
                                                             'type' => '234'
                                                           },
                                                    '4' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1162' => {
                                      'BaseType' => '1173',
                                      'Header' => 'serf.h',
                                      'Line' => '42',
                                      'Name' => 'serf_bucket_alloc_t',
                                      'Type' => 'Typedef'
                                    },
                          '11652' => {
                                       'BaseType' => '1178',
                                       'Name' => 'serf_bucket_t**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11664' => {
                                       'BaseType' => '11676',
                                       'Header' => 'serf.h',
                                       'Line' => '309',
                                       'Name' => 'serf_response_acceptor_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11676' => {
                                       'Name' => 'serf_bucket_t*(*)(serf_request_t*, serf_bucket_t*, void*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11712'
                                                           },
                                                    '1' => {
                                                             'type' => '1178'
                                                           },
                                                    '2' => {
                                                             'type' => '234'
                                                           },
                                                    '3' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '1178',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11712' => {
                                       'BaseType' => '11304',
                                       'Name' => 'serf_request_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11718' => {
                                       'BaseType' => '11730',
                                       'Header' => 'serf.h',
                                       'Line' => '327',
                                       'Name' => 'serf_connection_closed_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '1173' => {
                                      'Line' => '83',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'pool',
                                                           'offset' => '0',
                                                           'type' => '4575'
                                                         },
                                                  '1' => {
                                                           'name' => 'allocator',
                                                           'offset' => '8',
                                                           'type' => '47135'
                                                         },
                                                  '2' => {
                                                           'name' => 'own_allocator',
                                                           'offset' => '16',
                                                           'type' => '191'
                                                         },
                                                  '3' => {
                                                           'name' => 'unfreed',
                                                           'offset' => '24',
                                                           'type' => '46890'
                                                         },
                                                  '4' => {
                                                           'name' => 'unfreed_baton',
                                                           'offset' => '32',
                                                           'type' => '234'
                                                         },
                                                  '5' => {
                                                           'name' => 'num_alloc',
                                                           'offset' => '40',
                                                           'type' => '8507'
                                                         },
                                                  '6' => {
                                                           'name' => 'freelist',
                                                           'offset' => '48',
                                                           'type' => '47141'
                                                         },
                                                  '7' => {
                                                           'name' => 'blocks',
                                                           'offset' => '56',
                                                           'type' => '45667'
                                                         },
                                                  '8' => {
                                                           'name' => 'track',
                                                           'offset' => '64',
                                                           'type' => '47147'
                                                         }
                                                },
                                      'Name' => 'struct serf_bucket_alloc_t',
                                      'PrivateABI' => 1,
                                      'Size' => '72',
                                      'Source' => 'allocator.c',
                                      'Type' => 'Struct'
                                    },
                          '11730' => {
                                       'Name' => 'void(*)(serf_connection_t*, void*, apr_status_t, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11762'
                                                           },
                                                    '1' => {
                                                             'type' => '234'
                                                           },
                                                    '2' => {
                                                             'type' => '358'
                                                           },
                                                    '3' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11762' => {
                                       'BaseType' => '10554',
                                       'Name' => 'serf_connection_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11768' => {
                                       'BaseType' => '11780',
                                       'Header' => 'serf.h',
                                       'Line' => '361',
                                       'Name' => 'serf_response_handler_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '1178' => {
                                      'BaseType' => '969',
                                      'Name' => 'serf_bucket_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '11780' => {
                                       'Name' => 'apr_status_t(*)(serf_request_t*, serf_bucket_t*, void*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11712'
                                                           },
                                                    '1' => {
                                                             'type' => '1178'
                                                           },
                                                    '2' => {
                                                             'type' => '234'
                                                           },
                                                    '3' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11816' => {
                                       'BaseType' => '11828',
                                       'Header' => 'serf.h',
                                       'Line' => '374',
                                       'Name' => 'serf_credentials_callback_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11828' => {
                                       'Name' => 'apr_status_t(*)(char**, char**, serf_request_t*, void*, int, char const*, char const*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11884'
                                                           },
                                                    '1' => {
                                                             'type' => '11884'
                                                           },
                                                    '2' => {
                                                             'type' => '11712'
                                                           },
                                                    '3' => {
                                                             'type' => '234'
                                                           },
                                                    '4' => {
                                                             'type' => '191'
                                                           },
                                                    '5' => {
                                                             'type' => '369'
                                                           },
                                                    '6' => {
                                                             'type' => '369'
                                                           },
                                                    '7' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11884' => {
                                       'BaseType' => '236',
                                       'Name' => 'char**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11890' => {
                                       'BaseType' => '11902',
                                       'Header' => 'serf.h',
                                       'Line' => '447',
                                       'Name' => 'serf_accept_client_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11902' => {
                                       'Name' => 'apr_status_t(*)(serf_context_t*, serf_listener_t*, void*, apr_socket_t*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11943'
                                                           },
                                                    '1' => {
                                                             'type' => '11949'
                                                           },
                                                    '2' => {
                                                             'type' => '234'
                                                           },
                                                    '3' => {
                                                             'type' => '9796'
                                                           },
                                                    '4' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11943' => {
                                       'BaseType' => '10141',
                                       'Name' => 'serf_context_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11949' => {
                                       'BaseType' => '11084',
                                       'Name' => 'serf_listener_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11955' => {
                                       'BaseType' => '11967',
                                       'Header' => 'serf.h',
                                       'Line' => '463',
                                       'Name' => 'serf_incoming_request_cb_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11967' => {
                                       'Name' => 'apr_status_t(*)(serf_context_t*, serf_incoming_request_t*, void*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11943'
                                                           },
                                                    '1' => {
                                                             'type' => '12003'
                                                           },
                                                    '2' => {
                                                             'type' => '234'
                                                           },
                                                    '3' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12003' => {
                                       'BaseType' => '11288',
                                       'Name' => 'serf_incoming_request_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12009' => {
                                       'BaseType' => '12021',
                                       'Header' => 'serf.h',
                                       'Line' => '529',
                                       'Name' => 'serf_request_setup_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '12021' => {
                                       'Name' => 'apr_status_t(*)(serf_request_t*, void*, serf_bucket_t**, serf_response_acceptor_t*, void**, serf_response_handler_t*, void**, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11712'
                                                           },
                                                    '1' => {
                                                             'type' => '234'
                                                           },
                                                    '2' => {
                                                             'type' => '11652'
                                                           },
                                                    '3' => {
                                                             'type' => '12077'
                                                           },
                                                    '4' => {
                                                             'type' => '12083'
                                                           },
                                                    '5' => {
                                                             'type' => '12089'
                                                           },
                                                    '6' => {
                                                             'type' => '12083'
                                                           },
                                                    '7' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12077' => {
                                       'BaseType' => '11664',
                                       'Name' => 'serf_response_acceptor_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12083' => {
                                       'BaseType' => '234',
                                       'Name' => 'void**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12089' => {
                                       'BaseType' => '11768',
                                       'Name' => 'serf_response_handler_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1214' => {
                                      'BaseType' => '369',
                                      'Name' => 'char const**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1220' => {
                                      'BaseType' => '334',
                                      'Name' => 'apr_size_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1226' => {
                                      'Name' => 'apr_status_t(*)(serf_bucket_t*, apr_size_t, char const**, apr_size_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1178'
                                                          },
                                                   '1' => {
                                                            'type' => '334'
                                                          },
                                                   '2' => {
                                                            'type' => '1214'
                                                          },
                                                   '3' => {
                                                            'type' => '1220'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '12380' => {
                                       'BaseType' => '12391',
                                       'Header' => 'serf_private.h',
                                       'Line' => '43',
                                       'Name' => 'serf__authn_scheme_t',
                                       'Size' => '64',
                                       'Type' => 'Typedef'
                                     },
                          '12391' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '331',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'code',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'name',
                                                            'offset' => '8',
                                                            'type' => '369'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '16',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'init_ctx_func',
                                                            'offset' => '24',
                                                            'type' => '12886'
                                                          },
                                                   '4' => {
                                                            'name' => 'init_conn_func',
                                                            'offset' => '32',
                                                            'type' => '12929'
                                                          },
                                                   '5' => {
                                                            'name' => 'handle_func',
                                                            'offset' => '40',
                                                            'type' => '12823'
                                                          },
                                                   '6' => {
                                                            'name' => 'setup_request_func',
                                                            'offset' => '48',
                                                            'type' => '12972'
                                                          },
                                                   '7' => {
                                                            'name' => 'validate_response_func',
                                                            'offset' => '56',
                                                            'type' => '13035'
                                                          }
                                                 },
                                       'Name' => 'struct serf__authn_scheme_t',
                                       'PrivateABI' => 1,
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '12509' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '47',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'client',
                                                            'offset' => '0',
                                                            'type' => '12551'
                                                          },
                                                   '1' => {
                                                            'name' => 'conn',
                                                            'offset' => '0',
                                                            'type' => '11762'
                                                          },
                                                   '2' => {
                                                            'name' => 'listener',
                                                            'offset' => '0',
                                                            'type' => '11949'
                                                          }
                                                 },
                                       'Name' => 'anon-union-serf_private.h-47',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '12551' => {
                                       'BaseType' => '11192',
                                       'Name' => 'serf_incoming_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12557' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '45',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'u',
                                                            'offset' => '8',
                                                            'type' => '12509'
                                                          }
                                                 },
                                       'Name' => 'struct serf_io_baton_t',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '12592' => {
                                       'BaseType' => '12557',
                                       'Header' => 'serf_private.h',
                                       'Line' => '52',
                                       'Name' => 'serf_io_baton_t',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '12651' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '95',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'realm',
                                                            'offset' => '0',
                                                            'type' => '369'
                                                          },
                                                   '1' => {
                                                            'name' => 'scheme',
                                                            'offset' => '8',
                                                            'type' => '12700'
                                                          },
                                                   '2' => {
                                                            'name' => 'baton',
                                                            'offset' => '16',
                                                            'type' => '234'
                                                          }
                                                 },
                                       'Name' => 'struct serf__authn_info_t',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '1267' => {
                                      'Name' => 'apr_status_t(*)(serf_bucket_t*, int, int*, char const**, apr_size_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1178'
                                                          },
                                                   '1' => {
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'type' => '328'
                                                          },
                                                   '3' => {
                                                            'type' => '1214'
                                                          },
                                                   '4' => {
                                                            'type' => '1220'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '126790' => {
                                        'BaseType' => '11762',
                                        'Name' => 'serf_connection_t**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '12700' => {
                                       'BaseType' => '12706',
                                       'Name' => 'serf__authn_scheme_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12706' => {
                                       'BaseType' => '12380',
                                       'Name' => 'serf__authn_scheme_t const',
                                       'Size' => '64',
                                       'Type' => 'Const'
                                     },
                          '12711' => {
                                       'BaseType' => '12651',
                                       'Header' => 'serf_private.h',
                                       'Line' => '101',
                                       'Name' => 'serf__authn_info_t',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '12722' => {
                                       'BaseType' => '8638',
                                       'Name' => 'apr_array_header_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12761' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '163',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'SERF_CONN_INIT',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'SERF_CONN_SETUP_SSLTUNNEL',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'SERF_CONN_CONNECTED',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'SERF_CONN_CLOSING',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum serf__connection_state_t',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '12772' => {
                                       'BaseType' => '285',
                                       'Name' => 'struct iovec[1024]',
                                       'Size' => '16384',
                                       'Type' => 'Array'
                                     },
                          '128105' => {
                                        'BaseType' => '128111',
                                        'Name' => 'serf_request_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '12811' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '264',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'PROXY',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'HOST',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum peer_t',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '128111' => {
                                        'BaseType' => '11304',
                                        'Name' => 'serf_request_t const',
                                        'Size' => '112',
                                        'Type' => 'Const'
                                      },
                          '12823' => {
                                       'BaseType' => '12835',
                                       'Header' => 'serf_private.h',
                                       'Line' => '272',
                                       'Name' => 'serf__auth_handler_func_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '128287' => {
                                        'BaseType' => '11768',
                                        'Name' => 'serf_response_handler_t const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '128292' => {
                                        'BaseType' => '18097',
                                        'Name' => 'void const**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '12835' => {
                                       'Name' => 'apr_status_t(*)(int, serf_request_t*, serf_bucket_t*, char const*, char const*, void*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '191'
                                                           },
                                                    '1' => {
                                                             'type' => '11712'
                                                           },
                                                    '2' => {
                                                             'type' => '1178'
                                                           },
                                                    '3' => {
                                                             'type' => '369'
                                                           },
                                                    '4' => {
                                                             'type' => '369'
                                                           },
                                                    '5' => {
                                                             'type' => '234'
                                                           },
                                                    '6' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12886' => {
                                       'BaseType' => '12898',
                                       'Header' => 'serf_private.h',
                                       'Line' => '286',
                                       'Name' => 'serf__init_context_func_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '12898' => {
                                       'Name' => 'apr_status_t(*)(int, serf_context_t*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '191'
                                                           },
                                                    '1' => {
                                                             'type' => '11943'
                                                           },
                                                    '2' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12929' => {
                                       'BaseType' => '12941',
                                       'Header' => 'serf_private.h',
                                       'Line' => '296',
                                       'Name' => 'serf__init_conn_func_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '12941' => {
                                       'Name' => 'apr_status_t(*)(int, serf_connection_t*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '191'
                                                           },
                                                    '1' => {
                                                             'type' => '11762'
                                                           },
                                                    '2' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12972' => {
                                       'BaseType' => '12984',
                                       'Header' => 'serf_private.h',
                                       'Line' => '307',
                                       'Name' => 'serf__setup_request_func_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '12984' => {
                                       'Name' => 'apr_status_t(*)(peer_t, int, serf_connection_t*, serf_request_t*, char const*, char const*, serf_bucket_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '12811'
                                                           },
                                                    '1' => {
                                                             'type' => '191'
                                                           },
                                                    '2' => {
                                                             'type' => '11762'
                                                           },
                                                    '3' => {
                                                             'type' => '11712'
                                                           },
                                                    '4' => {
                                                             'type' => '369'
                                                           },
                                                    '5' => {
                                                             'type' => '369'
                                                           },
                                                    '6' => {
                                                             'type' => '1178'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '13035' => {
                                       'BaseType' => '13047',
                                       'Header' => 'serf_private.h',
                                       'Line' => '321',
                                       'Name' => 'serf__validate_response_func_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '13047' => {
                                       'Name' => 'apr_status_t(*)(peer_t, int, serf_connection_t*, serf_request_t*, serf_bucket_t*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '12811'
                                                           },
                                                    '1' => {
                                                             'type' => '191'
                                                           },
                                                    '2' => {
                                                             'type' => '11762'
                                                           },
                                                    '3' => {
                                                             'type' => '11712'
                                                           },
                                                    '4' => {
                                                             'type' => '1178'
                                                           },
                                                    '5' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1308' => {
                                      'Name' => 'apr_status_t(*)(serf_bucket_t*, apr_size_t, int, struct iovec*, int*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1178'
                                                          },
                                                   '1' => {
                                                            'type' => '334'
                                                          },
                                                   '2' => {
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'type' => '322'
                                                          },
                                                   '4' => {
                                                            'type' => '328'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1354' => {
                                      'BaseType' => '886',
                                      'Name' => 'apr_hdtr_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1360' => {
                                      'BaseType' => '963',
                                      'Name' => 'apr_file_t**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1366' => {
                                      'BaseType' => '346',
                                      'Name' => 'apr_off_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1372' => {
                                      'Name' => 'apr_status_t(*)(serf_bucket_t*, apr_size_t, apr_hdtr_t*, apr_file_t**, apr_off_t*, apr_size_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1178'
                                                          },
                                                   '1' => {
                                                            'type' => '334'
                                                          },
                                                   '2' => {
                                                            'type' => '1354'
                                                          },
                                                   '3' => {
                                                            'type' => '1360'
                                                          },
                                                   '4' => {
                                                            'type' => '1366'
                                                          },
                                                   '5' => {
                                                            'type' => '1220'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1398' => {
                                      'BaseType' => '1404',
                                      'Name' => 'serf_bucket_type_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1404' => {
                                      'BaseType' => '1033',
                                      'Name' => 'serf_bucket_type_t const',
                                      'Size' => '64',
                                      'Type' => 'Const'
                                    },
                          '1409' => {
                                      'Name' => 'serf_bucket_t*(*)(serf_bucket_t*, serf_bucket_type_t const*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1178'
                                                          },
                                                   '1' => {
                                                            'type' => '1398'
                                                          }
                                                 },
                                      'Return' => '1178',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1440' => {
                                      'Name' => 'apr_status_t(*)(serf_bucket_t*, char const**, apr_size_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1178'
                                                          },
                                                   '1' => {
                                                            'type' => '1214'
                                                          },
                                                   '2' => {
                                                            'type' => '1220'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '14494' => {
                                       'BaseType' => '14500',
                                       'Name' => 'apr_pollfd_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14500' => {
                                       'BaseType' => '9813',
                                       'Name' => 'apr_pollfd_t const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '1457' => {
                                      'Name' => 'void(*)(serf_bucket_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1178'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1463' => {
                                      'BaseType' => '1162',
                                      'Name' => 'serf_bucket_alloc_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1469' => {
                                      'BaseType' => '1480',
                                      'Header' => 'serf_bucket_types.h',
                                      'Line' => '194',
                                      'Name' => 'serf_bucket_aggregate_eof_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1480' => {
                                      'Name' => 'apr_status_t(*)(void*, serf_bucket_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '234'
                                                          },
                                                   '1' => {
                                                            'type' => '1178'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '14848' => {
                                       'BaseType' => '11561',
                                       'Name' => 'serf_progress_t const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '149' => {
                                     'Name' => 'unsigned char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '1506' => {
                                      'BaseType' => '1518',
                                      'Header' => 'serf_bucket_types.h',
                                      'Line' => '290',
                                      'Name' => 'serf_simple_freefunc_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1518' => {
                                      'Name' => 'void(*)(void*, char const*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '234'
                                                          },
                                                   '1' => {
                                                            'type' => '369'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1540' => {
                                      'Line' => '21',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'bucket',
                                                           'offset' => '0',
                                                           'type' => '1178'
                                                         },
                                                  '1' => {
                                                           'name' => 'next',
                                                           'offset' => '8',
                                                           'type' => '1577'
                                                         }
                                                },
                                      'Name' => 'struct bucket_list',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Source' => 'aggregate_buckets.c',
                                      'Type' => 'Struct'
                                    },
                          '156' => {
                                     'Name' => 'unsigned short',
                                     'Size' => '2',
                                     'Type' => 'Intrinsic'
                                   },
                          '1577' => {
                                      'BaseType' => '1540',
                                      'Name' => 'struct bucket_list*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1583' => {
                                      'BaseType' => '1540',
                                      'Line' => '24',
                                      'Name' => 'bucket_list_t',
                                      'Size' => '16',
                                      'Source' => 'aggregate_buckets.c',
                                      'Type' => 'Typedef'
                                    },
                          '163' => {
                                     'Name' => 'unsigned int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '1675' => {
                                      'BaseType' => '1583',
                                      'Name' => 'bucket_list_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '170' => {
                                     'Name' => 'unsigned long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '17984' => {
                                       'Header' => 'serf.h',
                                       'Line' => '1013',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'SERF_LINEBUF_EMPTY',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'SERF_LINEBUF_READY',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'SERF_LINEBUF_PARTIAL',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'SERF_LINEBUF_CRLF_SPLIT',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'anon-enum-serf.h-1013',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '18068' => {
                                       'BaseType' => '242',
                                       'Name' => 'char[8000]',
                                       'Size' => '8000',
                                       'Type' => 'Array'
                                     },
                          '18085' => {
                                       'Header' => 'serf.h',
                                       'Line' => '1026',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state',
                                                            'offset' => '0',
                                                            'type' => '17984'
                                                          },
                                                   '1' => {
                                                            'name' => 'used',
                                                            'offset' => '8',
                                                            'type' => '334'
                                                          },
                                                   '2' => {
                                                            'name' => 'line',
                                                            'offset' => '16',
                                                            'type' => '18068'
                                                          }
                                                 },
                                       'Name' => 'struct serf_linebuf_t',
                                       'Size' => '8016',
                                       'Type' => 'Struct'
                                     },
                          '18097' => {
                                       'BaseType' => '18103',
                                       'Name' => 'void const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '18103' => {
                                       'BaseType' => '1',
                                       'Name' => 'void const',
                                       'Type' => 'Const'
                                     },
                          '18104' => {
                                       'BaseType' => '18115',
                                       'Header' => 'serf_bucket_util.h',
                                       'Line' => '201',
                                       'Name' => 'serf_databuf_reader_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '18115' => {
                                       'Name' => 'apr_status_t(*)(void*, apr_size_t, char*, apr_size_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '334'
                                                           },
                                                    '2' => {
                                                             'type' => '236'
                                                           },
                                                    '3' => {
                                                             'type' => '1220'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '18233' => {
                                       'Header' => 'serf_bucket_util.h',
                                       'Line' => '234',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'current',
                                                            'offset' => '0',
                                                            'type' => '369'
                                                          },
                                                   '1' => {
                                                            'name' => 'remaining',
                                                            'offset' => '8',
                                                            'type' => '334'
                                                          },
                                                   '2' => {
                                                            'name' => 'read',
                                                            'offset' => '16',
                                                            'type' => '18104'
                                                          },
                                                   '3' => {
                                                            'name' => 'read_baton',
                                                            'offset' => '24',
                                                            'type' => '234'
                                                          },
                                                   '4' => {
                                                            'name' => 'status',
                                                            'offset' => '32',
                                                            'type' => '358'
                                                          },
                                                   '5' => {
                                                            'name' => 'buf',
                                                            'offset' => '36',
                                                            'type' => '18068'
                                                          }
                                                 },
                                       'Name' => 'struct serf_databuf_t',
                                       'Size' => '8040',
                                       'Type' => 'Struct'
                                     },
                          '18371' => {
                                       'BaseType' => '18233',
                                       'Name' => 'serf_databuf_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '184' => {
                                     'Name' => 'short',
                                     'Size' => '2',
                                     'Type' => 'Intrinsic'
                                   },
                          '191' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '198' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '205' => {
                                     'BaseType' => '198',
                                     'Header' => 'types.h',
                                     'Line' => '131',
                                     'Name' => '__off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '20622' => {
                                       'BaseType' => '18085',
                                       'Name' => 'serf_linebuf_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '234' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '236' => {
                                     'BaseType' => '242',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '242' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '249' => {
                                     'BaseType' => '205',
                                     'Header' => 'types.h',
                                     'Line' => '86',
                                     'Name' => 'off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '260' => {
                                     'BaseType' => '170',
                                     'Header' => 'stddef.h',
                                     'Line' => '212',
                                     'Name' => 'size_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '26715' => {
                                       'BaseType' => '26726',
                                       'Header' => 'apr_mmap.h',
                                       'Line' => '51',
                                       'Name' => 'apr_mmap_t',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '26726' => {
                                       'Header' => 'apr_mmap.h',
                                       'Line' => '62',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cntxt',
                                                            'offset' => '0',
                                                            'type' => '4575'
                                                          },
                                                   '1' => {
                                                            'name' => 'mm',
                                                            'offset' => '8',
                                                            'type' => '234'
                                                          },
                                                   '2' => {
                                                            'name' => 'size',
                                                            'offset' => '16',
                                                            'type' => '334'
                                                          },
                                                   '3' => {
                                                            'name' => 'link',
                                                            'offset' => '24',
                                                            'type' => '26786'
                                                          }
                                                 },
                                       'Name' => 'struct apr_mmap_t',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '26786' => {
                                       'Header' => 'apr_mmap.h',
                                       'Line' => '85',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '26819'
                                                          },
                                                   '1' => {
                                                            'name' => 'prev',
                                                            'offset' => '8',
                                                            'type' => '26819'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-apr_mmap.h-85',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '26819' => {
                                       'BaseType' => '28016',
                                       'Name' => 'struct apr_mmap_t*volatile',
                                       'Size' => '8',
                                       'Type' => 'Volatile'
                                     },
                          '28016' => {
                                       'BaseType' => '26715',
                                       'Name' => 'apr_mmap_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '285' => {
                                     'Header' => 'uio.h',
                                     'Line' => '43',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'iov_base',
                                                          'offset' => '0',
                                                          'type' => '234'
                                                        },
                                                 '1' => {
                                                          'name' => 'iov_len',
                                                          'offset' => '8',
                                                          'type' => '260'
                                                        }
                                               },
                                     'Name' => 'struct iovec',
                                     'PrivateABI' => 1,
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '322' => {
                                     'BaseType' => '285',
                                     'Name' => 'struct iovec*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '328' => {
                                     'BaseType' => '191',
                                     'Name' => 'int*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '334' => {
                                     'BaseType' => '260',
                                     'Header' => 'apr.h',
                                     'Line' => '356',
                                     'Name' => 'apr_size_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '33914' => {
                                       'BaseType' => '170',
                                       'Header' => 'apr.h',
                                       'Line' => '353',
                                       'Name' => 'apr_uint64_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '346' => {
                                     'BaseType' => '249',
                                     'Header' => 'apr.h',
                                     'Line' => '358',
                                     'Name' => 'apr_off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '358' => {
                                     'BaseType' => '191',
                                     'Header' => 'apr_errno.h',
                                     'Line' => '44',
                                     'Name' => 'apr_status_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '369' => {
                                     'BaseType' => '375',
                                     'Name' => 'char const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '375' => {
                                     'BaseType' => '242',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '37521' => {
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '95',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'version',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'code',
                                                            'offset' => '4',
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'name' => 'reason',
                                                            'offset' => '8',
                                                            'type' => '369'
                                                          }
                                                 },
                                       'Name' => 'struct serf_status_line',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '380' => {
                                     'Name' => 'struct apr_file_t',
                                     'PrivateABI' => 1,
                                     'Type' => 'Struct'
                                   },
                          '39935' => {
                                       'BaseType' => '37521',
                                       'Name' => 'serf_status_line*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '41374' => {
                                       'Name' => 'int()(void*, char const*, char const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '369'
                                                           },
                                                    '2' => {
                                                             'type' => '369'
                                                           }
                                                  },
                                       'Return' => '191',
                                       'Type' => 'Func'
                                     },
                          '42488' => {
                                       'BaseType' => '41374',
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '410',
                                       'Name' => 'serf_bucket_headers_do_callback_fn_t',
                                       'Type' => 'Typedef'
                                     },
                          '4501' => {
                                      'BaseType' => '198',
                                      'Header' => 'apr.h',
                                      'Line' => '352',
                                      'Name' => 'apr_int64_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '45014' => {
                                       'BaseType' => '42488',
                                       'Name' => 'serf_bucket_headers_do_callback_fn_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '45555' => {
                                       'BaseType' => '45566',
                                       'Header' => 'apr_allocator.h',
                                       'Line' => '41',
                                       'Name' => 'apr_allocator_t',
                                       'Type' => 'Typedef'
                                     },
                          '45566' => {
                                       'Name' => 'struct apr_allocator_t',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '45571' => {
                                       'BaseType' => '45582',
                                       'Header' => 'apr_allocator.h',
                                       'Line' => '43',
                                       'Name' => 'apr_memnode_t',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '45582' => {
                                       'Header' => 'apr_allocator.h',
                                       'Line' => '54',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '45667'
                                                          },
                                                   '1' => {
                                                            'name' => 'ref',
                                                            'offset' => '8',
                                                            'type' => '45673'
                                                          },
                                                   '2' => {
                                                            'name' => 'index',
                                                            'offset' => '16',
                                                            'type' => '8507'
                                                          },
                                                   '3' => {
                                                            'name' => 'free_index',
                                                            'offset' => '20',
                                                            'type' => '8507'
                                                          },
                                                   '4' => {
                                                            'name' => 'first_avail',
                                                            'offset' => '24',
                                                            'type' => '236'
                                                          },
                                                   '5' => {
                                                            'name' => 'endp',
                                                            'offset' => '32',
                                                            'type' => '236'
                                                          }
                                                 },
                                       'Name' => 'struct apr_memnode_t',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '4559' => {
                                      'BaseType' => '4570',
                                      'Header' => 'apr_pools.h',
                                      'Line' => '60',
                                      'Name' => 'apr_pool_t',
                                      'Type' => 'Typedef'
                                    },
                          '45667' => {
                                       'BaseType' => '45571',
                                       'Name' => 'apr_memnode_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '45673' => {
                                       'BaseType' => '45667',
                                       'Name' => 'apr_memnode_t**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '4570' => {
                                      'Name' => 'struct apr_pool_t',
                                      'PrivateABI' => 1,
                                      'Type' => 'Struct'
                                    },
                          '4575' => {
                                      'BaseType' => '4559',
                                      'Name' => 'apr_pool_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '46890' => {
                                       'BaseType' => '46902',
                                       'Header' => 'serf.h',
                                       'Line' => '958',
                                       'Name' => 'serf_unfreed_func_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '46902' => {
                                       'Name' => 'void(*)(void*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '234'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '46924' => {
                                       'Line' => '26',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '47141'
                                                          },
                                                   '1' => {
                                                            'name' => 'memnode',
                                                            'offset' => '0',
                                                            'type' => '45667'
                                                          }
                                                 },
                                       'Name' => 'anon-union-allocator.c-26',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Source' => 'allocator.c',
                                       'Type' => 'Union'
                                     },
                          '46955' => {
                                       'Line' => '24',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'size',
                                                            'offset' => '0',
                                                            'type' => '334'
                                                          },
                                                   '1' => {
                                                            'name' => 'u',
                                                            'offset' => '8',
                                                            'type' => '46924'
                                                          }
                                                 },
                                       'Name' => 'struct node_header_t',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Source' => 'allocator.c',
                                       'Type' => 'Struct'
                                     },
                          '46996' => {
                                       'BaseType' => '46955',
                                       'Line' => '31',
                                       'Name' => 'node_header_t',
                                       'Size' => '16',
                                       'Source' => 'allocator.c',
                                       'Type' => 'Typedef'
                                     },
                          '47040' => {
                                       'BaseType' => '47046',
                                       'Name' => 'serf_bucket_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '47046' => {
                                       'BaseType' => '969',
                                       'Name' => 'serf_bucket_t const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '47051' => {
                                       'Line' => '71',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'bucket',
                                                            'offset' => '0',
                                                            'type' => '47040'
                                                          },
                                                   '1' => {
                                                            'name' => 'last',
                                                            'offset' => '8',
                                                            'type' => '358'
                                                          }
                                                 },
                                       'Name' => 'struct read_status_t',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Source' => 'allocator.c',
                                       'Type' => 'Struct'
                                     },
                          '47108' => {
                                       'BaseType' => '47051',
                                       'Name' => 'read_status_t[100]',
                                       'Size' => '1600',
                                       'Type' => 'Array'
                                     },
                          '47124' => {
                                       'Line' => '80',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next_index',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'num_used',
                                                            'offset' => '4',
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'name' => 'info',
                                                            'offset' => '8',
                                                            'type' => '47108'
                                                          }
                                                 },
                                       'Name' => 'struct track_state_t',
                                       'PrivateABI' => 1,
                                       'Size' => '1608',
                                       'Source' => 'allocator.c',
                                       'Type' => 'Struct'
                                     },
                          '47135' => {
                                       'BaseType' => '45555',
                                       'Name' => 'apr_allocator_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '47141' => {
                                       'BaseType' => '46996',
                                       'Name' => 'node_header_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '47147' => {
                                       'BaseType' => '47124',
                                       'Name' => 'track_state_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '51408' => {
                                       'BaseType' => '149',
                                       'Name' => 'unsigned char*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '56717' => {
                                       'BaseType' => '198',
                                       'Header' => 'types.h',
                                       'Line' => '139',
                                       'Name' => '__time_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '56728' => {
                                       'BaseType' => '198',
                                       'Header' => 'types.h',
                                       'Line' => '141',
                                       'Name' => '__suseconds_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '56787' => {
                                       'BaseType' => '56717',
                                       'Header' => 'time.h',
                                       'Line' => '75',
                                       'Name' => 'time_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '56809' => {
                                       'Header' => 'time.h',
                                       'Line' => '30',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tv_sec',
                                                            'offset' => '0',
                                                            'type' => '56717'
                                                          },
                                                   '1' => {
                                                            'name' => 'tv_usec',
                                                            'offset' => '8',
                                                            'type' => '56728'
                                                          }
                                                 },
                                       'Name' => 'struct timeval',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '56915' => {
                                       'Name' => 'void(*)()',
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '58425' => {
                                       'BaseType' => '58436',
                                       'Header' => 'apr_hash.h',
                                       'Line' => '52',
                                       'Name' => 'apr_hash_t',
                                       'Type' => 'Typedef'
                                     },
                          '58436' => {
                                       'Name' => 'struct apr_hash_t',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '58448' => {
                                       'BaseType' => '58460',
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '491',
                                       'Name' => 'serf_ssl_context_t',
                                       'Size' => '16328',
                                       'Type' => 'Typedef'
                                     },
                          '58460' => {
                                       'Line' => '141',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'refcount',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'pool',
                                                            'offset' => '8',
                                                            'type' => '4575'
                                                          },
                                                   '10' => {
                                                             'name' => 'cert_cache_pool',
                                                             'offset' => '16224',
                                                             'type' => '4575'
                                                           },
                                                   '11' => {
                                                             'name' => 'cert_file_success',
                                                             'offset' => '16232',
                                                             'type' => '369'
                                                           },
                                                   '12' => {
                                                             'name' => 'cert_pw_callback',
                                                             'offset' => '16240',
                                                             'type' => '58866'
                                                           },
                                                   '13' => {
                                                             'name' => 'cert_pw_userdata',
                                                             'offset' => '16248',
                                                             'type' => '234'
                                                           },
                                                   '14' => {
                                                             'name' => 'cert_pw_cache_pool',
                                                             'offset' => '16256',
                                                             'type' => '4575'
                                                           },
                                                   '15' => {
                                                             'name' => 'cert_pw_success',
                                                             'offset' => '16264',
                                                             'type' => '369'
                                                           },
                                                   '16' => {
                                                             'name' => 'server_cert_callback',
                                                             'offset' => '16272',
                                                             'type' => '58909'
                                                           },
                                                   '17' => {
                                                             'name' => 'server_cert_chain_callback',
                                                             'offset' => '16280',
                                                             'type' => '58963'
                                                           },
                                                   '18' => {
                                                             'name' => 'server_cert_userdata',
                                                             'offset' => '16288',
                                                             'type' => '234'
                                                           },
                                                   '19' => {
                                                             'name' => 'cert_path',
                                                             'offset' => '16296',
                                                             'type' => '369'
                                                           },
                                                   '2' => {
                                                            'name' => 'allocator',
                                                            'offset' => '16',
                                                            'type' => '1463'
                                                          },
                                                   '20' => {
                                                             'name' => 'cached_cert',
                                                             'offset' => '16304',
                                                             'type' => '67865'
                                                           },
                                                   '21' => {
                                                             'name' => 'cached_cert_pw',
                                                             'offset' => '16312',
                                                             'type' => '69496'
                                                           },
                                                   '22' => {
                                                             'name' => 'pending_err',
                                                             'offset' => '16320',
                                                             'type' => '358'
                                                           },
                                                   '23' => {
                                                             'name' => 'fatal_err',
                                                             'offset' => '16324',
                                                             'type' => '358'
                                                           },
                                                   '3' => {
                                                            'name' => 'ctx',
                                                            'offset' => '24',
                                                            'type' => '73344'
                                                          },
                                                   '4' => {
                                                            'name' => 'ssl',
                                                            'offset' => '32',
                                                            'type' => '72973'
                                                          },
                                                   '5' => {
                                                            'name' => 'bio',
                                                            'offset' => '40',
                                                            'type' => '66768'
                                                          },
                                                   '6' => {
                                                            'name' => 'encrypt',
                                                            'offset' => '48',
                                                            'type' => '78468'
                                                          },
                                                   '7' => {
                                                            'name' => 'decrypt',
                                                            'offset' => '8128',
                                                            'type' => '78468'
                                                          },
                                                   '8' => {
                                                            'name' => 'cert_callback',
                                                            'offset' => '16208',
                                                            'type' => '58828'
                                                          },
                                                   '9' => {
                                                            'name' => 'cert_userdata',
                                                            'offset' => '16216',
                                                            'type' => '234'
                                                          }
                                                 },
                                       'Name' => 'struct serf_ssl_context_t',
                                       'PrivateABI' => 1,
                                       'Size' => '16328',
                                       'Source' => 'ssl_buckets.c',
                                       'Type' => 'Struct'
                                     },
                          '58779' => {
                                       'BaseType' => '58791',
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '492',
                                       'Name' => 'serf_ssl_certificate_t',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '58791' => {
                                       'Line' => '199',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ssl_cert',
                                                            'offset' => '0',
                                                            'type' => '67865'
                                                          },
                                                   '1' => {
                                                            'name' => 'depth',
                                                            'offset' => '8',
                                                            'type' => '191'
                                                          }
                                                 },
                                       'Name' => 'struct serf_ssl_certificate_t',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Source' => 'ssl_buckets.c',
                                       'Type' => 'Struct'
                                     },
                          '58828' => {
                                       'BaseType' => '58840',
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '494',
                                       'Name' => 'serf_ssl_need_client_cert_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '58840' => {
                                       'Name' => 'apr_status_t(*)(void*, char const**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '1214'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '58866' => {
                                       'BaseType' => '58878',
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '498',
                                       'Name' => 'serf_ssl_need_cert_password_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '58878' => {
                                       'Name' => 'apr_status_t(*)(void*, char const*, char const**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '369'
                                                           },
                                                    '2' => {
                                                             'type' => '1214'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '58909' => {
                                       'BaseType' => '58921',
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '503',
                                       'Name' => 'serf_ssl_need_server_cert_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '58921' => {
                                       'Name' => 'apr_status_t(*)(void*, int, serf_ssl_certificate_t const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '191'
                                                           },
                                                    '2' => {
                                                             'type' => '58952'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '58952' => {
                                       'BaseType' => '58958',
                                       'Name' => 'serf_ssl_certificate_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '58958' => {
                                       'BaseType' => '58779',
                                       'Name' => 'serf_ssl_certificate_t const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '58963' => {
                                       'BaseType' => '58975',
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '508',
                                       'Name' => 'serf_ssl_server_cert_chain_cb_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '58975' => {
                                       'Name' => 'apr_status_t(*)(void*, int, int, serf_ssl_certificate_t const*const*, apr_size_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '191'
                                                           },
                                                    '2' => {
                                                             'type' => '191'
                                                           },
                                                    '3' => {
                                                             'type' => '59016'
                                                           },
                                                    '4' => {
                                                             'type' => '334'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '59016' => {
                                       'BaseType' => '59022',
                                       'Name' => 'serf_ssl_certificate_t const*const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '59022' => {
                                       'BaseType' => '58952',
                                       'Name' => 'serf_ssl_certificate_t const*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '59173' => {
                                       'Name' => 'int(*)(void const*, void const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '18097'
                                                           },
                                                    '1' => {
                                                             'type' => '18097'
                                                           }
                                                  },
                                       'Return' => '191',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '59199' => {
                                       'Header' => 'stack.h',
                                       'Line' => '66',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'num',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'data',
                                                            'offset' => '8',
                                                            'type' => '11884'
                                                          },
                                                   '2' => {
                                                            'name' => 'sorted',
                                                            'offset' => '16',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'num_alloc',
                                                            'offset' => '20',
                                                            'type' => '191'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp',
                                                            'offset' => '24',
                                                            'type' => '59173'
                                                          }
                                                 },
                                       'Name' => 'struct stack_st',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '59272' => {
                                       'BaseType' => '59199',
                                       'Header' => 'stack.h',
                                       'Line' => '72',
                                       'Name' => '_STACK',
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '59283' => {
                                       'BaseType' => '59294',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '83',
                                       'Name' => 'ASN1_INTEGER',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59294' => {
                                       'Header' => 'asn1.h',
                                       'Line' => '239',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'length',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'type',
                                                            'offset' => '4',
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'name' => 'data',
                                                            'offset' => '8',
                                                            'type' => '51408'
                                                          },
                                                   '3' => {
                                                            'name' => 'flags',
                                                            'offset' => '16',
                                                            'type' => '198'
                                                          }
                                                 },
                                       'Name' => 'struct asn1_string_st',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '59355' => {
                                       'BaseType' => '59294',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '84',
                                       'Name' => 'ASN1_ENUMERATED',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59366' => {
                                       'BaseType' => '59294',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '85',
                                       'Name' => 'ASN1_BIT_STRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59377' => {
                                       'BaseType' => '59294',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '86',
                                       'Name' => 'ASN1_OCTET_STRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59388' => {
                                       'BaseType' => '59294',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '87',
                                       'Name' => 'ASN1_PRINTABLESTRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59399' => {
                                       'BaseType' => '59294',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '88',
                                       'Name' => 'ASN1_T61STRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59410' => {
                                       'BaseType' => '59294',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '89',
                                       'Name' => 'ASN1_IA5STRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59421' => {
                                       'BaseType' => '59294',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '90',
                                       'Name' => 'ASN1_GENERALSTRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59432' => {
                                       'BaseType' => '59294',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '91',
                                       'Name' => 'ASN1_UNIVERSALSTRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59443' => {
                                       'BaseType' => '59294',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '92',
                                       'Name' => 'ASN1_BMPSTRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59454' => {
                                       'BaseType' => '59294',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '93',
                                       'Name' => 'ASN1_UTCTIME',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59465' => {
                                       'BaseType' => '59294',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '94',
                                       'Name' => 'ASN1_TIME',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59476' => {
                                       'BaseType' => '59294',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '95',
                                       'Name' => 'ASN1_GENERALIZEDTIME',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59487' => {
                                       'BaseType' => '59294',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '96',
                                       'Name' => 'ASN1_VISIBLESTRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59498' => {
                                       'BaseType' => '59294',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '97',
                                       'Name' => 'ASN1_UTF8STRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59509' => {
                                       'BaseType' => '59294',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '98',
                                       'Name' => 'ASN1_STRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59520' => {
                                       'BaseType' => '191',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '99',
                                       'Name' => 'ASN1_BOOLEAN',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '59531' => {
                                       'BaseType' => '59542',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '103',
                                       'Name' => 'ASN1_OBJECT',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '59542' => {
                                       'Header' => 'asn1.h',
                                       'Line' => '210',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sn',
                                                            'offset' => '0',
                                                            'type' => '369'
                                                          },
                                                   '1' => {
                                                            'name' => 'ln',
                                                            'offset' => '8',
                                                            'type' => '369'
                                                          },
                                                   '2' => {
                                                            'name' => 'nid',
                                                            'offset' => '16',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'length',
                                                            'offset' => '20',
                                                            'type' => '191'
                                                          },
                                                   '4' => {
                                                            'name' => 'data',
                                                            'offset' => '24',
                                                            'type' => '67350'
                                                          },
                                                   '5' => {
                                                            'name' => 'flags',
                                                            'offset' => '32',
                                                            'type' => '191'
                                                          }
                                                 },
                                       'Name' => 'struct asn1_object_st',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '59625' => {
                                       'BaseType' => '59636',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '120',
                                       'Name' => 'BIGNUM',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59636' => {
                                       'Header' => 'bn.h',
                                       'Line' => '313',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'd',
                                                            'offset' => '0',
                                                            'type' => '67205'
                                                          },
                                                   '1' => {
                                                            'name' => 'top',
                                                            'offset' => '8',
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'name' => 'dmax',
                                                            'offset' => '12',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'neg',
                                                            'offset' => '16',
                                                            'type' => '191'
                                                          },
                                                   '4' => {
                                                            'name' => 'flags',
                                                            'offset' => '20',
                                                            'type' => '191'
                                                          }
                                                 },
                                       'Name' => 'struct bignum_st',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '59713' => {
                                       'BaseType' => '59724',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '121',
                                       'Name' => 'BN_CTX',
                                       'Type' => 'Typedef'
                                     },
                          '59724' => {
                                       'Name' => 'struct bignum_ctx',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '59729' => {
                                       'BaseType' => '59740',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '122',
                                       'Name' => 'BN_BLINDING',
                                       'Type' => 'Typedef'
                                     },
                          '59740' => {
                                       'Name' => 'struct bn_blinding_st',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '59745' => {
                                       'BaseType' => '59756',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '123',
                                       'Name' => 'BN_MONT_CTX',
                                       'Size' => '104',
                                       'Type' => 'Typedef'
                                     },
                          '59756' => {
                                       'Header' => 'bn.h',
                                       'Line' => '324',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ri',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'RR',
                                                            'offset' => '8',
                                                            'type' => '59625'
                                                          },
                                                   '2' => {
                                                            'name' => 'N',
                                                            'offset' => '32',
                                                            'type' => '59625'
                                                          },
                                                   '3' => {
                                                            'name' => 'Ni',
                                                            'offset' => '56',
                                                            'type' => '59625'
                                                          },
                                                   '4' => {
                                                            'name' => 'n0',
                                                            'offset' => '80',
                                                            'type' => '67211'
                                                          },
                                                   '5' => {
                                                            'name' => 'flags',
                                                            'offset' => '96',
                                                            'type' => '191'
                                                          }
                                                 },
                                       'Name' => 'struct bn_mont_ctx_st',
                                       'PrivateABI' => 1,
                                       'Size' => '104',
                                       'Type' => 'Struct'
                                     },
                          '59842' => {
                                       'BaseType' => '59853',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '125',
                                       'Name' => 'BN_GENCB',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59853' => {
                                       'Header' => 'bn.h',
                                       'Line' => '349',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ver',
                                                            'offset' => '0',
                                                            'type' => '163'
                                                          },
                                                   '1' => {
                                                            'name' => 'arg',
                                                            'offset' => '8',
                                                            'type' => '234'
                                                          },
                                                   '2' => {
                                                            'name' => 'cb',
                                                            'offset' => '16',
                                                            'type' => '67227'
                                                          }
                                                 },
                                       'Name' => 'struct bn_gencb_st',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '59905' => {
                                       'BaseType' => '59916',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '127',
                                       'Name' => 'BUF_MEM',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '59916' => {
                                       'Header' => 'buffer.h',
                                       'Line' => '77',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'length',
                                                            'offset' => '0',
                                                            'type' => '260'
                                                          },
                                                   '1' => {
                                                            'name' => 'data',
                                                            'offset' => '8',
                                                            'type' => '236'
                                                          },
                                                   '2' => {
                                                            'name' => 'max',
                                                            'offset' => '16',
                                                            'type' => '260'
                                                          }
                                                 },
                                       'Name' => 'struct buf_mem_st',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '59965' => {
                                       'BaseType' => '59976',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '129',
                                       'Name' => 'EVP_CIPHER',
                                       'Size' => '88',
                                       'Type' => 'Typedef'
                                     },
                          '59976' => {
                                       'Header' => 'evp.h',
                                       'Line' => '311',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'nid',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'block_size',
                                                            'offset' => '4',
                                                            'type' => '191'
                                                          },
                                                   '10' => {
                                                             'name' => 'get_asn1_parameters',
                                                             'offset' => '64',
                                                             'type' => '68450'
                                                           },
                                                   '11' => {
                                                             'name' => 'ctrl',
                                                             'offset' => '72',
                                                             'type' => '68486'
                                                           },
                                                   '12' => {
                                                             'name' => 'app_data',
                                                             'offset' => '80',
                                                             'type' => '234'
                                                           },
                                                   '2' => {
                                                            'name' => 'key_len',
                                                            'offset' => '8',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'iv_len',
                                                            'offset' => '12',
                                                            'type' => '191'
                                                          },
                                                   '4' => {
                                                            'name' => 'flags',
                                                            'offset' => '16',
                                                            'type' => '170'
                                                          },
                                                   '5' => {
                                                            'name' => 'init',
                                                            'offset' => '24',
                                                            'type' => '68361'
                                                          },
                                                   '6' => {
                                                            'name' => 'do_cipher',
                                                            'offset' => '32',
                                                            'type' => '68397'
                                                          },
                                                   '7' => {
                                                            'name' => 'cleanup',
                                                            'offset' => '40',
                                                            'type' => '68418'
                                                          },
                                                   '8' => {
                                                            'name' => 'ctx_size',
                                                            'offset' => '48',
                                                            'type' => '191'
                                                          },
                                                   '9' => {
                                                            'name' => 'set_asn1_parameters',
                                                            'offset' => '56',
                                                            'type' => '68450'
                                                          }
                                                 },
                                       'Name' => 'struct evp_cipher_st',
                                       'PrivateABI' => 1,
                                       'Size' => '88',
                                       'Type' => 'Struct'
                                     },
                          '60159' => {
                                       'BaseType' => '60170',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '130',
                                       'Name' => 'EVP_CIPHER_CTX',
                                       'Size' => '168',
                                       'Type' => 'Typedef'
                                     },
                          '60170' => {
                                       'Header' => 'evp.h',
                                       'Line' => '452',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cipher',
                                                            'offset' => '0',
                                                            'type' => '68492'
                                                          },
                                                   '1' => {
                                                            'name' => 'engine',
                                                            'offset' => '8',
                                                            'type' => '68000'
                                                          },
                                                   '10' => {
                                                             'name' => 'flags',
                                                             'offset' => '112',
                                                             'type' => '170'
                                                           },
                                                   '11' => {
                                                             'name' => 'cipher_data',
                                                             'offset' => '120',
                                                             'type' => '234'
                                                           },
                                                   '12' => {
                                                             'name' => 'final_used',
                                                             'offset' => '128',
                                                             'type' => '191'
                                                           },
                                                   '13' => {
                                                             'name' => 'block_mask',
                                                             'offset' => '132',
                                                             'type' => '191'
                                                           },
                                                   '14' => {
                                                             'name' => 'final',
                                                             'offset' => '136',
                                                             'type' => '68519'
                                                           },
                                                   '2' => {
                                                            'name' => 'encrypt',
                                                            'offset' => '16',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'buf_len',
                                                            'offset' => '20',
                                                            'type' => '191'
                                                          },
                                                   '4' => {
                                                            'name' => 'oiv',
                                                            'offset' => '24',
                                                            'type' => '68503'
                                                          },
                                                   '5' => {
                                                            'name' => 'iv',
                                                            'offset' => '40',
                                                            'type' => '68503'
                                                          },
                                                   '6' => {
                                                            'name' => 'buf',
                                                            'offset' => '56',
                                                            'type' => '68519'
                                                          },
                                                   '7' => {
                                                            'name' => 'num',
                                                            'offset' => '88',
                                                            'type' => '191'
                                                          },
                                                   '8' => {
                                                            'name' => 'app_data',
                                                            'offset' => '96',
                                                            'type' => '234'
                                                          },
                                                   '9' => {
                                                            'name' => 'key_len',
                                                            'offset' => '104',
                                                            'type' => '191'
                                                          }
                                                 },
                                       'Name' => 'struct evp_cipher_ctx_st',
                                       'PrivateABI' => 1,
                                       'Size' => '168',
                                       'Type' => 'Struct'
                                     },
                          '60378' => {
                                       'BaseType' => '60389',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '131',
                                       'Name' => 'EVP_MD',
                                       'Size' => '120',
                                       'Type' => 'Typedef'
                                     },
                          '60389' => {
                                       'Header' => 'evp.h',
                                       'Line' => '164',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'pkey_type',
                                                            'offset' => '4',
                                                            'type' => '191'
                                                          },
                                                   '10' => {
                                                             'name' => 'verify',
                                                             'offset' => '72',
                                                             'type' => '68250'
                                                           },
                                                   '11' => {
                                                             'name' => 'required_pkey_type',
                                                             'offset' => '80',
                                                             'type' => '68256'
                                                           },
                                                   '12' => {
                                                             'name' => 'block_size',
                                                             'offset' => '100',
                                                             'type' => '191'
                                                           },
                                                   '13' => {
                                                             'name' => 'ctx_size',
                                                             'offset' => '104',
                                                             'type' => '191'
                                                           },
                                                   '14' => {
                                                             'name' => 'md_ctrl',
                                                             'offset' => '112',
                                                             'type' => '68302'
                                                           },
                                                   '2' => {
                                                            'name' => 'md_size',
                                                            'offset' => '8',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'flags',
                                                            'offset' => '16',
                                                            'type' => '170'
                                                          },
                                                   '4' => {
                                                            'name' => 'init',
                                                            'offset' => '24',
                                                            'type' => '68058'
                                                          },
                                                   '5' => {
                                                            'name' => 'update',
                                                            'offset' => '32',
                                                            'type' => '68089'
                                                          },
                                                   '6' => {
                                                            'name' => 'final',
                                                            'offset' => '40',
                                                            'type' => '68115'
                                                          },
                                                   '7' => {
                                                            'name' => 'copy',
                                                            'offset' => '48',
                                                            'type' => '68152'
                                                          },
                                                   '8' => {
                                                            'name' => 'cleanup',
                                                            'offset' => '56',
                                                            'type' => '68058'
                                                          },
                                                   '9' => {
                                                            'name' => 'sign',
                                                            'offset' => '64',
                                                            'type' => '68204'
                                                          }
                                                 },
                                       'Name' => 'struct env_md_st',
                                       'PrivateABI' => 1,
                                       'Size' => '120',
                                       'Type' => 'Struct'
                                     },
                          '60582' => {
                                       'BaseType' => '60593',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '132',
                                       'Name' => 'EVP_MD_CTX',
                                       'Size' => '48',
                                       'Type' => 'Typedef'
                                     },
                          '60593' => {
                                       'Header' => 'evp.h',
                                       'Line' => '272',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'digest',
                                                            'offset' => '0',
                                                            'type' => '68308'
                                                          },
                                                   '1' => {
                                                            'name' => 'engine',
                                                            'offset' => '8',
                                                            'type' => '68000'
                                                          },
                                                   '2' => {
                                                            'name' => 'flags',
                                                            'offset' => '16',
                                                            'type' => '170'
                                                          },
                                                   '3' => {
                                                            'name' => 'md_data',
                                                            'offset' => '24',
                                                            'type' => '234'
                                                          },
                                                   '4' => {
                                                            'name' => 'pctx',
                                                            'offset' => '32',
                                                            'type' => '68319'
                                                          },
                                                   '5' => {
                                                            'name' => 'update',
                                                            'offset' => '40',
                                                            'type' => '68089'
                                                          }
                                                 },
                                       'Name' => 'struct env_md_ctx_st',
                                       'PrivateABI' => 1,
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '60685' => {
                                       'BaseType' => '60696',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '133',
                                       'Name' => 'EVP_PKEY',
                                       'Size' => '56',
                                       'Type' => 'Typedef'
                                     },
                          '60696' => {
                                       'Header' => 'evp.h',
                                       'Line' => '133',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'save_type',
                                                            'offset' => '4',
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'name' => 'references',
                                                            'offset' => '8',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'ameth',
                                                            'offset' => '16',
                                                            'type' => '67989'
                                                          },
                                                   '4' => {
                                                            'name' => 'engine',
                                                            'offset' => '24',
                                                            'type' => '68000'
                                                          },
                                                   '5' => {
                                                            'name' => 'pkey',
                                                            'offset' => '32',
                                                            'type' => '67898'
                                                          },
                                                   '6' => {
                                                            'name' => 'save_parameters',
                                                            'offset' => '40',
                                                            'type' => '191'
                                                          },
                                                   '7' => {
                                                            'name' => 'attributes',
                                                            'offset' => '48',
                                                            'type' => '68031'
                                                          }
                                                 },
                                       'Name' => 'struct evp_pkey_st',
                                       'PrivateABI' => 1,
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '60805' => {
                                       'BaseType' => '60816',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '135',
                                       'Name' => 'EVP_PKEY_ASN1_METHOD',
                                       'Type' => 'Typedef'
                                     },
                          '60816' => {
                                       'Name' => 'struct evp_pkey_asn1_method_st',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '60821' => {
                                       'BaseType' => '60832',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '138',
                                       'Name' => 'EVP_PKEY_CTX',
                                       'Type' => 'Typedef'
                                     },
                          '60832' => {
                                       'Name' => 'struct evp_pkey_ctx_st',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '60837' => {
                                       'BaseType' => '60847',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '140',
                                       'Name' => 'DH',
                                       'Size' => '144',
                                       'Type' => 'Typedef'
                                     },
                          '60847' => {
                                       'Header' => 'dh.h',
                                       'Line' => '138',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pad',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '4',
                                                            'type' => '191'
                                                          },
                                                   '10' => {
                                                             'name' => 'j',
                                                             'offset' => '72',
                                                             'type' => '68547'
                                                           },
                                                   '11' => {
                                                             'name' => 'seed',
                                                             'offset' => '80',
                                                             'type' => '51408'
                                                           },
                                                   '12' => {
                                                             'name' => 'seedlen',
                                                             'offset' => '88',
                                                             'type' => '191'
                                                           },
                                                   '13' => {
                                                             'name' => 'counter',
                                                             'offset' => '96',
                                                             'type' => '68547'
                                                           },
                                                   '14' => {
                                                             'name' => 'references',
                                                             'offset' => '104',
                                                             'type' => '191'
                                                           },
                                                   '15' => {
                                                             'name' => 'ex_data',
                                                             'offset' => '112',
                                                             'type' => '66209'
                                                           },
                                                   '16' => {
                                                             'name' => 'meth',
                                                             'offset' => '128',
                                                             'type' => '69044'
                                                           },
                                                   '17' => {
                                                             'name' => 'engine',
                                                             'offset' => '136',
                                                             'type' => '68000'
                                                           },
                                                   '2' => {
                                                            'name' => 'p',
                                                            'offset' => '8',
                                                            'type' => '68547'
                                                          },
                                                   '3' => {
                                                            'name' => 'g',
                                                            'offset' => '16',
                                                            'type' => '68547'
                                                          },
                                                   '4' => {
                                                            'name' => 'length',
                                                            'offset' => '24',
                                                            'type' => '198'
                                                          },
                                                   '5' => {
                                                            'name' => 'pub_key',
                                                            'offset' => '32',
                                                            'type' => '68547'
                                                          },
                                                   '6' => {
                                                            'name' => 'priv_key',
                                                            'offset' => '40',
                                                            'type' => '68547'
                                                          },
                                                   '7' => {
                                                            'name' => 'flags',
                                                            'offset' => '48',
                                                            'type' => '191'
                                                          },
                                                   '8' => {
                                                            'name' => 'method_mont_p',
                                                            'offset' => '56',
                                                            'type' => '68693'
                                                          },
                                                   '9' => {
                                                            'name' => 'q',
                                                            'offset' => '64',
                                                            'type' => '68547'
                                                          }
                                                 },
                                       'Name' => 'struct dh_st',
                                       'PrivateABI' => 1,
                                       'Size' => '144',
                                       'Type' => 'Struct'
                                     },
                          '61068' => {
                                       'BaseType' => '61079',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '141',
                                       'Name' => 'DH_METHOD',
                                       'Size' => '72',
                                       'Type' => 'Typedef'
                                     },
                          '61079' => {
                                       'Header' => 'dh.h',
                                       'Line' => '120',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '369'
                                                          },
                                                   '1' => {
                                                            'name' => 'generate_key',
                                                            'offset' => '8',
                                                            'type' => '68909'
                                                          },
                                                   '2' => {
                                                            'name' => 'compute_key',
                                                            'offset' => '16',
                                                            'type' => '68940'
                                                          },
                                                   '3' => {
                                                            'name' => 'bn_mod_exp',
                                                            'offset' => '24',
                                                            'type' => '69002'
                                                          },
                                                   '4' => {
                                                            'name' => 'init',
                                                            'offset' => '32',
                                                            'type' => '68909'
                                                          },
                                                   '5' => {
                                                            'name' => 'finish',
                                                            'offset' => '40',
                                                            'type' => '68909'
                                                          },
                                                   '6' => {
                                                            'name' => 'flags',
                                                            'offset' => '48',
                                                            'type' => '191'
                                                          },
                                                   '7' => {
                                                            'name' => 'app_data',
                                                            'offset' => '56',
                                                            'type' => '236'
                                                          },
                                                   '8' => {
                                                            'name' => 'generate_params',
                                                            'offset' => '64',
                                                            'type' => '69038'
                                                          }
                                                 },
                                       'Name' => 'struct dh_method',
                                       'PrivateABI' => 1,
                                       'Size' => '72',
                                       'Type' => 'Struct'
                                     },
                          '61200' => {
                                       'BaseType' => '61211',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '143',
                                       'Name' => 'DSA',
                                       'Size' => '136',
                                       'Type' => 'Typedef'
                                     },
                          '61211' => {
                                       'Header' => 'dsa.h',
                                       'Line' => '158',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pad',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '8',
                                                            'type' => '198'
                                                          },
                                                   '10' => {
                                                             'name' => 'flags',
                                                             'offset' => '80',
                                                             'type' => '191'
                                                           },
                                                   '11' => {
                                                             'name' => 'method_mont_p',
                                                             'offset' => '88',
                                                             'type' => '68693'
                                                           },
                                                   '12' => {
                                                             'name' => 'references',
                                                             'offset' => '96',
                                                             'type' => '191'
                                                           },
                                                   '13' => {
                                                             'name' => 'ex_data',
                                                             'offset' => '104',
                                                             'type' => '66209'
                                                           },
                                                   '14' => {
                                                             'name' => 'meth',
                                                             'offset' => '120',
                                                             'type' => '69404'
                                                           },
                                                   '15' => {
                                                             'name' => 'engine',
                                                             'offset' => '128',
                                                             'type' => '68000'
                                                           },
                                                   '2' => {
                                                            'name' => 'write_params',
                                                            'offset' => '16',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'p',
                                                            'offset' => '24',
                                                            'type' => '68547'
                                                          },
                                                   '4' => {
                                                            'name' => 'q',
                                                            'offset' => '32',
                                                            'type' => '68547'
                                                          },
                                                   '5' => {
                                                            'name' => 'g',
                                                            'offset' => '40',
                                                            'type' => '68547'
                                                          },
                                                   '6' => {
                                                            'name' => 'pub_key',
                                                            'offset' => '48',
                                                            'type' => '68547'
                                                          },
                                                   '7' => {
                                                            'name' => 'priv_key',
                                                            'offset' => '56',
                                                            'type' => '68547'
                                                          },
                                                   '8' => {
                                                            'name' => 'kinv',
                                                            'offset' => '64',
                                                            'type' => '68547'
                                                          },
                                                   '9' => {
                                                            'name' => 'r',
                                                            'offset' => '72',
                                                            'type' => '68547'
                                                          }
                                                 },
                                       'Name' => 'struct dsa_st',
                                       'PrivateABI' => 1,
                                       'Size' => '136',
                                       'Type' => 'Struct'
                                     },
                          '61408' => {
                                       'BaseType' => '61419',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '144',
                                       'Name' => 'DSA_METHOD',
                                       'Size' => '96',
                                       'Type' => 'Typedef'
                                     },
                          '61419' => {
                                       'Header' => 'dsa.h',
                                       'Line' => '132',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '369'
                                                          },
                                                   '1' => {
                                                            'name' => 'dsa_do_sign',
                                                            'offset' => '8',
                                                            'type' => '69136'
                                                          },
                                                   '10' => {
                                                             'name' => 'dsa_paramgen',
                                                             'offset' => '80',
                                                             'type' => '69398'
                                                           },
                                                   '11' => {
                                                             'name' => 'dsa_keygen',
                                                             'offset' => '88',
                                                             'type' => '69347'
                                                           },
                                                   '2' => {
                                                            'name' => 'dsa_sign_setup',
                                                            'offset' => '16',
                                                            'type' => '69178'
                                                          },
                                                   '3' => {
                                                            'name' => 'dsa_do_verify',
                                                            'offset' => '24',
                                                            'type' => '69214'
                                                          },
                                                   '4' => {
                                                            'name' => 'dsa_mod_exp',
                                                            'offset' => '32',
                                                            'type' => '69275'
                                                          },
                                                   '5' => {
                                                            'name' => 'bn_mod_exp',
                                                            'offset' => '40',
                                                            'type' => '69326'
                                                          },
                                                   '6' => {
                                                            'name' => 'init',
                                                            'offset' => '48',
                                                            'type' => '69347'
                                                          },
                                                   '7' => {
                                                            'name' => 'finish',
                                                            'offset' => '56',
                                                            'type' => '69347'
                                                          },
                                                   '8' => {
                                                            'name' => 'flags',
                                                            'offset' => '64',
                                                            'type' => '191'
                                                          },
                                                   '9' => {
                                                            'name' => 'app_data',
                                                            'offset' => '72',
                                                            'type' => '236'
                                                          }
                                                 },
                                       'Name' => 'struct dsa_method',
                                       'PrivateABI' => 1,
                                       'Size' => '96',
                                       'Type' => 'Struct'
                                     },
                          '61576' => {
                                       'BaseType' => '61587',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '146',
                                       'Name' => 'RSA',
                                       'Size' => '168',
                                       'Type' => 'Typedef'
                                     },
                          '61587' => {
                                       'Header' => 'rsa.h',
                                       'Line' => '132',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pad',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '8',
                                                            'type' => '198'
                                                          },
                                                   '10' => {
                                                             'name' => 'dmq1',
                                                             'offset' => '80',
                                                             'type' => '68547'
                                                           },
                                                   '11' => {
                                                             'name' => 'iqmp',
                                                             'offset' => '88',
                                                             'type' => '68547'
                                                           },
                                                   '12' => {
                                                             'name' => 'ex_data',
                                                             'offset' => '96',
                                                             'type' => '66209'
                                                           },
                                                   '13' => {
                                                             'name' => 'references',
                                                             'offset' => '112',
                                                             'type' => '191'
                                                           },
                                                   '14' => {
                                                             'name' => 'flags',
                                                             'offset' => '116',
                                                             'type' => '191'
                                                           },
                                                   '15' => {
                                                             'name' => '_method_mod_n',
                                                             'offset' => '120',
                                                             'type' => '68693'
                                                           },
                                                   '16' => {
                                                             'name' => '_method_mod_p',
                                                             'offset' => '128',
                                                             'type' => '68693'
                                                           },
                                                   '17' => {
                                                             'name' => '_method_mod_q',
                                                             'offset' => '136',
                                                             'type' => '68693'
                                                           },
                                                   '18' => {
                                                             'name' => 'bignum_data',
                                                             'offset' => '144',
                                                             'type' => '236'
                                                           },
                                                   '19' => {
                                                             'name' => 'blinding',
                                                             'offset' => '152',
                                                             'type' => '68876'
                                                           },
                                                   '2' => {
                                                            'name' => 'meth',
                                                            'offset' => '16',
                                                            'type' => '68865'
                                                          },
                                                   '20' => {
                                                             'name' => 'mt_blinding',
                                                             'offset' => '160',
                                                             'type' => '68876'
                                                           },
                                                   '3' => {
                                                            'name' => 'engine',
                                                            'offset' => '24',
                                                            'type' => '68000'
                                                          },
                                                   '4' => {
                                                            'name' => 'n',
                                                            'offset' => '32',
                                                            'type' => '68547'
                                                          },
                                                   '5' => {
                                                            'name' => 'e',
                                                            'offset' => '40',
                                                            'type' => '68547'
                                                          },
                                                   '6' => {
                                                            'name' => 'd',
                                                            'offset' => '48',
                                                            'type' => '68547'
                                                          },
                                                   '7' => {
                                                            'name' => 'p',
                                                            'offset' => '56',
                                                            'type' => '68547'
                                                          },
                                                   '8' => {
                                                            'name' => 'q',
                                                            'offset' => '64',
                                                            'type' => '68547'
                                                          },
                                                   '9' => {
                                                            'name' => 'dmp1',
                                                            'offset' => '72',
                                                            'type' => '68547'
                                                          }
                                                 },
                                       'Name' => 'struct rsa_st',
                                       'PrivateABI' => 1,
                                       'Size' => '168',
                                       'Type' => 'Struct'
                                     },
                          '61842' => {
                                       'BaseType' => '61853',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '147',
                                       'Name' => 'RSA_METHOD',
                                       'Size' => '112',
                                       'Type' => 'Typedef'
                                     },
                          '61853' => {
                                       'Header' => 'rsa.h',
                                       'Line' => '85',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '369'
                                                          },
                                                   '1' => {
                                                            'name' => 'rsa_pub_enc',
                                                            'offset' => '8',
                                                            'type' => '68594'
                                                          },
                                                   '10' => {
                                                             'name' => 'app_data',
                                                             'offset' => '80',
                                                             'type' => '236'
                                                           },
                                                   '11' => {
                                                             'name' => 'rsa_sign',
                                                             'offset' => '88',
                                                             'type' => '68777'
                                                           },
                                                   '12' => {
                                                             'name' => 'rsa_verify',
                                                             'offset' => '96',
                                                             'type' => '68823'
                                                           },
                                                   '13' => {
                                                             'name' => 'rsa_keygen',
                                                             'offset' => '104',
                                                             'type' => '68859'
                                                           },
                                                   '2' => {
                                                            'name' => 'rsa_pub_dec',
                                                            'offset' => '16',
                                                            'type' => '68594'
                                                          },
                                                   '3' => {
                                                            'name' => 'rsa_priv_enc',
                                                            'offset' => '24',
                                                            'type' => '68594'
                                                          },
                                                   '4' => {
                                                            'name' => 'rsa_priv_dec',
                                                            'offset' => '32',
                                                            'type' => '68594'
                                                          },
                                                   '5' => {
                                                            'name' => 'rsa_mod_exp',
                                                            'offset' => '40',
                                                            'type' => '68647'
                                                          },
                                                   '6' => {
                                                            'name' => 'bn_mod_exp',
                                                            'offset' => '48',
                                                            'type' => '68699'
                                                          },
                                                   '7' => {
                                                            'name' => 'init',
                                                            'offset' => '56',
                                                            'type' => '68720'
                                                          },
                                                   '8' => {
                                                            'name' => 'finish',
                                                            'offset' => '64',
                                                            'type' => '68720'
                                                          },
                                                   '9' => {
                                                            'name' => 'flags',
                                                            'offset' => '72',
                                                            'type' => '191'
                                                          }
                                                 },
                                       'Name' => 'struct rsa_meth_st',
                                       'PrivateABI' => 1,
                                       'Size' => '112',
                                       'Type' => 'Struct'
                                     },
                          '62034' => {
                                       'BaseType' => '62045',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '154',
                                       'Name' => 'X509',
                                       'Size' => '184',
                                       'Type' => 'Typedef'
                                     },
                          '62045' => {
                                       'Header' => 'x509.h',
                                       'Line' => '270',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cert_info',
                                                            'offset' => '0',
                                                            'type' => '69931'
                                                          },
                                                   '1' => {
                                                            'name' => 'sig_alg',
                                                            'offset' => '8',
                                                            'type' => '68882'
                                                          },
                                                   '10' => {
                                                             'name' => 'ex_kusage',
                                                             'offset' => '80',
                                                             'type' => '170'
                                                           },
                                                   '11' => {
                                                             'name' => 'ex_xkusage',
                                                             'offset' => '88',
                                                             'type' => '170'
                                                           },
                                                   '12' => {
                                                             'name' => 'ex_nscert',
                                                             'offset' => '96',
                                                             'type' => '170'
                                                           },
                                                   '13' => {
                                                             'name' => 'skid',
                                                             'offset' => '104',
                                                             'type' => '67741'
                                                           },
                                                   '14' => {
                                                             'name' => 'akid',
                                                             'offset' => '112',
                                                             'type' => '69937'
                                                           },
                                                   '15' => {
                                                             'name' => 'policy_cache',
                                                             'offset' => '120',
                                                             'type' => '69943'
                                                           },
                                                   '16' => {
                                                             'name' => 'crldp',
                                                             'offset' => '128',
                                                             'type' => '69976'
                                                           },
                                                   '17' => {
                                                             'name' => 'altname',
                                                             'offset' => '136',
                                                             'type' => '70007'
                                                           },
                                                   '18' => {
                                                             'name' => 'nc',
                                                             'offset' => '144',
                                                             'type' => '70013'
                                                           },
                                                   '19' => {
                                                             'name' => 'sha1_hash',
                                                             'offset' => '152',
                                                             'type' => '70019'
                                                           },
                                                   '2' => {
                                                            'name' => 'signature',
                                                            'offset' => '16',
                                                            'type' => '67735'
                                                          },
                                                   '20' => {
                                                             'name' => 'aux',
                                                             'offset' => '176',
                                                             'type' => '70035'
                                                           },
                                                   '3' => {
                                                            'name' => 'valid',
                                                            'offset' => '24',
                                                            'type' => '191'
                                                          },
                                                   '4' => {
                                                            'name' => 'references',
                                                            'offset' => '28',
                                                            'type' => '191'
                                                          },
                                                   '5' => {
                                                            'name' => 'name',
                                                            'offset' => '32',
                                                            'type' => '236'
                                                          },
                                                   '6' => {
                                                            'name' => 'ex_data',
                                                            'offset' => '40',
                                                            'type' => '66209'
                                                          },
                                                   '7' => {
                                                            'name' => 'ex_pathlen',
                                                            'offset' => '56',
                                                            'type' => '198'
                                                          },
                                                   '8' => {
                                                            'name' => 'ex_pcpathlen',
                                                            'offset' => '64',
                                                            'type' => '198'
                                                          },
                                                   '9' => {
                                                            'name' => 'ex_flags',
                                                            'offset' => '72',
                                                            'type' => '170'
                                                          }
                                                 },
                                       'Name' => 'struct x509_st',
                                       'PrivateABI' => 1,
                                       'Size' => '184',
                                       'Type' => 'Struct'
                                     },
                          '62331' => {
                                       'BaseType' => '62342',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '155',
                                       'Name' => 'X509_ALGOR',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '62342' => {
                                       'Header' => 'x509.h',
                                       'Line' => '143',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'algorithm',
                                                            'offset' => '0',
                                                            'type' => '67717'
                                                          },
                                                   '1' => {
                                                            'name' => 'parameter',
                                                            'offset' => '8',
                                                            'type' => '68444'
                                                          }
                                                 },
                                       'Name' => 'struct X509_algor_st',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '62379' => {
                                       'BaseType' => '62390',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '156',
                                       'Name' => 'X509_CRL',
                                       'Size' => '120',
                                       'Type' => 'Typedef'
                                     },
                          '62390' => {
                                       'Header' => 'x509.h',
                                       'Line' => '452',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'crl',
                                                            'offset' => '0',
                                                            'type' => '70231'
                                                          },
                                                   '1' => {
                                                            'name' => 'sig_alg',
                                                            'offset' => '8',
                                                            'type' => '68882'
                                                          },
                                                   '10' => {
                                                             'name' => 'base_crl_number',
                                                             'offset' => '64',
                                                             'type' => '67723'
                                                           },
                                                   '11' => {
                                                             'name' => 'sha1_hash',
                                                             'offset' => '72',
                                                             'type' => '70019'
                                                           },
                                                   '12' => {
                                                             'name' => 'issuers',
                                                             'offset' => '96',
                                                             'type' => '70248'
                                                           },
                                                   '13' => {
                                                             'name' => 'meth',
                                                             'offset' => '104',
                                                             'type' => '70254'
                                                           },
                                                   '14' => {
                                                             'name' => 'meth_data',
                                                             'offset' => '112',
                                                             'type' => '234'
                                                           },
                                                   '2' => {
                                                            'name' => 'signature',
                                                            'offset' => '16',
                                                            'type' => '67735'
                                                          },
                                                   '3' => {
                                                            'name' => 'references',
                                                            'offset' => '24',
                                                            'type' => '191'
                                                          },
                                                   '4' => {
                                                            'name' => 'flags',
                                                            'offset' => '28',
                                                            'type' => '191'
                                                          },
                                                   '5' => {
                                                            'name' => 'akid',
                                                            'offset' => '32',
                                                            'type' => '69937'
                                                          },
                                                   '6' => {
                                                            'name' => 'idp',
                                                            'offset' => '40',
                                                            'type' => '70237'
                                                          },
                                                   '7' => {
                                                            'name' => 'idp_flags',
                                                            'offset' => '48',
                                                            'type' => '191'
                                                          },
                                                   '8' => {
                                                            'name' => 'idp_reasons',
                                                            'offset' => '52',
                                                            'type' => '191'
                                                          },
                                                   '9' => {
                                                            'name' => 'crl_number',
                                                            'offset' => '56',
                                                            'type' => '67723'
                                                          }
                                                 },
                                       'Name' => 'struct X509_crl_st',
                                       'PrivateABI' => 1,
                                       'Size' => '120',
                                       'Type' => 'Struct'
                                     },
                          '62599' => {
                                       'BaseType' => '62610',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '157',
                                       'Name' => 'X509_CRL_METHOD',
                                       'Type' => 'Typedef'
                                     },
                          '62610' => {
                                       'Name' => 'struct x509_crl_method_st',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '62615' => {
                                       'BaseType' => '62626',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '159',
                                       'Name' => 'X509_NAME',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '62626' => {
                                       'Header' => 'x509.h',
                                       'Line' => '179',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entries',
                                                            'offset' => '0',
                                                            'type' => '69575'
                                                          },
                                                   '1' => {
                                                            'name' => 'modified',
                                                            'offset' => '8',
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'name' => 'bytes',
                                                            'offset' => '16',
                                                            'type' => '69581'
                                                          },
                                                   '3' => {
                                                            'name' => 'canon_enc',
                                                            'offset' => '24',
                                                            'type' => '51408'
                                                          },
                                                   '4' => {
                                                            'name' => 'canon_enclen',
                                                            'offset' => '32',
                                                            'type' => '191'
                                                          }
                                                 },
                                       'Name' => 'struct X509_name_st',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '62699' => {
                                       'BaseType' => '62710',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '160',
                                       'Name' => 'X509_PUBKEY',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '62710' => {
                                       'Header' => 'x509.h',
                                       'Line' => '157',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'algor',
                                                            'offset' => '0',
                                                            'type' => '68882'
                                                          },
                                                   '1' => {
                                                            'name' => 'public_key',
                                                            'offset' => '8',
                                                            'type' => '67735'
                                                          },
                                                   '2' => {
                                                            'name' => 'pkey',
                                                            'offset' => '16',
                                                            'type' => '69496'
                                                          }
                                                 },
                                       'Name' => 'struct X509_pubkey_st',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '62759' => {
                                       'BaseType' => '62770',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '161',
                                       'Name' => 'X509_STORE',
                                       'Size' => '144',
                                       'Type' => 'Typedef'
                                     },
                          '62770' => {
                                       'Header' => 'x509_vfy.h',
                                       'Line' => '186',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cache',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'objs',
                                                            'offset' => '8',
                                                            'type' => '70507'
                                                          },
                                                   '10' => {
                                                             'name' => 'check_crl',
                                                             'offset' => '80',
                                                             'type' => '70703'
                                                           },
                                                   '11' => {
                                                             'name' => 'cert_crl',
                                                             'offset' => '88',
                                                             'type' => '70734'
                                                           },
                                                   '12' => {
                                                             'name' => 'lookup_certs',
                                                             'offset' => '96',
                                                             'type' => '70760'
                                                           },
                                                   '13' => {
                                                             'name' => 'lookup_crls',
                                                             'offset' => '104',
                                                             'type' => '70792'
                                                           },
                                                   '14' => {
                                                             'name' => 'cleanup',
                                                             'offset' => '112',
                                                             'type' => '70546'
                                                           },
                                                   '15' => {
                                                             'name' => 'ex_data',
                                                             'offset' => '120',
                                                             'type' => '66209'
                                                           },
                                                   '16' => {
                                                             'name' => 'references',
                                                             'offset' => '136',
                                                             'type' => '191'
                                                           },
                                                   '2' => {
                                                            'name' => 'get_cert_methods',
                                                            'offset' => '16',
                                                            'type' => '70513'
                                                          },
                                                   '3' => {
                                                            'name' => 'param',
                                                            'offset' => '24',
                                                            'type' => '70519'
                                                          },
                                                   '4' => {
                                                            'name' => 'verify',
                                                            'offset' => '32',
                                                            'type' => '70546'
                                                          },
                                                   '5' => {
                                                            'name' => 'verify_cb',
                                                            'offset' => '40',
                                                            'type' => '70572'
                                                          },
                                                   '6' => {
                                                            'name' => 'get_issuer',
                                                            'offset' => '48',
                                                            'type' => '70609'
                                                          },
                                                   '7' => {
                                                            'name' => 'check_issued',
                                                            'offset' => '56',
                                                            'type' => '70640'
                                                          },
                                                   '8' => {
                                                            'name' => 'check_revocation',
                                                            'offset' => '64',
                                                            'type' => '70546'
                                                          },
                                                   '9' => {
                                                            'name' => 'get_crl',
                                                            'offset' => '72',
                                                            'type' => '70677'
                                                          }
                                                 },
                                       'Name' => 'struct x509_store_st',
                                       'PrivateABI' => 1,
                                       'Size' => '144',
                                       'Type' => 'Struct'
                                     },
                          '62987' => {
                                       'BaseType' => '62998',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '162',
                                       'Name' => 'X509_STORE_CTX',
                                       'Size' => '248',
                                       'Type' => 'Typedef'
                                     },
                          '62998' => {
                                       'Header' => 'x509_vfy.h',
                                       'Line' => '236',
