$VAR1 = {
          'ABI_DUMPER_VERSION' => '0.99.19',
          'ABI_DUMP_VERSION' => '3.3',
          'Arch' => 'x86_64',
          'GccVersion' => '4.8.5',
          'Headers' => {
                         'serf.h' => 1,
                         'serf_bucket_types.h' => 1,
                         'serf_bucket_util.h' => 1,
                         'serf_private.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libserf-1.so.0.0.0',
          'LibraryVersion' => '1.1.1',
          'NameSpaces' => {},
          'Needed' => {
                        'libapr-1.so.0' => 1,
                        'libaprutil-1.so.0' => 1,
                        'libc.so.6' => 1,
                        'libcrypto.so.1.0.0' => 1,
                        'libdb-4.8.so' => 1,
                        'libdl.so.2' => 1,
                        'libexpat.so.1' => 1,
                        'liblber-2.4.so.2' => 1,
                        'libldap-2.4.so.2' => 1,
                        'libm.so.6' => 1,
                        'libpthread.so.0' => 1,
                        'librt.so.1' => 1,
                        'libssl.so.1.0.0' => 1,
                        'libz.so.1' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'aggregate_buckets.c' => 1,
                         'allocator.c' => 1,
                         'auth.c' => 1,
                         'barrier_buckets.c' => 1,

                                                   'serf_debug__closed_conn' => 1,
                                                   'serf_debug__entered_loop' => 1,
                                                   'serf_debug__record_read' => 1,
                                                   'serf_default_destroy' => 1,
                                                   'serf_default_destroy_and_data' => 1,
                                                   'serf_default_read_bucket' => 1,
                                                   'serf_default_read_for_sendfile' => 1,
                                                   'serf_default_read_iovec' => 1,
                                                   'serf_error_string' => 1,
                                                   'serf_event_trigger' => 1,
                                                   'serf_incoming_create' => 1,
                                                   'serf_lib_version' => 1,
                                                   'serf_linebuf_fetch' => 1,
                                                   'serf_linebuf_init' => 1,
                                                   'serf_listener_create' => 1,
                                                   'serf_request_bucket_request_create' => 1,
                                                   'serf_request_cancel' => 1,
                                                   'serf_request_get_alloc' => 1,
                                                   'serf_request_get_conn' => 1,
                                                   'serf_request_get_pool' => 1,
                                                   'serf_request_set_handler' => 1,
                                                   'serf_ssl_cert_certificate' => 1,
                                                   'serf_ssl_cert_depth' => 1,
                                                   'serf_ssl_cert_export' => 1,
                                                   'serf_ssl_cert_issuer' => 1,
                                                   'serf_ssl_cert_subject' => 1,
                                                   'serf_ssl_client_cert_password_set' => 1,
                                                   'serf_ssl_client_cert_provider_set' => 1,
                                                   'serf_ssl_load_cert_file' => 1,
                                                   'serf_ssl_server_cert_callback_set' => 1,
                                                   'serf_ssl_server_cert_chain_callback_set' => 1,
                                                   'serf_ssl_set_hostname' => 1,
                                                   'serf_ssl_trust_cert' => 1,
                                                   'serf_ssl_use_default_certificates' => 1,
                                                   'serf_util_readline' => 1
                                                 }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '10119' => {
                                       'Name' => 'struct hostent',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '10124' => {
                                       'BaseType' => '10119',
                                       'Name' => 'struct hostent*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10130' => {
                                       'BaseType' => '10141',
                                       'Header' => 'serf.h',
                                       'Line' => '38',
                                       'Name' => 'serf_context_t',
                                       'Size' => '152',
                                       'Type' => 'Typedef'
                                     },
                          '10141' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '86',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pool',
                                                            'offset' => '0',
                                                            'type' => '4575'
                                                          },
                                                   '1' => {
                                                            'name' => 'pollset_baton',
                                                            'offset' => '8',
                                                            'type' => '234'
                                                          },
                                                   '10' => {
                                                             'name' => 'progress_written',
                                                             'offset' => '80',
                                                             'type' => '346'
                                                           },
                                                   '11' => {
                                                             'name' => 'authn_info',
                                                             'offset' => '88',
                                                             'type' => '12662'
                                                           },
                                                   '12' => {
                                                             'name' => 'proxy_authn_info',
                                                             'offset' => '112',
                                                             'type' => '12662'
                                                           },
                                                   '13' => {
                                                             'name' => 'authn_types',
                                                             'offset' => '136',
                                                             'type' => '191'
                                                           },
                                                   '14' => {
                                                             'name' => 'cred_cb',
                                                             'offset' => '144',
                                                             'type' => '11767'
                                                           },
                                                   '2' => {
                                                            'name' => 'pollset_add',
                                                            'offset' => '16',
                                                            'type' => '11459'
                                                          },
                                                   '3' => {
                                                            'name' => 'pollset_rm',
                                                            'offset' => '24',
                                                            'type' => '11501'
                                                          },
                                                   '4' => {
                                                            'name' => 'dirty_pollset',
                                                            'offset' => '32',
                                                            'type' => '191'
                                                          },
                                                   '5' => {
                                                            'name' => 'conns',
                                                            'offset' => '40',
                                                            'type' => '12673'
                                                          },
                                                   '6' => {
                                                            'name' => 'proxy_address',
                                                            'offset' => '48',
                                                            'type' => '9702'
                                                          },
                                                   '7' => {
                                                            'name' => 'progress_func',
                                                            'offset' => '56',
                                                            'type' => '11512'
                                                          },
                                                   '8' => {
                                                            'name' => 'progress_baton',
                                                            'offset' => '64',
                                                            'type' => '234'
                                                          },
                                                   '9' => {
                                                            'name' => 'progress_read',
                                                            'offset' => '72',
                                                            'type' => '346'
                                                          }
                                                 },
                                       'Name' => 'struct serf_context_t',
                                       'Size' => '152',
                                       'Type' => 'Struct'
                                     },
                          '1033' => {
                                      'BaseType' => '1044',
                                      'Header' => 'serf.h',
                                      'Line' => '41',
                                      'Name' => 'serf_bucket_type_t',
                                      'Size' => '64',
                                      'Type' => 'Typedef'
                                    },
                          '1044' => {
                                      'Header' => 'serf.h',
                                      'Line' => '715',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'name',
                                                           'offset' => '0',
                                                           'type' => '369'
                                                         },
                                                  '1' => {
                                                           'name' => 'read',
                                                           'offset' => '8',
                                                           'type' => '1226'
                                                         },
                                                  '2' => {
                                                           'name' => 'readline',
                                                           'offset' => '16',
                                                           'type' => '1267'
                                                         },
                                                  '3' => {
                                                           'name' => 'read_iovec',
                                                           'offset' => '24',
                                                           'type' => '1308'
                                                         },
                                                  '4' => {
                                                           'name' => 'read_for_sendfile',
                                                           'offset' => '32',
                                                           'type' => '1372'
                                                         },
                                                  '5' => {
                                                           'name' => 'read_bucket',
                                                           'offset' => '40',
                                                           'type' => '1409'
                                                         },
                                                  '6' => {
                                                           'name' => 'peek',
                                                           'offset' => '48',
                                                           'type' => '1440'
                                                         },
                                                  '7' => {
                                                           'name' => 'destroy',
                                                           'offset' => '56',
                                                           'type' => '1457'
                                                         }
                                                },
                                      'Name' => 'struct serf_bucket_type_t',
                                      'Size' => '64',
                                      'Type' => 'Struct'
                                    },
                          '10543' => {
                                       'BaseType' => '10554',
                                       'Header' => 'serf.h',
                                       'Line' => '44',
                                       'Name' => 'serf_connection_t',
                                       'Size' => '16736',
                                       'Type' => 'Typedef'
                                     },
                          '10554' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '148',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ctx',
                                                            'offset' => '0',
                                                            'type' => '11894'
                                                          },
                                                   '1' => {
                                                            'name' => 'status',
                                                            'offset' => '8',
                                                            'type' => '358'
                                                          },
                                                   '10' => {
                                                             'name' => 'dirty_conn',
                                                             'offset' => '76',
                                                             'type' => '191'
                                                           },
                                                   '11' => {
                                                             'name' => 'completed_requests',
                                                             'offset' => '80',
                                                             'type' => '163'
                                                           },
                                                   '12' => {
                                                             'name' => 'completed_responses',
                                                             'offset' => '84',
                                                             'type' => '163'
                                                           },
                                                   '13' => {
                                                             'name' => 'probable_keepalive_limit',
                                                             'offset' => '88',
                                                             'type' => '163'
                                                           },
                                                   '14' => {
                                                             'name' => 'state',
                                                             'offset' => '92',
                                                             'type' => '12712'
                                                           },
                                                   '15' => {
                                                             'name' => 'async_responses',
                                                             'offset' => '96',
                                                             'type' => '191'
                                                           },
                                                   '16' => {
                                                             'name' => 'current_async_response',
                                                             'offset' => '104',
                                                             'type' => '1178'
                                                           },
                                                   '17' => {
                                                             'name' => 'async_acceptor',
                                                             'offset' => '112',
                                                             'type' => '11615'
                                                           },
                                                   '18' => {
                                                             'name' => 'async_acceptor_baton',
                                                             'offset' => '120',
                                                             'type' => '234'
                                                           },
                                                   '19' => {
                                                             'name' => 'async_handler',
                                                             'offset' => '128',
                                                             'type' => '11719'
                                                           },
                                                   '2' => {
                                                            'name' => 'baton',
                                                            'offset' => '16',
                                                            'type' => '12543'
                                                          },
                                                   '20' => {
                                                             'name' => 'async_handler_baton',
                                                             'offset' => '136',
                                                             'type' => '234'
                                                           },
                                                   '21' => {
                                                             'name' => 'stream',
                                                             'offset' => '144',
                                                             'type' => '1178'
                                                           },
                                                   '22' => {
                                                             'name' => 'ostream_head',
                                                             'offset' => '152',
                                                             'type' => '1178'
                                                           },
                                                   '23' => {
                                                             'name' => 'ostream_tail',
                                                             'offset' => '160',
                                                             'type' => '1178'
                                                           },
                                                   '24' => {
                                                             'name' => 'ssltunnel_ostream',
                                                             'offset' => '168',
                                                             'type' => '1178'
                                                           },
                                                   '25' => {
                                                             'name' => 'requests',
                                                             'offset' => '176',
                                                             'type' => '11663'
                                                           },
                                                   '26' => {
                                                             'name' => 'requests_tail',
                                                             'offset' => '184',
                                                             'type' => '11663'
                                                           },
                                                   '27' => {
                                                             'name' => 'vec',
                                                             'offset' => '192',
                                                             'type' => '12723'
                                                           },
                                                   '28' => {
                                                             'name' => 'vec_len',
                                                             'offset' => '16576',
                                                             'type' => '191'
                                                           },
                                                   '29' => {
                                                             'name' => 'setup',
                                                             'offset' => '16584',
                                                             'type' => '11550'
                                                           },
                                                   '3' => {
                                                            'name' => 'pool',
                                                            'offset' => '32',
                                                            'type' => '4575'
                                                          },
                                                   '30' => {
                                                             'name' => 'setup_baton',
                                                             'offset' => '16592',
                                                             'type' => '234'
                                                           },
                                                   '31' => {
                                                             'name' => 'closed',
                                                             'offset' => '16600',
                                                             'type' => '11669'
                                                           },
                                                   '32' => {
                                                             'name' => 'closed_baton',
                                                             'offset' => '16608',
                                                             'type' => '234'
                                                           },
                                                   '33' => {
                                                             'name' => 'max_outstanding_requests',
                                                             'offset' => '16616',
                                                             'type' => '163'
                                                           },
                                                   '34' => {
                                                             'name' => 'hit_eof',
                                                             'offset' => '16620',
                                                             'type' => '191'
                                                           },
                                                   '35' => {
                                                             'name' => 'host_url',
                                                             'offset' => '16624',
                                                             'type' => '369'
                                                           },
                                                   '36' => {
                                                             'name' => 'host_info',
                                                             'offset' => '16632',
                                                             'type' => '9918'
                                                           },
                                                   '37' => {
                                                             'name' => 'authn_baton',
                                                             'offset' => '16720',
                                                             'type' => '234'
                                                           },
                                                   '38' => {
                                                             'name' => 'proxy_authn_baton',
                                                             'offset' => '16728',
                                                             'type' => '234'
                                                           },
                                                   '4' => {
                                                            'name' => 'allocator',
                                                            'offset' => '40',
                                                            'type' => '1463'
                                                          },
                                                   '5' => {
                                                            'name' => 'address',
                                                            'offset' => '48',
                                                            'type' => '9702'
                                                          },
                                                   '6' => {
                                                            'name' => 'skt',
                                                            'offset' => '56',
                                                            'type' => '9785'
                                                          },
                                                   '7' => {
                                                            'name' => 'skt_pool',
                                                            'offset' => '64',
                                                            'type' => '4575'
                                                          },
                                                   '8' => {
                                                            'name' => 'reqevents',
                                                            'offset' => '72',
                                                            'type' => '8471'
                                                          },
                                                   '9' => {
                                                            'name' => 'seen_in_pollset',
                                                            'offset' => '74',
                                                            'type' => '8471'
                                                          }
                                                 },
                                       'Name' => 'struct serf_connection_t',
                                       'Size' => '16736',
                                       'Type' => 'Struct'
                                     },
                          '107783' => {
                                        'BaseType' => '12502',
                                        'Name' => 'serf_incoming_t**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '108211' => {
                                        'BaseType' => '11900',
                                        'Name' => 'serf_listener_t**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '11047' => {
                                       'BaseType' => '11058',
                                       'Header' => 'serf.h',
                                       'Line' => '45',
                                       'Name' => 'serf_listener_t',
                                       'Size' => '88',
                                       'Type' => 'Typedef'
                                     },
                          '11058' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '120',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ctx',
                                                            'offset' => '0',
                                                            'type' => '11894'
                                                          },
                                                   '1' => {
                                                            'name' => 'baton',
                                                            'offset' => '8',
                                                            'type' => '12543'
                                                          },
                                                   '2' => {
                                                            'name' => 'skt',
                                                            'offset' => '24',
                                                            'type' => '9785'
                                                          },
                                                   '3' => {
                                                            'name' => 'pool',
                                                            'offset' => '32',
                                                            'type' => '4575'
                                                          },
                                                   '4' => {
                                                            'name' => 'desc',
                                                            'offset' => '40',
                                                            'type' => '9802'
                                                          },
                                                   '5' => {
                                                            'name' => 'accept_baton',
                                                            'offset' => '72',
                                                            'type' => '234'
                                                          },
                                                   '6' => {
                                                            'name' => 'accept_func',
                                                            'offset' => '80',
                                                            'type' => '11841'
                                                          }
                                                 },
                                       'Name' => 'struct serf_listener_t',
                                       'Size' => '88',
                                       'Type' => 'Struct'
                                     },
                          '11155' => {
                                       'BaseType' => '11166',
                                       'Header' => 'serf.h',
                                       'Line' => '46',
                                       'Name' => 'serf_incoming_t',
                                       'Size' => '80',
                                       'Type' => 'Typedef'
                                     },
                          '11166' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '130',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ctx',
                                                            'offset' => '0',
                                                            'type' => '11894'
                                                          },
                                                   '1' => {
                                                            'name' => 'baton',
                                                            'offset' => '8',
                                                            'type' => '12543'
                                                          },
                                                   '2' => {
                                                            'name' => 'request_baton',
                                                            'offset' => '24',
                                                            'type' => '234'
                                                          },
                                                   '3' => {
                                                            'name' => 'request',
                                                            'offset' => '32',
                                                            'type' => '11906'
                                                          },
                                                   '4' => {
                                                            'name' => 'skt',
                                                            'offset' => '40',
                                                            'type' => '9785'
                                                          },
                                                   '5' => {
                                                            'name' => 'desc',
                                                            'offset' => '48',
                                                            'type' => '9802'
                                                          }
                                                 },
                                       'Name' => 'struct serf_incoming_t',
                                       'Size' => '80',
                                       'Type' => 'Struct'
                                     },
                          '11251' => {
                                       'BaseType' => '11262',
                                       'Header' => 'serf.h',
                                       'Line' => '47',
                                       'Name' => 'serf_incoming_request_t',
                                       'Type' => 'Typedef'
                                     },
                          '11262' => {
                                       'Name' => 'struct serf_incoming_request_t',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '11267' => {
                                       'BaseType' => '11278',
                                       'Header' => 'serf.h',
                                       'Line' => '49',
                                       'Name' => 'serf_request_t',
                                       'Size' => '104',
                                       'Type' => 'Typedef'
                                     },
                          '11278' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '45',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'conn',
                                                            'offset' => '0',
                                                            'type' => '11713'
                                                          },
                                                   '1' => {
                                                            'name' => 'respool',
                                                            'offset' => '8',
                                                            'type' => '4575'
                                                          },
                                                   '10' => {
                                                             'name' => 'resp_bkt',
                                                             'offset' => '80',
                                                             'type' => '1178'
                                                           },
                                                   '11' => {
                                                             'name' => 'written',
                                                             'offset' => '88',
                                                             'type' => '191'
                                                           },
                                                   '12' => {
                                                             'name' => 'priority',
                                                             'offset' => '92',
                                                             'type' => '191'
                                                           },
                                                   '13' => {
                                                             'name' => 'next',
                                                             'offset' => '96',
                                                             'type' => '11663'
                                                           },
                                                   '2' => {
                                                            'name' => 'allocator',
                                                            'offset' => '16',
                                                            'type' => '1463'
                                                          },
                                                   '3' => {
                                                            'name' => 'req_bkt',
                                                            'offset' => '24',
                                                            'type' => '1178'
                                                          },
                                                   '4' => {
                                                            'name' => 'setup',
                                                            'offset' => '32',
                                                            'type' => '11960'
                                                          },
                                                   '5' => {
                                                            'name' => 'setup_baton',
                                                            'offset' => '40',
                                                            'type' => '234'
                                                          },
                                                   '6' => {
                                                            'name' => 'acceptor',
                                                            'offset' => '48',
                                                            'type' => '11615'
                                                          },
                                                   '7' => {
                                                            'name' => 'acceptor_baton',
                                                            'offset' => '56',
                                                            'type' => '234'
                                                          },
                                                   '8' => {
                                                            'name' => 'handler',
                                                            'offset' => '64',
                                                            'type' => '11719'
                                                          },
                                                   '9' => {
                                                            'name' => 'handler_baton',
                                                            'offset' => '72',
                                                            'type' => '234'
                                                          }
                                                 },
                                       'Name' => 'struct serf_request_t',
                                       'Size' => '104',
                                       'Type' => 'Struct'
                                     },
                          '11459' => {
                                       'BaseType' => '11470',
                                       'Header' => 'serf.h',
                                       'Line' => '138',
                                       'Name' => 'serf_socket_add_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11470' => {
                                       'Name' => 'apr_status_t(*)(void*, apr_pollfd_t*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '9912'
                                                           },
                                                    '2' => {
                                                             'type' => '234'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11501' => {
                                       'BaseType' => '11470',
                                       'Header' => 'serf.h',
                                       'Line' => '147',
                                       'Name' => 'serf_socket_remove_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11512' => {
                                       'BaseType' => '11523',
                                       'Header' => 'serf.h',
                                       'Line' => '217',
                                       'Name' => 'serf_progress_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11523' => {
                                       'Name' => 'void(*)(void*, apr_off_t, apr_off_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '346'
                                                           },
                                                    '2' => {
                                                             'type' => '346'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11550' => {
                                       'BaseType' => '11562',
                                       'Header' => 'serf.h',
                                       'Line' => '264',
                                       'Name' => 'serf_connection_setup_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11562' => {
                                       'Name' => 'apr_status_t(*)(apr_socket_t*, serf_bucket_t**, serf_bucket_t**, void*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '9785'
                                                           },
                                                    '1' => {
                                                             'type' => '11603'
                                                           },
                                                    '2' => {
                                                             'type' => '11603'
                                                           },
                                                    '3' => {
                                                             'type' => '234'
                                                           },
                                                    '4' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11603' => {
                                       'BaseType' => '1178',
                                       'Name' => 'serf_bucket_t**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11615' => {
                                       'BaseType' => '11627',
                                       'Header' => 'serf.h',
                                       'Line' => '299',
                                       'Name' => 'serf_response_acceptor_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '1162' => {
                                      'BaseType' => '1173',
                                      'Header' => 'serf.h',
                                      'Line' => '42',
                                      'Name' => 'serf_bucket_alloc_t',
                                      'Type' => 'Typedef'
                                    },
                          '11627' => {
                                       'Name' => 'serf_bucket_t*(*)(serf_request_t*, serf_bucket_t*, void*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11663'
                                                           },
                                                    '1' => {
                                                             'type' => '1178'
                                                           },
                                                    '2' => {
                                                             'type' => '234'
                                                           },
                                                    '3' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '1178',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11663' => {
                                       'BaseType' => '11267',
                                       'Name' => 'serf_request_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11669' => {
                                       'BaseType' => '11681',
                                       'Header' => 'serf.h',
                                       'Line' => '317',
                                       'Name' => 'serf_connection_closed_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11681' => {
                                       'Name' => 'void(*)(serf_connection_t*, void*, apr_status_t, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11713'
                                                           },
                                                    '1' => {
                                                             'type' => '234'
                                                           },
                                                    '2' => {
                                                             'type' => '358'
                                                           },
                                                    '3' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11713' => {
                                       'BaseType' => '10543',
                                       'Name' => 'serf_connection_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11719' => {
                                       'BaseType' => '11731',
                                       'Header' => 'serf.h',
                                       'Line' => '351',
                                       'Name' => 'serf_response_handler_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '1173' => {
                                      'Line' => '83',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'pool',
                                                           'offset' => '0',
                                                           'type' => '4575'
                                                         },
                                                  '1' => {
                                                           'name' => 'allocator',
                                                           'offset' => '8',
                                                           'type' => '41797'
                                                         },
                                                  '2' => {
                                                           'name' => 'own_allocator',
                                                           'offset' => '16',
                                                           'type' => '191'
                                                         },
                                                  '3' => {
                                                           'name' => 'unfreed',
                                                           'offset' => '24',
                                                           'type' => '41552'
                                                         },
                                                  '4' => {
                                                           'name' => 'unfreed_baton',
                                                           'offset' => '32',
                                                           'type' => '234'
                                                         },
                                                  '5' => {
                                                           'name' => 'num_alloc',
                                                           'offset' => '40',
                                                           'type' => '8507'
                                                         },
                                                  '6' => {
                                                           'name' => 'freelist',
                                                           'offset' => '48',
                                                           'type' => '41803'
                                                         },
                                                  '7' => {
                                                           'name' => 'blocks',
                                                           'offset' => '56',
                                                           'type' => '40329'
                                                         },
                                                  '8' => {
                                                           'name' => 'track',
                                                           'offset' => '64',
                                                           'type' => '41809'
                                                         }
                                                },
                                      'Name' => 'struct serf_bucket_alloc_t',
                                      'PrivateABI' => 1,
                                      'Size' => '72',
                                      'Source' => 'allocator.c',
                                      'Type' => 'Struct'
                                    },
                          '11731' => {
                                       'Name' => 'apr_status_t(*)(serf_request_t*, serf_bucket_t*, void*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11663'
                                                           },
                                                    '1' => {
                                                             'type' => '1178'
                                                           },
                                                    '2' => {
                                                             'type' => '234'
                                                           },
                                                    '3' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11767' => {
                                       'BaseType' => '11779',
                                       'Header' => 'serf.h',
                                       'Line' => '364',
                                       'Name' => 'serf_credentials_callback_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11779' => {
                                       'Name' => 'apr_status_t(*)(char**, char**, serf_request_t*, void*, int, char const*, char const*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11835'
                                                           },
                                                    '1' => {
                                                             'type' => '11835'
                                                           },
                                                    '2' => {
                                                             'type' => '11663'
                                                           },
                                                    '3' => {
                                                             'type' => '234'
                                                           },
                                                    '4' => {
                                                             'type' => '191'
                                                           },
                                                    '5' => {
                                                             'type' => '369'
                                                           },
                                                    '6' => {
                                                             'type' => '369'
                                                           },
                                                    '7' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1178' => {
                                      'BaseType' => '969',
                                      'Name' => 'serf_bucket_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '11835' => {
                                       'BaseType' => '236',
                                       'Name' => 'char**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11841' => {
                                       'BaseType' => '11853',
                                       'Header' => 'serf.h',
                                       'Line' => '436',
                                       'Name' => 'serf_accept_client_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11853' => {
                                       'Name' => 'apr_status_t(*)(serf_context_t*, serf_listener_t*, void*, apr_socket_t*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11894'
                                                           },
                                                    '1' => {
                                                             'type' => '11900'
                                                           },
                                                    '2' => {
                                                             'type' => '234'
                                                           },
                                                    '3' => {
                                                             'type' => '9785'
                                                           },
                                                    '4' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '118530' => {
                                        'BaseType' => '11713',
                                        'Name' => 'serf_connection_t**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '11894' => {
                                       'BaseType' => '10130',
                                       'Name' => 'serf_context_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11900' => {
                                       'BaseType' => '11047',
                                       'Name' => 'serf_listener_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11906' => {
                                       'BaseType' => '11918',
                                       'Header' => 'serf.h',
                                       'Line' => '452',
                                       'Name' => 'serf_incoming_request_cb_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11918' => {
                                       'Name' => 'apr_status_t(*)(serf_context_t*, serf_incoming_request_t*, void*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11894'
                                                           },
                                                    '1' => {
                                                             'type' => '11954'
                                                           },
                                                    '2' => {
                                                             'type' => '234'
                                                           },
                                                    '3' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '119526' => {
                                        'BaseType' => '119532',
                                        'Name' => 'serf_request_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '119532' => {
                                        'BaseType' => '11267',
                                        'Name' => 'serf_request_t const',
                                        'Size' => '104',
                                        'Type' => 'Const'
                                      },
                          '11954' => {
                                       'BaseType' => '11251',
                                       'Name' => 'serf_incoming_request_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11960' => {
                                       'BaseType' => '11972',
                                       'Header' => 'serf.h',
                                       'Line' => '518',
                                       'Name' => 'serf_request_setup_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '119708' => {
                                        'BaseType' => '11719',
                                        'Name' => 'serf_response_handler_t const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '119713' => {
                                        'BaseType' => '16919',
                                        'Name' => 'void const**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '11972' => {
                                       'Name' => 'apr_status_t(*)(serf_request_t*, void*, serf_bucket_t**, serf_response_acceptor_t*, void**, serf_response_handler_t*, void**, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11663'
                                                           },
                                                    '1' => {
                                                             'type' => '234'
                                                           },
                                                    '2' => {
                                                             'type' => '11603'
                                                           },
                                                    '3' => {
                                                             'type' => '12028'
                                                           },
                                                    '4' => {
                                                             'type' => '12034'
                                                           },
                                                    '5' => {
                                                             'type' => '12040'
                                                           },
                                                    '6' => {
                                                             'type' => '12034'
                                                           },
                                                    '7' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12028' => {
                                       'BaseType' => '11615',
                                       'Name' => 'serf_response_acceptor_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12034' => {
                                       'BaseType' => '234',
                                       'Name' => 'void**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12040' => {
                                       'BaseType' => '11719',
                                       'Name' => 'serf_response_handler_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1214' => {
                                      'BaseType' => '369',
                                      'Name' => 'char const**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1220' => {
                                      'BaseType' => '334',
                                      'Name' => 'apr_size_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1226' => {
                                      'Name' => 'apr_status_t(*)(serf_bucket_t*, apr_size_t, char const**, apr_size_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1178'
                                                          },
                                                   '1' => {
                                                            'type' => '334'
                                                          },
                                                   '2' => {
                                                            'type' => '1214'
                                                          },
                                                   '3' => {
                                                            'type' => '1220'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '12331' => {
                                       'BaseType' => '12342',
                                       'Header' => 'serf_private.h',
                                       'Line' => '33',
                                       'Name' => 'serf__authn_scheme_t',
                                       'Size' => '64',
                                       'Type' => 'Typedef'
                                     },
                          '12342' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '291',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'code',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'name',
                                                            'offset' => '8',
                                                            'type' => '369'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '16',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'init_ctx_func',
                                                            'offset' => '24',
                                                            'type' => '12802'
                                                          },
                                                   '4' => {
                                                            'name' => 'init_conn_func',
                                                            'offset' => '32',
                                                            'type' => '12844'
                                                          },
                                                   '5' => {
                                                            'name' => 'handle_func',
                                                            'offset' => '40',
                                                            'type' => '12740'
                                                          },
                                                   '6' => {
                                                            'name' => 'setup_request_func',
                                                            'offset' => '48',
                                                            'type' => '12887'
                                                          },
                                                   '7' => {
                                                            'name' => 'validate_response_func',
                                                            'offset' => '56',
                                                            'type' => '12940'
                                                          }
                                                 },
                                       'Name' => 'struct serf__authn_scheme_t',
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '12460' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '37',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'client',
                                                            'offset' => '0',
                                                            'type' => '12502'
                                                          },
                                                   '1' => {
                                                            'name' => 'conn',
                                                            'offset' => '0',
                                                            'type' => '11713'
                                                          },
                                                   '2' => {
                                                            'name' => 'listener',
                                                            'offset' => '0',
                                                            'type' => '11900'
                                                          }
                                                 },
                                       'Name' => 'anon-union-serf_private.h-37',
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '12502' => {
                                       'BaseType' => '11155',
                                       'Name' => 'serf_incoming_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12508' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '35',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'u',
                                                            'offset' => '8',
                                                            'type' => '12460'
                                                          }
                                                 },
                                       'Name' => 'struct serf_io_baton_t',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '12543' => {
                                       'BaseType' => '12508',
                                       'Header' => 'serf_private.h',
                                       'Line' => '42',
                                       'Name' => 'serf_io_baton_t',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '12602' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '78',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'realm',
                                                            'offset' => '0',
                                                            'type' => '369'
                                                          },
                                                   '1' => {
                                                            'name' => 'scheme',
                                                            'offset' => '8',
                                                            'type' => '12651'
                                                          },
                                                   '2' => {
                                                            'name' => 'baton',
                                                            'offset' => '16',
                                                            'type' => '234'
                                                          }
                                                 },
                                       'Name' => 'struct serf__authn_info_t',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '12651' => {
                                       'BaseType' => '12657',
                                       'Name' => 'serf__authn_scheme_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12657' => {
                                       'BaseType' => '12331',
                                       'Name' => 'serf__authn_scheme_t const',
                                       'Size' => '64',
                                       'Type' => 'Const'
                                     },
                          '12662' => {
                                       'BaseType' => '12602',
                                       'Header' => 'serf_private.h',
                                       'Line' => '84',
                                       'Name' => 'serf__authn_info_t',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '1267' => {
                                      'Name' => 'apr_status_t(*)(serf_bucket_t*, int, int*, char const**, apr_size_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1178'
                                                          },
                                                   '1' => {
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'type' => '328'
                                                          },
                                                   '3' => {
                                                            'type' => '1214'
                                                          },
                                                   '4' => {
                                                            'type' => '1220'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '12673' => {
                                       'BaseType' => '8627',
                                       'Name' => 'apr_array_header_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12712' => {
                                       'Header' => 'serf_private.h',
                                       'Line' => '146',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'SERF_CONN_INIT',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'SERF_CONN_SETUP_SSLTUNNEL',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'SERF_CONN_CONNECTED',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'SERF_CONN_CLOSING',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum serf__connection_state_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '12723' => {
                                       'BaseType' => '285',
                                       'Name' => 'struct iovec[1024]',
                                       'Size' => '16384',
                                       'Type' => 'Array'
                                     },
                          '12740' => {
                                       'BaseType' => '12751',
                                       'Header' => 'serf_private.h',
                                       'Line' => '235',
                                       'Name' => 'serf__auth_handler_func_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '12751' => {
                                       'Name' => 'apr_status_t(*)(int, serf_request_t*, serf_bucket_t*, char const*, char const*, void*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '191'
                                                           },
                                                    '1' => {
                                                             'type' => '11663'
                                                           },
                                                    '2' => {
                                                             'type' => '1178'
                                                           },
                                                    '3' => {
                                                             'type' => '369'
                                                           },
                                                    '4' => {
                                                             'type' => '369'
                                                           },
                                                    '5' => {
                                                             'type' => '234'
                                                           },
                                                    '6' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12802' => {
                                       'BaseType' => '12813',
                                       'Header' => 'serf_private.h',
                                       'Line' => '249',
                                       'Name' => 'serf__init_context_func_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '12813' => {
                                       'Name' => 'apr_status_t(*)(int, serf_context_t*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '191'
                                                           },
                                                    '1' => {
                                                             'type' => '11894'
                                                           },
                                                    '2' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12844' => {
                                       'BaseType' => '12856',
                                       'Header' => 'serf_private.h',
                                       'Line' => '259',
                                       'Name' => 'serf__init_conn_func_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '12856' => {
                                       'Name' => 'apr_status_t(*)(int, serf_connection_t*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '191'
                                                           },
                                                    '1' => {
                                                             'type' => '11713'
                                                           },
                                                    '2' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12887' => {
                                       'BaseType' => '12899',
                                       'Header' => 'serf_private.h',
                                       'Line' => '270',
                                       'Name' => 'serf__setup_request_func_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '12899' => {
                                       'Name' => 'apr_status_t(*)(int, serf_connection_t*, char const*, char const*, serf_bucket_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '191'
                                                           },
                                                    '1' => {
                                                             'type' => '11713'
                                                           },
                                                    '2' => {
                                                             'type' => '369'
                                                           },
                                                    '3' => {
                                                             'type' => '369'
                                                           },
                                                    '4' => {
                                                             'type' => '1178'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12940' => {
                                       'BaseType' => '12952',
                                       'Header' => 'serf_private.h',
                                       'Line' => '282',
                                       'Name' => 'serf__validate_response_func_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '12952' => {
                                       'Name' => 'apr_status_t(*)(int, serf_connection_t*, serf_request_t*, serf_bucket_t*, apr_pool_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '191'
                                                           },
                                                    '1' => {
                                                             'type' => '11713'
                                                           },
                                                    '2' => {
                                                             'type' => '11663'
                                                           },
                                                    '3' => {
                                                             'type' => '1178'
                                                           },
                                                    '4' => {
                                                             'type' => '4575'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1308' => {
                                      'Name' => 'apr_status_t(*)(serf_bucket_t*, apr_size_t, int, struct iovec*, int*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1178'
                                                          },
                                                   '1' => {
                                                            'type' => '334'
                                                          },
                                                   '2' => {
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'type' => '322'
                                                          },
                                                   '4' => {
                                                            'type' => '328'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1354' => {
                                      'BaseType' => '886',
                                      'Name' => 'apr_hdtr_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1360' => {
                                      'BaseType' => '963',
                                      'Name' => 'apr_file_t**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1366' => {
                                      'BaseType' => '346',
                                      'Name' => 'apr_off_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1372' => {
                                      'Name' => 'apr_status_t(*)(serf_bucket_t*, apr_size_t, apr_hdtr_t*, apr_file_t**, apr_off_t*, apr_size_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1178'
                                                          },
                                                   '1' => {
                                                            'type' => '334'
                                                          },
                                                   '2' => {
                                                            'type' => '1354'
                                                          },
                                                   '3' => {
                                                            'type' => '1360'
                                                          },
                                                   '4' => {
                                                            'type' => '1366'
                                                          },
                                                   '5' => {
                                                            'type' => '1220'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1398' => {
                                      'BaseType' => '1404',
                                      'Name' => 'serf_bucket_type_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1404' => {
                                      'BaseType' => '1033',
                                      'Name' => 'serf_bucket_type_t const',
                                      'Size' => '64',
                                      'Type' => 'Const'
                                    },
                          '1409' => {
                                      'Name' => 'serf_bucket_t*(*)(serf_bucket_t*, serf_bucket_type_t const*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1178'
                                                          },
                                                   '1' => {
                                                            'type' => '1398'
                                                          }
                                                 },
                                      'Return' => '1178',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '14394' => {
                                       'BaseType' => '14400',
                                       'Name' => 'apr_pollfd_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1440' => {
                                      'Name' => 'apr_status_t(*)(serf_bucket_t*, char const**, apr_size_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1178'
                                                          },
                                                   '1' => {
                                                            'type' => '1214'
                                                          },
                                                   '2' => {
                                                            'type' => '1220'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '14400' => {
                                       'BaseType' => '9802',
                                       'Name' => 'apr_pollfd_t const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '1457' => {
                                      'Name' => 'void(*)(serf_bucket_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1178'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1463' => {
                                      'BaseType' => '1162',
                                      'Name' => 'serf_bucket_alloc_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1469' => {
                                      'BaseType' => '1480',
                                      'Header' => 'serf_bucket_types.h',
                                      'Line' => '182',
                                      'Name' => 'serf_bucket_aggregate_eof_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '14748' => {
                                       'BaseType' => '11512',
                                       'Name' => 'serf_progress_t const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '1480' => {
                                      'Name' => 'apr_status_t(*)(void*, serf_bucket_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '234'
                                                          },
                                                   '1' => {
                                                            'type' => '1178'
                                                          }
                                                 },
                                      'Return' => '358',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '149' => {
                                     'Name' => 'unsigned char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '1506' => {
                                      'BaseType' => '1518',
                                      'Header' => 'serf_bucket_types.h',
                                      'Line' => '278',
                                      'Name' => 'serf_simple_freefunc_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1518' => {
                                      'Name' => 'void(*)(void*, char const*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '234'
                                                          },
                                                   '1' => {
                                                            'type' => '369'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1540' => {
                                      'Line' => '21',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'bucket',
                                                           'offset' => '0',
                                                           'type' => '1178'
                                                         },
                                                  '1' => {
                                                           'name' => 'next',
                                                           'offset' => '8',
                                                           'type' => '1577'
                                                         }
                                                },
                                      'Name' => 'struct bucket_list',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Source' => 'aggregate_buckets.c',
                                      'Type' => 'Struct'
                                    },
                          '156' => {
                                     'Name' => 'unsigned short',
                                     'Size' => '2',
                                     'Type' => 'Intrinsic'
                                   },
                          '1577' => {
                                      'BaseType' => '1540',
                                      'Name' => 'struct bucket_list*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1583' => {
                                      'BaseType' => '1540',
                                      'Line' => '24',
                                      'Name' => 'bucket_list_t',
                                      'Size' => '16',
                                      'Source' => 'aggregate_buckets.c',
                                      'Type' => 'Typedef'
                                    },
                          '163' => {
                                     'Name' => 'unsigned int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '1675' => {
                                      'BaseType' => '1583',
                                      'Name' => 'bucket_list_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '16806' => {
                                       'Header' => 'serf.h',
                                       'Line' => '988',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'SERF_LINEBUF_EMPTY',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'SERF_LINEBUF_READY',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'SERF_LINEBUF_PARTIAL',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'SERF_LINEBUF_CRLF_SPLIT',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'anon-enum-serf.h-988',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '16890' => {
                                       'BaseType' => '242',
                                       'Name' => 'char[8000]',
                                       'Size' => '8000',
                                       'Type' => 'Array'
                                     },
                          '16907' => {
                                       'Header' => 'serf.h',
                                       'Line' => '1001',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'state',
                                                            'offset' => '0',
                                                            'type' => '16806'
                                                          },
                                                   '1' => {
                                                            'name' => 'used',
                                                            'offset' => '8',
                                                            'type' => '334'
                                                          },
                                                   '2' => {
                                                            'name' => 'line',
                                                            'offset' => '16',
                                                            'type' => '16890'
                                                          }
                                                 },
                                       'Name' => 'struct serf_linebuf_t',
                                       'Size' => '8016',
                                       'Type' => 'Struct'
                                     },
                          '16919' => {
                                       'BaseType' => '16925',
                                       'Name' => 'void const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '16925' => {
                                       'BaseType' => '1',
                                       'Name' => 'void const',
                                       'Type' => 'Const'
                                     },
                          '16926' => {
                                       'BaseType' => '16937',
                                       'Header' => 'serf_bucket_util.h',
                                       'Line' => '201',
                                       'Name' => 'serf_databuf_reader_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '16937' => {
                                       'Name' => 'apr_status_t(*)(void*, apr_size_t, char*, apr_size_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '334'
                                                           },
                                                    '2' => {
                                                             'type' => '236'
                                                           },
                                                    '3' => {
                                                             'type' => '1220'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '170' => {
                                     'Name' => 'unsigned long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '17055' => {
                                       'Header' => 'serf_bucket_util.h',
                                       'Line' => '234',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'current',
                                                            'offset' => '0',
                                                            'type' => '369'
                                                          },
                                                   '1' => {
                                                            'name' => 'remaining',
                                                            'offset' => '8',
                                                            'type' => '334'
                                                          },
                                                   '2' => {
                                                            'name' => 'read',
                                                            'offset' => '16',
                                                            'type' => '16926'
                                                          },
                                                   '3' => {
                                                            'name' => 'read_baton',
                                                            'offset' => '24',
                                                            'type' => '234'
                                                          },
                                                   '4' => {
                                                            'name' => 'status',
                                                            'offset' => '32',
                                                            'type' => '358'
                                                          },
                                                   '5' => {
                                                            'name' => 'buf',
                                                            'offset' => '36',
                                                            'type' => '16890'
                                                          }
                                                 },
                                       'Name' => 'struct serf_databuf_t',
                                       'Size' => '8040',
                                       'Type' => 'Struct'
                                     },
                          '17193' => {
                                       'BaseType' => '17055',
                                       'Name' => 'serf_databuf_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '184' => {
                                     'Name' => 'short',
                                     'Size' => '2',
                                     'Type' => 'Intrinsic'
                                   },
                          '191' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '19335' => {
                                       'BaseType' => '16907',
                                       'Name' => 'serf_linebuf_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '198' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '205' => {
                                     'BaseType' => '198',
                                     'Header' => 'types.h',
                                     'Line' => '131',
                                     'Name' => '__off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '234' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '236' => {
                                     'BaseType' => '242',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '242' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '24295' => {
                                       'BaseType' => '24306',
                                       'Header' => 'apr_mmap.h',
                                       'Line' => '51',
                                       'Name' => 'apr_mmap_t',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '24306' => {
                                       'Header' => 'apr_mmap.h',
                                       'Line' => '62',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cntxt',
                                                            'offset' => '0',
                                                            'type' => '4575'
                                                          },
                                                   '1' => {
                                                            'name' => 'mm',
                                                            'offset' => '8',
                                                            'type' => '234'
                                                          },
                                                   '2' => {
                                                            'name' => 'size',
                                                            'offset' => '16',
                                                            'type' => '334'
                                                          },
                                                   '3' => {
                                                            'name' => 'link',
                                                            'offset' => '24',
                                                            'type' => '24366'
                                                          }
                                                 },
                                       'Name' => 'struct apr_mmap_t',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '24366' => {
                                       'Header' => 'apr_mmap.h',
                                       'Line' => '85',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '24399'
                                                          },
                                                   '1' => {
                                                            'name' => 'prev',
                                                            'offset' => '8',
                                                            'type' => '24399'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-apr_mmap.h-85',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '24399' => {
                                       'BaseType' => '25596',
                                       'Name' => 'struct apr_mmap_t*volatile',
                                       'Size' => '8',
                                       'Type' => 'Volatile'
                                     },
                          '249' => {
                                     'BaseType' => '205',
                                     'Header' => 'types.h',
                                     'Line' => '86',
                                     'Name' => 'off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '25596' => {
                                       'BaseType' => '24295',
                                       'Name' => 'apr_mmap_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '260' => {
                                     'BaseType' => '170',
                                     'Header' => 'stddef.h',
                                     'Line' => '212',
                                     'Name' => 'size_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '285' => {
                                     'Header' => 'uio.h',
                                     'Line' => '43',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'iov_base',
                                                          'offset' => '0',
                                                          'type' => '234'
                                                        },
                                                 '1' => {
                                                          'name' => 'iov_len',
                                                          'offset' => '8',
                                                          'type' => '260'
                                                        }
                                               },
                                     'Name' => 'struct iovec',
                                     'PrivateABI' => 1,
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '31363' => {
                                       'BaseType' => '170',
                                       'Header' => 'apr.h',
                                       'Line' => '353',
                                       'Name' => 'apr_uint64_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '322' => {
                                     'BaseType' => '285',
                                     'Name' => 'struct iovec*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '32784' => {
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '93',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'version',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'code',
                                                            'offset' => '4',
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'name' => 'reason',
                                                            'offset' => '8',
                                                            'type' => '369'
                                                          }
                                                 },
                                       'Name' => 'struct serf_status_line',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '328' => {
                                     'BaseType' => '191',
                                     'Name' => 'int*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '334' => {
                                     'BaseType' => '260',
                                     'Header' => 'apr.h',
                                     'Line' => '356',
                                     'Name' => 'apr_size_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '346' => {
                                     'BaseType' => '249',
                                     'Header' => 'apr.h',
                                     'Line' => '358',
                                     'Name' => 'apr_off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '35164' => {
                                       'BaseType' => '32784',
                                       'Name' => 'serf_status_line*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '358' => {
                                     'BaseType' => '191',
                                     'Header' => 'apr_errno.h',
                                     'Line' => '44',
                                     'Name' => 'apr_status_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '36036' => {
                                       'Name' => 'int()(void*, char const*, char const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '369'
                                                           },
                                                    '2' => {
                                                             'type' => '369'
                                                           }
                                                  },
                                       'Return' => '191',
                                       'Type' => 'Func'
                                     },
                          '369' => {
                                     'BaseType' => '375',
                                     'Name' => 'char const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '37150' => {
                                       'BaseType' => '36036',
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '398',
                                       'Name' => 'serf_bucket_headers_do_callback_fn_t',
                                       'Type' => 'Typedef'
                                     },
                          '375' => {
                                     'BaseType' => '242',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '380' => {
                                     'Name' => 'struct apr_file_t',
                                     'PrivateABI' => 1,
                                     'Type' => 'Struct'
                                   },
                          '39676' => {
                                       'BaseType' => '37150',
                                       'Name' => 'serf_bucket_headers_do_callback_fn_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '40217' => {
                                       'BaseType' => '40228',
                                       'Header' => 'apr_allocator.h',
                                       'Line' => '41',
                                       'Name' => 'apr_allocator_t',
                                       'Type' => 'Typedef'
                                     },
                          '40228' => {
                                       'Name' => 'struct apr_allocator_t',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '40233' => {
                                       'BaseType' => '40244',
                                       'Header' => 'apr_allocator.h',
                                       'Line' => '43',
                                       'Name' => 'apr_memnode_t',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '40244' => {
                                       'Header' => 'apr_allocator.h',
                                       'Line' => '54',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '40329'
                                                          },
                                                   '1' => {
                                                            'name' => 'ref',
                                                            'offset' => '8',
                                                            'type' => '40335'
                                                          },
                                                   '2' => {
                                                            'name' => 'index',
                                                            'offset' => '16',
                                                            'type' => '8507'
                                                          },
                                                   '3' => {
                                                            'name' => 'free_index',
                                                            'offset' => '20',
                                                            'type' => '8507'
                                                          },
                                                   '4' => {
                                                            'name' => 'first_avail',
                                                            'offset' => '24',
                                                            'type' => '236'
                                                          },
                                                   '5' => {
                                                            'name' => 'endp',
                                                            'offset' => '32',
                                                            'type' => '236'
                                                          }
                                                 },
                                       'Name' => 'struct apr_memnode_t',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '40329' => {
                                       'BaseType' => '40233',
                                       'Name' => 'apr_memnode_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '40335' => {
                                       'BaseType' => '40329',
                                       'Name' => 'apr_memnode_t**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '41552' => {
                                       'BaseType' => '41564',
                                       'Header' => 'serf.h',
                                       'Line' => '933',
                                       'Name' => 'serf_unfreed_func_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '41564' => {
                                       'Name' => 'void(*)(void*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '234'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '41586' => {
                                       'Line' => '26',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '41803'
                                                          },
                                                   '1' => {
                                                            'name' => 'memnode',
                                                            'offset' => '0',
                                                            'type' => '40329'
                                                          }
                                                 },
                                       'Name' => 'anon-union-allocator.c-26',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Source' => 'allocator.c',
                                       'Type' => 'Union'
                                     },
                          '41617' => {
                                       'Line' => '24',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'size',
                                                            'offset' => '0',
                                                            'type' => '334'
                                                          },
                                                   '1' => {
                                                            'name' => 'u',
                                                            'offset' => '8',
                                                            'type' => '41586'
                                                          }
                                                 },
                                       'Name' => 'struct node_header_t',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Source' => 'allocator.c',
                                       'Type' => 'Struct'
                                     },
                          '41658' => {
                                       'BaseType' => '41617',
                                       'Line' => '31',
                                       'Name' => 'node_header_t',
                                       'Size' => '16',
                                       'Source' => 'allocator.c',
                                       'Type' => 'Typedef'
                                     },
                          '41702' => {
                                       'BaseType' => '41708',
                                       'Name' => 'serf_bucket_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '41708' => {
                                       'BaseType' => '969',
                                       'Name' => 'serf_bucket_t const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '41713' => {
                                       'Line' => '71',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'bucket',
                                                            'offset' => '0',
                                                            'type' => '41702'
                                                          },
                                                   '1' => {
                                                            'name' => 'last',
                                                            'offset' => '8',
                                                            'type' => '358'
                                                          }
                                                 },
                                       'Name' => 'struct read_status_t',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Source' => 'allocator.c',
                                       'Type' => 'Struct'
                                     },
                          '41770' => {
                                       'BaseType' => '41713',
                                       'Name' => 'read_status_t[100]',
                                       'Size' => '1600',
                                       'Type' => 'Array'
                                     },
                          '41786' => {
                                       'Line' => '80',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next_index',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'num_used',
                                                            'offset' => '4',
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'name' => 'info',
                                                            'offset' => '8',
                                                            'type' => '41770'
                                                          }
                                                 },
                                       'Name' => 'struct track_state_t',
                                       'PrivateABI' => 1,
                                       'Size' => '1608',
                                       'Source' => 'allocator.c',
                                       'Type' => 'Struct'
                                     },
                          '41797' => {
                                       'BaseType' => '40217',
                                       'Name' => 'apr_allocator_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '41803' => {
                                       'BaseType' => '41658',
                                       'Name' => 'node_header_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '41809' => {
                                       'BaseType' => '41786',
                                       'Name' => 'track_state_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '4501' => {
                                      'BaseType' => '198',
                                      'Header' => 'apr.h',
                                      'Line' => '352',
                                      'Name' => 'apr_int64_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4559' => {
                                      'BaseType' => '4570',
                                      'Header' => 'apr_pools.h',
                                      'Line' => '60',
                                      'Name' => 'apr_pool_t',
                                      'Type' => 'Typedef'
                                    },
                          '4570' => {
                                      'Name' => 'struct apr_pool_t',
                                      'PrivateABI' => 1,
                                      'Type' => 'Struct'
                                    },
                          '4575' => {
                                      'BaseType' => '4559',
                                      'Name' => 'apr_pool_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '46083' => {
                                       'BaseType' => '149',
                                       'Name' => 'unsigned char*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '51392' => {
                                       'BaseType' => '198',
                                       'Header' => 'types.h',
                                       'Line' => '139',
                                       'Name' => '__time_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '51403' => {
                                       'BaseType' => '198',
                                       'Header' => 'types.h',
                                       'Line' => '141',
                                       'Name' => '__suseconds_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '51462' => {
                                       'BaseType' => '51392',
                                       'Header' => 'time.h',
                                       'Line' => '75',
                                       'Name' => 'time_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '51484' => {
                                       'Header' => 'time.h',
                                       'Line' => '30',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tv_sec',
                                                            'offset' => '0',
                                                            'type' => '51392'
                                                          },
                                                   '1' => {
                                                            'name' => 'tv_usec',
                                                            'offset' => '8',
                                                            'type' => '51403'
                                                          }
                                                 },
                                       'Name' => 'struct timeval',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '51590' => {
                                       'Name' => 'void(*)()',
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '53100' => {
                                       'BaseType' => '53111',
                                       'Header' => 'apr_hash.h',
                                       'Line' => '52',
                                       'Name' => 'apr_hash_t',
                                       'Type' => 'Typedef'
                                     },
                          '53111' => {
                                       'Name' => 'struct apr_hash_t',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '53123' => {
                                       'BaseType' => '53135',
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '478',
                                       'Name' => 'serf_ssl_context_t',
                                       'Size' => '16328',
                                       'Type' => 'Typedef'
                                     },
                          '53135' => {
                                       'Line' => '142',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'refcount',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'pool',
                                                            'offset' => '8',
                                                            'type' => '4575'
                                                          },
                                                   '10' => {
                                                             'name' => 'cert_cache_pool',
                                                             'offset' => '16224',
                                                             'type' => '4575'
                                                           },
                                                   '11' => {
                                                             'name' => 'cert_file_success',
                                                             'offset' => '16232',
                                                             'type' => '369'
                                                           },
                                                   '12' => {
                                                             'name' => 'cert_pw_callback',
                                                             'offset' => '16240',
                                                             'type' => '53541'
                                                           },
                                                   '13' => {
                                                             'name' => 'cert_pw_userdata',
                                                             'offset' => '16248',
                                                             'type' => '234'
                                                           },
                                                   '14' => {
                                                             'name' => 'cert_pw_cache_pool',
                                                             'offset' => '16256',
                                                             'type' => '4575'
                                                           },
                                                   '15' => {
                                                             'name' => 'cert_pw_success',
                                                             'offset' => '16264',
                                                             'type' => '369'
                                                           },
                                                   '16' => {
                                                             'name' => 'server_cert_callback',
                                                             'offset' => '16272',
                                                             'type' => '53584'
                                                           },
                                                   '17' => {
                                                             'name' => 'server_cert_chain_callback',
                                                             'offset' => '16280',
                                                             'type' => '53638'
                                                           },
                                                   '18' => {
                                                             'name' => 'server_cert_userdata',
                                                             'offset' => '16288',
                                                             'type' => '234'
                                                           },
                                                   '19' => {
                                                             'name' => 'cert_path',
                                                             'offset' => '16296',
                                                             'type' => '369'
                                                           },
                                                   '2' => {
                                                            'name' => 'allocator',
                                                            'offset' => '16',
                                                            'type' => '1463'
                                                          },
                                                   '20' => {
                                                             'name' => 'cached_cert',
                                                             'offset' => '16304',
                                                             'type' => '62534'
                                                           },
                                                   '21' => {
                                                             'name' => 'cached_cert_pw',
                                                             'offset' => '16312',
                                                             'type' => '64165'
                                                           },
                                                   '22' => {
                                                             'name' => 'pending_err',
                                                             'offset' => '16320',
                                                             'type' => '358'
                                                           },
                                                   '23' => {
                                                             'name' => 'fatal_err',
                                                             'offset' => '16324',
                                                             'type' => '358'
                                                           },
                                                   '3' => {
                                                            'name' => 'ctx',
                                                            'offset' => '24',
                                                            'type' => '68013'
                                                          },
                                                   '4' => {
                                                            'name' => 'ssl',
                                                            'offset' => '32',
                                                            'type' => '67642'
                                                          },
                                                   '5' => {
                                                            'name' => 'bio',
                                                            'offset' => '40',
                                                            'type' => '61437'
                                                          },
                                                   '6' => {
                                                            'name' => 'encrypt',
                                                            'offset' => '48',
                                                            'type' => '73137'
                                                          },
                                                   '7' => {
                                                            'name' => 'decrypt',
                                                            'offset' => '8128',
                                                            'type' => '73137'
                                                          },
                                                   '8' => {
                                                            'name' => 'cert_callback',
                                                            'offset' => '16208',
                                                            'type' => '53503'
                                                          },
                                                   '9' => {
                                                            'name' => 'cert_userdata',
                                                            'offset' => '16216',
                                                            'type' => '234'
                                                          }
                                                 },
                                       'Name' => 'struct serf_ssl_context_t',
                                       'PrivateABI' => 1,
                                       'Size' => '16328',
                                       'Source' => 'ssl_buckets.c',
                                       'Type' => 'Struct'
                                     },
                          '53454' => {
                                       'BaseType' => '53466',
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '479',
                                       'Name' => 'serf_ssl_certificate_t',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '53466' => {
                                       'Line' => '200',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ssl_cert',
                                                            'offset' => '0',
                                                            'type' => '62534'
                                                          },
                                                   '1' => {
                                                            'name' => 'depth',
                                                            'offset' => '8',
                                                            'type' => '191'
                                                          }
                                                 },
                                       'Name' => 'struct serf_ssl_certificate_t',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Source' => 'ssl_buckets.c',
                                       'Type' => 'Struct'
                                     },
                          '53503' => {
                                       'BaseType' => '53515',
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '481',
                                       'Name' => 'serf_ssl_need_client_cert_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '53515' => {
                                       'Name' => 'apr_status_t(*)(void*, char const**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '1214'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '53541' => {
                                       'BaseType' => '53553',
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '485',
                                       'Name' => 'serf_ssl_need_cert_password_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '53553' => {
                                       'Name' => 'apr_status_t(*)(void*, char const*, char const**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '369'
                                                           },
                                                    '2' => {
                                                             'type' => '1214'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '53584' => {
                                       'BaseType' => '53596',
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '490',
                                       'Name' => 'serf_ssl_need_server_cert_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '53596' => {
                                       'Name' => 'apr_status_t(*)(void*, int, serf_ssl_certificate_t const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '191'
                                                           },
                                                    '2' => {
                                                             'type' => '53627'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '53627' => {
                                       'BaseType' => '53633',
                                       'Name' => 'serf_ssl_certificate_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '53633' => {
                                       'BaseType' => '53454',
                                       'Name' => 'serf_ssl_certificate_t const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '53638' => {
                                       'BaseType' => '53650',
                                       'Header' => 'serf_bucket_types.h',
                                       'Line' => '495',
                                       'Name' => 'serf_ssl_server_cert_chain_cb_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '53650' => {
                                       'Name' => 'apr_status_t(*)(void*, int, int, serf_ssl_certificate_t const*const*, apr_size_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '234'
                                                           },
                                                    '1' => {
                                                             'type' => '191'
                                                           },
                                                    '2' => {
                                                             'type' => '191'
                                                           },
                                                    '3' => {
                                                             'type' => '53691'
                                                           },
                                                    '4' => {
                                                             'type' => '334'
                                                           }
                                                  },
                                       'Return' => '358',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '53691' => {
                                       'BaseType' => '53697',
                                       'Name' => 'serf_ssl_certificate_t const*const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '53697' => {
                                       'BaseType' => '53627',
                                       'Name' => 'serf_ssl_certificate_t const*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '53842' => {
                                       'Name' => 'int(*)(void const*, void const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '16919'
                                                           },
                                                    '1' => {
                                                             'type' => '16919'
                                                           }
                                                  },
                                       'Return' => '191',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '53868' => {
                                       'Header' => 'stack.h',
                                       'Line' => '66',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'num',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'data',
                                                            'offset' => '8',
                                                            'type' => '11835'
                                                          },
                                                   '2' => {
                                                            'name' => 'sorted',
                                                            'offset' => '16',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'num_alloc',
                                                            'offset' => '20',
                                                            'type' => '191'
                                                          },
                                                   '4' => {
                                                            'name' => 'comp',
                                                            'offset' => '24',
                                                            'type' => '53842'
                                                          }
                                                 },
                                       'Name' => 'struct stack_st',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '53941' => {
                                       'BaseType' => '53868',
                                       'Header' => 'stack.h',
                                       'Line' => '72',
                                       'Name' => '_STACK',
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '53952' => {
                                       'BaseType' => '53963',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '83',
                                       'Name' => 'ASN1_INTEGER',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '53963' => {
                                       'Header' => 'asn1.h',
                                       'Line' => '239',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'length',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'type',
                                                            'offset' => '4',
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'name' => 'data',
                                                            'offset' => '8',
                                                            'type' => '46083'
                                                          },
                                                   '3' => {
                                                            'name' => 'flags',
                                                            'offset' => '16',
                                                            'type' => '198'
                                                          }
                                                 },
                                       'Name' => 'struct asn1_string_st',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '54024' => {
                                       'BaseType' => '53963',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '84',
                                       'Name' => 'ASN1_ENUMERATED',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '54035' => {
                                       'BaseType' => '53963',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '85',
                                       'Name' => 'ASN1_BIT_STRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '54046' => {
                                       'BaseType' => '53963',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '86',
                                       'Name' => 'ASN1_OCTET_STRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '54057' => {
                                       'BaseType' => '53963',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '87',
                                       'Name' => 'ASN1_PRINTABLESTRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '54068' => {
                                       'BaseType' => '53963',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '88',
                                       'Name' => 'ASN1_T61STRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '54079' => {
                                       'BaseType' => '53963',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '89',
                                       'Name' => 'ASN1_IA5STRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '54090' => {
                                       'BaseType' => '53963',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '90',
                                       'Name' => 'ASN1_GENERALSTRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '54101' => {
                                       'BaseType' => '53963',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '91',
                                       'Name' => 'ASN1_UNIVERSALSTRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '54112' => {
                                       'BaseType' => '53963',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '92',
                                       'Name' => 'ASN1_BMPSTRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '54123' => {
                                       'BaseType' => '53963',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '93',
                                       'Name' => 'ASN1_UTCTIME',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '54134' => {
                                       'BaseType' => '53963',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '94',
                                       'Name' => 'ASN1_TIME',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '54145' => {
                                       'BaseType' => '53963',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '95',
                                       'Name' => 'ASN1_GENERALIZEDTIME',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '54156' => {
                                       'BaseType' => '53963',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '96',
                                       'Name' => 'ASN1_VISIBLESTRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '54167' => {
                                       'BaseType' => '53963',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '97',
                                       'Name' => 'ASN1_UTF8STRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '54178' => {
                                       'BaseType' => '53963',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '98',
                                       'Name' => 'ASN1_STRING',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '54189' => {
                                       'BaseType' => '191',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '99',
                                       'Name' => 'ASN1_BOOLEAN',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '54200' => {
                                       'BaseType' => '54211',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '103',
                                       'Name' => 'ASN1_OBJECT',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '54211' => {
                                       'Header' => 'asn1.h',
                                       'Line' => '210',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'sn',
                                                            'offset' => '0',
                                                            'type' => '369'
                                                          },
                                                   '1' => {
                                                            'name' => 'ln',
                                                            'offset' => '8',
                                                            'type' => '369'
                                                          },
                                                   '2' => {
                                                            'name' => 'nid',
                                                            'offset' => '16',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'length',
                                                            'offset' => '20',
                                                            'type' => '191'
                                                          },
                                                   '4' => {
                                                            'name' => 'data',
                                                            'offset' => '24',
                                                            'type' => '62019'
                                                          },
                                                   '5' => {
                                                            'name' => 'flags',
                                                            'offset' => '32',
                                                            'type' => '191'
                                                          }
                                                 },
                                       'Name' => 'struct asn1_object_st',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '54294' => {
                                       'BaseType' => '54305',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '120',
                                       'Name' => 'BIGNUM',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '54305' => {
                                       'Header' => 'bn.h',
                                       'Line' => '313',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'd',
                                                            'offset' => '0',
                                                            'type' => '61874'
                                                          },
                                                   '1' => {
                                                            'name' => 'top',
                                                            'offset' => '8',
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'name' => 'dmax',
                                                            'offset' => '12',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'neg',
                                                            'offset' => '16',
                                                            'type' => '191'
                                                          },
                                                   '4' => {
                                                            'name' => 'flags',
                                                            'offset' => '20',
                                                            'type' => '191'
                                                          }
                                                 },
                                       'Name' => 'struct bignum_st',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '54382' => {
                                       'BaseType' => '54393',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '121',
                                       'Name' => 'BN_CTX',
                                       'Type' => 'Typedef'
                                     },
                          '54393' => {
                                       'Name' => 'struct bignum_ctx',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '54398' => {
                                       'BaseType' => '54409',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '122',
                                       'Name' => 'BN_BLINDING',
                                       'Type' => 'Typedef'
                                     },
                          '54409' => {
                                       'Name' => 'struct bn_blinding_st',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '54414' => {
                                       'BaseType' => '54425',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '123',
                                       'Name' => 'BN_MONT_CTX',
                                       'Size' => '104',
                                       'Type' => 'Typedef'
                                     },
                          '54425' => {
                                       'Header' => 'bn.h',
                                       'Line' => '324',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ri',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'RR',
                                                            'offset' => '8',
                                                            'type' => '54294'
                                                          },
                                                   '2' => {
                                                            'name' => 'N',
                                                            'offset' => '32',
                                                            'type' => '54294'
                                                          },
                                                   '3' => {
                                                            'name' => 'Ni',
                                                            'offset' => '56',
                                                            'type' => '54294'
                                                          },
                                                   '4' => {
                                                            'name' => 'n0',
                                                            'offset' => '80',
                                                            'type' => '61880'
                                                          },
                                                   '5' => {
                                                            'name' => 'flags',
                                                            'offset' => '96',
                                                            'type' => '191'
                                                          }
                                                 },
                                       'Name' => 'struct bn_mont_ctx_st',
                                       'PrivateABI' => 1,
                                       'Size' => '104',
                                       'Type' => 'Struct'
                                     },
                          '54511' => {
                                       'BaseType' => '54522',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '125',
                                       'Name' => 'BN_GENCB',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '54522' => {
                                       'Header' => 'bn.h',
                                       'Line' => '349',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ver',
                                                            'offset' => '0',
                                                            'type' => '163'
                                                          },
                                                   '1' => {
                                                            'name' => 'arg',
                                                            'offset' => '8',
                                                            'type' => '234'
                                                          },
                                                   '2' => {
                                                            'name' => 'cb',
                                                            'offset' => '16',
                                                            'type' => '61896'
                                                          }
                                                 },
                                       'Name' => 'struct bn_gencb_st',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '54574' => {
                                       'BaseType' => '54585',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '127',
                                       'Name' => 'BUF_MEM',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '54585' => {
                                       'Header' => 'buffer.h',
                                       'Line' => '77',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'length',
                                                            'offset' => '0',
                                                            'type' => '260'
                                                          },
                                                   '1' => {
                                                            'name' => 'data',
                                                            'offset' => '8',
                                                            'type' => '236'
                                                          },
                                                   '2' => {
                                                            'name' => 'max',
                                                            'offset' => '16',
                                                            'type' => '260'
                                                          }
                                                 },
                                       'Name' => 'struct buf_mem_st',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '54634' => {
                                       'BaseType' => '54645',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '129',
                                       'Name' => 'EVP_CIPHER',
                                       'Size' => '88',
                                       'Type' => 'Typedef'
                                     },
                          '54645' => {
                                       'Header' => 'evp.h',
                                       'Line' => '311',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'nid',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'block_size',
                                                            'offset' => '4',
                                                            'type' => '191'
                                                          },
                                                   '10' => {
                                                             'name' => 'get_asn1_parameters',
                                                             'offset' => '64',
                                                             'type' => '63119'
                                                           },
                                                   '11' => {
                                                             'name' => 'ctrl',
                                                             'offset' => '72',
                                                             'type' => '63155'
                                                           },
                                                   '12' => {
                                                             'name' => 'app_data',
                                                             'offset' => '80',
                                                             'type' => '234'
                                                           },
                                                   '2' => {
                                                            'name' => 'key_len',
                                                            'offset' => '8',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'iv_len',
                                                            'offset' => '12',
                                                            'type' => '191'
                                                          },
                                                   '4' => {
                                                            'name' => 'flags',
                                                            'offset' => '16',
                                                            'type' => '170'
                                                          },
                                                   '5' => {
                                                            'name' => 'init',
                                                            'offset' => '24',
                                                            'type' => '63030'
                                                          },
                                                   '6' => {
                                                            'name' => 'do_cipher',
                                                            'offset' => '32',
                                                            'type' => '63066'
                                                          },
                                                   '7' => {
                                                            'name' => 'cleanup',
                                                            'offset' => '40',
                                                            'type' => '63087'
                                                          },
                                                   '8' => {
                                                            'name' => 'ctx_size',
                                                            'offset' => '48',
                                                            'type' => '191'
                                                          },
                                                   '9' => {
                                                            'name' => 'set_asn1_parameters',
                                                            'offset' => '56',
                                                            'type' => '63119'
                                                          }
                                                 },
                                       'Name' => 'struct evp_cipher_st',
                                       'PrivateABI' => 1,
                                       'Size' => '88',
                                       'Type' => 'Struct'
                                     },
                          '54828' => {
                                       'BaseType' => '54839',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '130',
                                       'Name' => 'EVP_CIPHER_CTX',
                                       'Size' => '168',
                                       'Type' => 'Typedef'
                                     },
                          '54839' => {
                                       'Header' => 'evp.h',
                                       'Line' => '452',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cipher',
                                                            'offset' => '0',
                                                            'type' => '63161'
                                                          },
                                                   '1' => {
                                                            'name' => 'engine',
                                                            'offset' => '8',
                                                            'type' => '62669'
                                                          },
                                                   '10' => {
                                                             'name' => 'flags',
                                                             'offset' => '112',
                                                             'type' => '170'
                                                           },
                                                   '11' => {
                                                             'name' => 'cipher_data',
                                                             'offset' => '120',
                                                             'type' => '234'
                                                           },
                                                   '12' => {
                                                             'name' => 'final_used',
                                                             'offset' => '128',
                                                             'type' => '191'
                                                           },
                                                   '13' => {
                                                             'name' => 'block_mask',
                                                             'offset' => '132',
                                                             'type' => '191'
                                                           },
                                                   '14' => {
                                                             'name' => 'final',
                                                             'offset' => '136',
                                                             'type' => '63188'
                                                           },
                                                   '2' => {
                                                            'name' => 'encrypt',
                                                            'offset' => '16',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'buf_len',
                                                            'offset' => '20',
                                                            'type' => '191'
                                                          },
                                                   '4' => {
                                                            'name' => 'oiv',
                                                            'offset' => '24',
                                                            'type' => '63172'
                                                          },
                                                   '5' => {
                                                            'name' => 'iv',
                                                            'offset' => '40',
                                                            'type' => '63172'
                                                          },
                                                   '6' => {
                                                            'name' => 'buf',
                                                            'offset' => '56',
                                                            'type' => '63188'
                                                          },
                                                   '7' => {
                                                            'name' => 'num',
                                                            'offset' => '88',
                                                            'type' => '191'
                                                          },
                                                   '8' => {
                                                            'name' => 'app_data',
                                                            'offset' => '96',
                                                            'type' => '234'
                                                          },
                                                   '9' => {
                                                            'name' => 'key_len',
                                                            'offset' => '104',
                                                            'type' => '191'
                                                          }
                                                 },
                                       'Name' => 'struct evp_cipher_ctx_st',
                                       'PrivateABI' => 1,
                                       'Size' => '168',
                                       'Type' => 'Struct'
                                     },
                          '55047' => {
                                       'BaseType' => '55058',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '131',
                                       'Name' => 'EVP_MD',
                                       'Size' => '120',
                                       'Type' => 'Typedef'
                                     },
                          '55058' => {
                                       'Header' => 'evp.h',
                                       'Line' => '164',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'pkey_type',
                                                            'offset' => '4',
                                                            'type' => '191'
                                                          },
                                                   '10' => {
                                                             'name' => 'verify',
                                                             'offset' => '72',
                                                             'type' => '62919'
                                                           },
                                                   '11' => {
                                                             'name' => 'required_pkey_type',
                                                             'offset' => '80',
                                                             'type' => '62925'
                                                           },
                                                   '12' => {
                                                             'name' => 'block_size',
                                                             'offset' => '100',
                                                             'type' => '191'
                                                           },
                                                   '13' => {
                                                             'name' => 'ctx_size',
                                                             'offset' => '104',
                                                             'type' => '191'
                                                           },
                                                   '14' => {
                                                             'name' => 'md_ctrl',
                                                             'offset' => '112',
                                                             'type' => '62971'
                                                           },
                                                   '2' => {
                                                            'name' => 'md_size',
                                                            'offset' => '8',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'flags',
                                                            'offset' => '16',
                                                            'type' => '170'
                                                          },
                                                   '4' => {
                                                            'name' => 'init',
                                                            'offset' => '24',
                                                            'type' => '62727'
                                                          },
                                                   '5' => {
                                                            'name' => 'update',
                                                            'offset' => '32',
                                                            'type' => '62758'
                                                          },
                                                   '6' => {
                                                            'name' => 'final',
                                                            'offset' => '40',
                                                            'type' => '62784'
                                                          },
                                                   '7' => {
                                                            'name' => 'copy',
                                                            'offset' => '48',
                                                            'type' => '62821'
                                                          },
                                                   '8' => {
                                                            'name' => 'cleanup',
                                                            'offset' => '56',
                                                            'type' => '62727'
                                                          },
                                                   '9' => {
                                                            'name' => 'sign',
                                                            'offset' => '64',
                                                            'type' => '62873'
                                                          }
                                                 },
                                       'Name' => 'struct env_md_st',
                                       'PrivateABI' => 1,
                                       'Size' => '120',
                                       'Type' => 'Struct'
                                     },
                          '55251' => {
                                       'BaseType' => '55262',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '132',
                                       'Name' => 'EVP_MD_CTX',
                                       'Size' => '48',
                                       'Type' => 'Typedef'
                                     },
                          '55262' => {
                                       'Header' => 'evp.h',
                                       'Line' => '272',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'digest',
                                                            'offset' => '0',
                                                            'type' => '62977'
                                                          },
                                                   '1' => {
                                                            'name' => 'engine',
                                                            'offset' => '8',
                                                            'type' => '62669'
                                                          },
                                                   '2' => {
                                                            'name' => 'flags',
                                                            'offset' => '16',
                                                            'type' => '170'
                                                          },
                                                   '3' => {
                                                            'name' => 'md_data',
                                                            'offset' => '24',
                                                            'type' => '234'
                                                          },
                                                   '4' => {
                                                            'name' => 'pctx',
                                                            'offset' => '32',
                                                            'type' => '62988'
                                                          },
                                                   '5' => {
                                                            'name' => 'update',
                                                            'offset' => '40',
                                                            'type' => '62758'
                                                          }
                                                 },
                                       'Name' => 'struct env_md_ctx_st',
                                       'PrivateABI' => 1,
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '55354' => {
                                       'BaseType' => '55365',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '133',
                                       'Name' => 'EVP_PKEY',
                                       'Size' => '56',
                                       'Type' => 'Typedef'
                                     },
                          '55365' => {
                                       'Header' => 'evp.h',
                                       'Line' => '133',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'save_type',
                                                            'offset' => '4',
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'name' => 'references',
                                                            'offset' => '8',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'ameth',
                                                            'offset' => '16',
                                                            'type' => '62658'
                                                          },
                                                   '4' => {
                                                            'name' => 'engine',
                                                            'offset' => '24',
                                                            'type' => '62669'
                                                          },
                                                   '5' => {
                                                            'name' => 'pkey',
                                                            'offset' => '32',
                                                            'type' => '62567'
                                                          },
                                                   '6' => {
                                                            'name' => 'save_parameters',
                                                            'offset' => '40',
                                                            'type' => '191'
                                                          },
                                                   '7' => {
                                                            'name' => 'attributes',
                                                            'offset' => '48',
                                                            'type' => '62700'
                                                          }
                                                 },
                                       'Name' => 'struct evp_pkey_st',
                                       'PrivateABI' => 1,
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '55474' => {
                                       'BaseType' => '55485',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '135',
                                       'Name' => 'EVP_PKEY_ASN1_METHOD',
                                       'Type' => 'Typedef'
                                     },
                          '55485' => {
                                       'Name' => 'struct evp_pkey_asn1_method_st',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '55490' => {
                                       'BaseType' => '55501',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '138',
                                       'Name' => 'EVP_PKEY_CTX',
                                       'Type' => 'Typedef'
                                     },
                          '55501' => {
                                       'Name' => 'struct evp_pkey_ctx_st',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '55506' => {
                                       'BaseType' => '55516',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '140',
                                       'Name' => 'DH',
                                       'Size' => '144',
                                       'Type' => 'Typedef'
                                     },
                          '55516' => {
                                       'Header' => 'dh.h',
                                       'Line' => '138',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pad',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '4',
                                                            'type' => '191'
                                                          },
                                                   '10' => {
                                                             'name' => 'j',
                                                             'offset' => '72',
                                                             'type' => '63216'
                                                           },
                                                   '11' => {
                                                             'name' => 'seed',
                                                             'offset' => '80',
                                                             'type' => '46083'
                                                           },
                                                   '12' => {
                                                             'name' => 'seedlen',
                                                             'offset' => '88',
                                                             'type' => '191'
                                                           },
                                                   '13' => {
                                                             'name' => 'counter',
                                                             'offset' => '96',
                                                             'type' => '63216'
                                                           },
                                                   '14' => {
                                                             'name' => 'references',
                                                             'offset' => '104',
                                                             'type' => '191'
                                                           },
                                                   '15' => {
                                                             'name' => 'ex_data',
                                                             'offset' => '112',
                                                             'type' => '60878'
                                                           },
                                                   '16' => {
                                                             'name' => 'meth',
                                                             'offset' => '128',
                                                             'type' => '63713'
                                                           },
                                                   '17' => {
                                                             'name' => 'engine',
                                                             'offset' => '136',
                                                             'type' => '62669'
                                                           },
                                                   '2' => {
                                                            'name' => 'p',
                                                            'offset' => '8',
                                                            'type' => '63216'
                                                          },
                                                   '3' => {
                                                            'name' => 'g',
                                                            'offset' => '16',
                                                            'type' => '63216'
                                                          },
                                                   '4' => {
                                                            'name' => 'length',
                                                            'offset' => '24',
                                                            'type' => '198'
                                                          },
                                                   '5' => {
                                                            'name' => 'pub_key',
                                                            'offset' => '32',
                                                            'type' => '63216'
                                                          },
                                                   '6' => {
                                                            'name' => 'priv_key',
                                                            'offset' => '40',
                                                            'type' => '63216'
                                                          },
                                                   '7' => {
                                                            'name' => 'flags',
                                                            'offset' => '48',
                                                            'type' => '191'
                                                          },
                                                   '8' => {
                                                            'name' => 'method_mont_p',
                                                            'offset' => '56',
                                                            'type' => '63362'
                                                          },
                                                   '9' => {
                                                            'name' => 'q',
                                                            'offset' => '64',
                                                            'type' => '63216'
                                                          }
                                                 },
                                       'Name' => 'struct dh_st',
                                       'PrivateABI' => 1,
                                       'Size' => '144',
                                       'Type' => 'Struct'
                                     },
                          '55737' => {
                                       'BaseType' => '55748',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '141',
                                       'Name' => 'DH_METHOD',
                                       'Size' => '72',
                                       'Type' => 'Typedef'
                                     },
                          '55748' => {
                                       'Header' => 'dh.h',
                                       'Line' => '120',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '369'
                                                          },
                                                   '1' => {
                                                            'name' => 'generate_key',
                                                            'offset' => '8',
                                                            'type' => '63578'
                                                          },
                                                   '2' => {
                                                            'name' => 'compute_key',
                                                            'offset' => '16',
                                                            'type' => '63609'
                                                          },
                                                   '3' => {
                                                            'name' => 'bn_mod_exp',
                                                            'offset' => '24',
                                                            'type' => '63671'
                                                          },
                                                   '4' => {
                                                            'name' => 'init',
                                                            'offset' => '32',
                                                            'type' => '63578'
                                                          },
                                                   '5' => {
                                                            'name' => 'finish',
                                                            'offset' => '40',
                                                            'type' => '63578'
                                                          },
                                                   '6' => {
                                                            'name' => 'flags',
                                                            'offset' => '48',
                                                            'type' => '191'
                                                          },
                                                   '7' => {
                                                            'name' => 'app_data',
                                                            'offset' => '56',
                                                            'type' => '236'
                                                          },
                                                   '8' => {
                                                            'name' => 'generate_params',
                                                            'offset' => '64',
                                                            'type' => '63707'
                                                          }
                                                 },
                                       'Name' => 'struct dh_method',
                                       'PrivateABI' => 1,
                                       'Size' => '72',
                                       'Type' => 'Struct'
                                     },
                          '55869' => {
                                       'BaseType' => '55880',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '143',
                                       'Name' => 'DSA',
                                       'Size' => '136',
                                       'Type' => 'Typedef'
                                     },
                          '55880' => {
                                       'Header' => 'dsa.h',
                                       'Line' => '158',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pad',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '8',
                                                            'type' => '198'
                                                          },
                                                   '10' => {
                                                             'name' => 'flags',
                                                             'offset' => '80',
                                                             'type' => '191'
                                                           },
                                                   '11' => {
                                                             'name' => 'method_mont_p',
                                                             'offset' => '88',
                                                             'type' => '63362'
                                                           },
                                                   '12' => {
                                                             'name' => 'references',
                                                             'offset' => '96',
                                                             'type' => '191'
                                                           },
                                                   '13' => {
                                                             'name' => 'ex_data',
                                                             'offset' => '104',
                                                             'type' => '60878'
                                                           },
                                                   '14' => {
                                                             'name' => 'meth',
                                                             'offset' => '120',
                                                             'type' => '64073'
                                                           },
                                                   '15' => {
                                                             'name' => 'engine',
                                                             'offset' => '128',
                                                             'type' => '62669'
                                                           },
                                                   '2' => {
                                                            'name' => 'write_params',
                                                            'offset' => '16',
                                                            'type' => '191'
                                                          },
                                                   '3' => {
                                                            'name' => 'p',
                                                            'offset' => '24',
                                                            'type' => '63216'
                                                          },
                                                   '4' => {
                                                            'name' => 'q',
                                                            'offset' => '32',
                                                            'type' => '63216'
                                                          },
                                                   '5' => {
                                                            'name' => 'g',
                                                            'offset' => '40',
                                                            'type' => '63216'
                                                          },
                                                   '6' => {
                                                            'name' => 'pub_key',
                                                            'offset' => '48',
                                                            'type' => '63216'
                                                          },
                                                   '7' => {
                                                            'name' => 'priv_key',
                                                            'offset' => '56',
                                                            'type' => '63216'
                                                          },
                                                   '8' => {
                                                            'name' => 'kinv',
                                                            'offset' => '64',
                                                            'type' => '63216'
                                                          },
                                                   '9' => {
                                                            'name' => 'r',
                                                            'offset' => '72',
                                                            'type' => '63216'
                                                          }
                                                 },
                                       'Name' => 'struct dsa_st',
                                       'PrivateABI' => 1,
                                       'Size' => '136',
                                       'Type' => 'Struct'
                                     },
                          '56077' => {
                                       'BaseType' => '56088',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '144',
                                       'Name' => 'DSA_METHOD',
                                       'Size' => '96',
                                       'Type' => 'Typedef'
                                     },
                          '56088' => {
                                       'Header' => 'dsa.h',
                                       'Line' => '132',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '369'
                                                          },
                                                   '1' => {
                                                            'name' => 'dsa_do_sign',
                                                            'offset' => '8',
                                                            'type' => '63805'
                                                          },
                                                   '10' => {
                                                             'name' => 'dsa_paramgen',
                                                             'offset' => '80',
                                                             'type' => '64067'
                                                           },
                                                   '11' => {
                                                             'name' => 'dsa_keygen',
                                                             'offset' => '88',
                                                             'type' => '64016'
                                                           },
                                                   '2' => {
                                                            'name' => 'dsa_sign_setup',
                                                            'offset' => '16',
                                                            'type' => '63847'
                                                          },
                                                   '3' => {
                                                            'name' => 'dsa_do_verify',
                                                            'offset' => '24',
                                                            'type' => '63883'
                                                          },
                                                   '4' => {
                                                            'name' => 'dsa_mod_exp',
                                                            'offset' => '32',
                                                            'type' => '63944'
                                                          },
                                                   '5' => {
                                                            'name' => 'bn_mod_exp',
                                                            'offset' => '40',
                                                            'type' => '63995'
                                                          },
                                                   '6' => {
                                                            'name' => 'init',
                                                            'offset' => '48',
                                                            'type' => '64016'
                                                          },
                                                   '7' => {
                                                            'name' => 'finish',
                                                            'offset' => '56',
                                                            'type' => '64016'
                                                          },
                                                   '8' => {
                                                            'name' => 'flags',
                                                            'offset' => '64',
                                                            'type' => '191'
                                                          },
                                                   '9' => {
                                                            'name' => 'app_data',
                                                            'offset' => '72',
                                                            'type' => '236'
                                                          }
                                                 },
                                       'Name' => 'struct dsa_method',
                                       'PrivateABI' => 1,
                                       'Size' => '96',
                                       'Type' => 'Struct'
                                     },
                          '56245' => {
                                       'BaseType' => '56256',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '146',
                                       'Name' => 'RSA',
                                       'Size' => '168',
                                       'Type' => 'Typedef'
                                     },
                          '56256' => {
                                       'Header' => 'rsa.h',
                                       'Line' => '132',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pad',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'version',
                                                            'offset' => '8',
                                                            'type' => '198'
                                                          },
                                                   '10' => {
                                                             'name' => 'dmq1',
                                                             'offset' => '80',
                                                             'type' => '63216'
                                                           },
                                                   '11' => {
                                                             'name' => 'iqmp',
                                                             'offset' => '88',
                                                             'type' => '63216'
                                                           },
                                                   '12' => {
                                                             'name' => 'ex_data',
                                                             'offset' => '96',
                                                             'type' => '60878'
                                                           },
                                                   '13' => {
                                                             'name' => 'references',
                                                             'offset' => '112',
                                                             'type' => '191'
                                                           },
                                                   '14' => {
                                                             'name' => 'flags',
                                                             'offset' => '116',
                                                             'type' => '191'
                                                           },
                                                   '15' => {
                                                             'name' => '_method_mod_n',
                                                             'offset' => '120',
                                                             'type' => '63362'
                                                           },
                                                   '16' => {
                                                             'name' => '_method_mod_p',
                                                             'offset' => '128',
                                                             'type' => '63362'
                                                           },
                                                   '17' => {
                                                             'name' => '_method_mod_q',
                                                             'offset' => '136',
                                                             'type' => '63362'
                                                           },
                                                   '18' => {
                                                             'name' => 'bignum_data',
                                                             'offset' => '144',
                                                             'type' => '236'
                                                           },
                                                   '19' => {
                                                             'name' => 'blinding',
                                                             'offset' => '152',
                                                             'type' => '63545'
                                                           },
                                                   '2' => {
                                                            'name' => 'meth',
                                                            'offset' => '16',
                                                            'type' => '63534'
                                                          },
                                                   '20' => {
                                                             'name' => 'mt_blinding',
                                                             'offset' => '160',
                                                             'type' => '63545'
                                                           },
                                                   '3' => {
                                                            'name' => 'engine',
                                                            'offset' => '24',
                                                            'type' => '62669'
                                                          },
                                                   '4' => {
                                                            'name' => 'n',
                                                            'offset' => '32',
                                                            'type' => '63216'
                                                          },
                                                   '5' => {
                                                            'name' => 'e',
                                                            'offset' => '40',
                                                            'type' => '63216'
                                                          },
                                                   '6' => {
                                                            'name' => 'd',
                                                            'offset' => '48',
                                                            'type' => '63216'
                                                          },
                                                   '7' => {
                                                            'name' => 'p',
                                                            'offset' => '56',
                                                            'type' => '63216'
                                                          },
                                                   '8' => {
                                                            'name' => 'q',
                                                            'offset' => '64',
                                                            'type' => '63216'
                                                          },
                                                   '9' => {
                                                            'name' => 'dmp1',
                                                            'offset' => '72',
                                                            'type' => '63216'
                                                          }
                                                 },
                                       'Name' => 'struct rsa_st',
                                       'PrivateABI' => 1,
                                       'Size' => '168',
                                       'Type' => 'Struct'
                                     },
                          '56511' => {
                                       'BaseType' => '56522',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '147',
                                       'Name' => 'RSA_METHOD',
                                       'Size' => '112',
                                       'Type' => 'Typedef'
                                     },
                          '56522' => {
                                       'Header' => 'rsa.h',
                                       'Line' => '85',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '369'
                                                          },
                                                   '1' => {
                                                            'name' => 'rsa_pub_enc',
                                                            'offset' => '8',
                                                            'type' => '63263'
                                                          },
                                                   '10' => {
                                                             'name' => 'app_data',
                                                             'offset' => '80',
                                                             'type' => '236'
                                                           },
                                                   '11' => {
                                                             'name' => 'rsa_sign',
                                                             'offset' => '88',
                                                             'type' => '63446'
                                                           },
                                                   '12' => {
                                                             'name' => 'rsa_verify',
                                                             'offset' => '96',
                                                             'type' => '63492'
                                                           },
                                                   '13' => {
                                                             'name' => 'rsa_keygen',
                                                             'offset' => '104',
                                                             'type' => '63528'
                                                           },
                                                   '2' => {
                                                            'name' => 'rsa_pub_dec',
                                                            'offset' => '16',
                                                            'type' => '63263'
                                                          },
                                                   '3' => {
                                                            'name' => 'rsa_priv_enc',
                                                            'offset' => '24',
                                                            'type' => '63263'
                                                          },
                                                   '4' => {
                                                            'name' => 'rsa_priv_dec',
                                                            'offset' => '32',
                                                            'type' => '63263'
                                                          },
                                                   '5' => {
                                                            'name' => 'rsa_mod_exp',
                                                            'offset' => '40',
                                                            'type' => '63316'
                                                          },
                                                   '6' => {
                                                            'name' => 'bn_mod_exp',
                                                            'offset' => '48',
                                                            'type' => '63368'
                                                          },
                                                   '7' => {
                                                            'name' => 'init',
                                                            'offset' => '56',
                                                            'type' => '63389'
                                                          },
                                                   '8' => {
                                                            'name' => 'finish',
                                                            'offset' => '64',
                                                            'type' => '63389'
                                                          },
                                                   '9' => {
                                                            'name' => 'flags',
                                                            'offset' => '72',
                                                            'type' => '191'
                                                          }
                                                 },
                                       'Name' => 'struct rsa_meth_st',
                                       'PrivateABI' => 1,
                                       'Size' => '112',
                                       'Type' => 'Struct'
                                     },
                          '56703' => {
                                       'BaseType' => '56714',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '154',
                                       'Name' => 'X509',
                                       'Size' => '184',
                                       'Type' => 'Typedef'
                                     },
                          '56714' => {
                                       'Header' => 'x509.h',
                                       'Line' => '270',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cert_info',
                                                            'offset' => '0',
                                                            'type' => '64600'
                                                          },
                                                   '1' => {
                                                            'name' => 'sig_alg',
                                                            'offset' => '8',
                                                            'type' => '63551'
                                                          },
                                                   '10' => {
                                                             'name' => 'ex_kusage',
                                                             'offset' => '80',
                                                             'type' => '170'
                                                           },
                                                   '11' => {
                                                             'name' => 'ex_xkusage',
                                                             'offset' => '88',
                                                             'type' => '170'
                                                           },
                                                   '12' => {
                                                             'name' => 'ex_nscert',
                                                             'offset' => '96',
                                                             'type' => '170'
                                                           },
                                                   '13' => {
                                                             'name' => 'skid',
                                                             'offset' => '104',
                                                             'type' => '62410'
                                                           },
                                                   '14' => {
                                                             'name' => 'akid',
                                                             'offset' => '112',
                                                             'type' => '64606'
                                                           },
                                                   '15' => {
                                                             'name' => 'policy_cache',
                                                             'offset' => '120',
                                                             'type' => '64612'
                                                           },
                                                   '16' => {
                                                             'name' => 'crldp',
                                                             'offset' => '128',
                                                             'type' => '64645'
                                                           },
                                                   '17' => {
                                                             'name' => 'altname',
                                                             'offset' => '136',
                                                             'type' => '64676'
                                                           },
                                                   '18' => {
                                                             'name' => 'nc',
                                                             'offset' => '144',
                                                             'type' => '64682'
                                                           },
                                                   '19' => {
                                                             'name' => 'sha1_hash',
                                                             'offset' => '152',
                                                             'type' => '64688'
                                                           },
                                                   '2' => {
                                                            'name' => 'signature',
                                                            'offset' => '16',
                                                            'type' => '62404'
                                                          },
                                                   '20' => {
                                                             'name' => 'aux',
                                                             'offset' => '176',
                                                             'type' => '64704'
                                                           },
                                                   '3' => {
                                                            'name' => 'valid',
                                                            'offset' => '24',
                                                            'type' => '191'
                                                          },
                                                   '4' => {
                                                            'name' => 'references',
                                                            'offset' => '28',
                                                            'type' => '191'
                                                          },
                                                   '5' => {
                                                            'name' => 'name',
                                                            'offset' => '32',
                                                            'type' => '236'
                                                          },
                                                   '6' => {
                                                            'name' => 'ex_data',
                                                            'offset' => '40',
                                                            'type' => '60878'
                                                          },
                                                   '7' => {
                                                            'name' => 'ex_pathlen',
                                                            'offset' => '56',
                                                            'type' => '198'
                                                          },
                                                   '8' => {
                                                            'name' => 'ex_pcpathlen',
                                                            'offset' => '64',
                                                            'type' => '198'
                                                          },
                                                   '9' => {
                                                            'name' => 'ex_flags',
                                                            'offset' => '72',
                                                            'type' => '170'
                                                          }
                                                 },
                                       'Name' => 'struct x509_st',
                                       'PrivateABI' => 1,
                                       'Size' => '184',
                                       'Type' => 'Struct'
                                     },
                          '57000' => {
                                       'BaseType' => '57011',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '155',
                                       'Name' => 'X509_ALGOR',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '57011' => {
                                       'Header' => 'x509.h',
                                       'Line' => '143',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'algorithm',
                                                            'offset' => '0',
                                                            'type' => '62386'
                                                          },
                                                   '1' => {
                                                            'name' => 'parameter',
                                                            'offset' => '8',
                                                            'type' => '63113'
                                                          }
                                                 },
                                       'Name' => 'struct X509_algor_st',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '57048' => {
                                       'BaseType' => '57059',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '156',
                                       'Name' => 'X509_CRL',
                                       'Size' => '120',
                                       'Type' => 'Typedef'
                                     },
                          '57059' => {
                                       'Header' => 'x509.h',
                                       'Line' => '452',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'crl',
                                                            'offset' => '0',
                                                            'type' => '64900'
                                                          },
                                                   '1' => {
                                                            'name' => 'sig_alg',
                                                            'offset' => '8',
                                                            'type' => '63551'
                                                          },
                                                   '10' => {
                                                             'name' => 'base_crl_number',
                                                             'offset' => '64',
                                                             'type' => '62392'
                                                           },
                                                   '11' => {
                                                             'name' => 'sha1_hash',
                                                             'offset' => '72',
                                                             'type' => '64688'
                                                           },
                                                   '12' => {
                                                             'name' => 'issuers',
                                                             'offset' => '96',
                                                             'type' => '64917'
                                                           },
                                                   '13' => {
                                                             'name' => 'meth',
                                                             'offset' => '104',
                                                             'type' => '64923'
                                                           },
                                                   '14' => {
                                                             'name' => 'meth_data',
                                                             'offset' => '112',
                                                             'type' => '234'
                                                           },
                                                   '2' => {
                                                            'name' => 'signature',
                                                            'offset' => '16',
                                                            'type' => '62404'
                                                          },
                                                   '3' => {
                                                            'name' => 'references',
                                                            'offset' => '24',
                                                            'type' => '191'
                                                          },
                                                   '4' => {
                                                            'name' => 'flags',
                                                            'offset' => '28',
                                                            'type' => '191'
                                                          },
                                                   '5' => {
                                                            'name' => 'akid',
                                                            'offset' => '32',
                                                            'type' => '64606'
                                                          },
                                                   '6' => {
                                                            'name' => 'idp',
                                                            'offset' => '40',
                                                            'type' => '64906'
                                                          },
                                                   '7' => {
                                                            'name' => 'idp_flags',
                                                            'offset' => '48',
                                                            'type' => '191'
                                                          },
                                                   '8' => {
                                                            'name' => 'idp_reasons',
                                                            'offset' => '52',
                                                            'type' => '191'
                                                          },
                                                   '9' => {
                                                            'name' => 'crl_number',
                                                            'offset' => '56',
                                                            'type' => '62392'
                                                          }
                                                 },
                                       'Name' => 'struct X509_crl_st',
                                       'PrivateABI' => 1,
                                       'Size' => '120',
                                       'Type' => 'Struct'
                                     },
                          '57268' => {
                                       'BaseType' => '57279',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '157',
                                       'Name' => 'X509_CRL_METHOD',
                                       'Type' => 'Typedef'
                                     },
                          '57279' => {
                                       'Name' => 'struct x509_crl_method_st',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '57284' => {
                                       'BaseType' => '57295',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '159',
                                       'Name' => 'X509_NAME',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '57295' => {
                                       'Header' => 'x509.h',
                                       'Line' => '179',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entries',
                                                            'offset' => '0',
                                                            'type' => '64244'
                                                          },
                                                   '1' => {
                                                            'name' => 'modified',
                                                            'offset' => '8',
                                                            'type' => '191'
                                                          },
                                                   '2' => {
                                                            'name' => 'bytes',
                                                            'offset' => '16',
                                                            'type' => '64250'
                                                          },
                                                   '3' => {
                                                            'name' => 'canon_enc',
                                                            'offset' => '24',
                                                            'type' => '46083'
                                                          },
                                                   '4' => {
                                                            'name' => 'canon_enclen',
                                                            'offset' => '32',
                                                            'type' => '191'
                                                          }
                                                 },
                                       'Name' => 'struct X509_name_st',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '57368' => {
                                       'BaseType' => '57379',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '160',
                                       'Name' => 'X509_PUBKEY',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '57379' => {
                                       'Header' => 'x509.h',
                                       'Line' => '157',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'algor',
                                                            'offset' => '0',
                                                            'type' => '63551'
                                                          },
                                                   '1' => {
                                                            'name' => 'public_key',
                                                            'offset' => '8',
                                                            'type' => '62404'
                                                          },
                                                   '2' => {
                                                            'name' => 'pkey',
                                                            'offset' => '16',
                                                            'type' => '64165'
                                                          }
                                                 },
                                       'Name' => 'struct X509_pubkey_st',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '57428' => {
                                       'BaseType' => '57439',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '161',
                                       'Name' => 'X509_STORE',
                                       'Size' => '144',
                                       'Type' => 'Typedef'
                                     },
                          '57439' => {
                                       'Header' => 'x509_vfy.h',
                                       'Line' => '186',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cache',
                                                            'offset' => '0',
                                                            'type' => '191'
                                                          },
                                                   '1' => {
                                                            'name' => 'objs',
                                                            'offset' => '8',
                                                            'type' => '65176'
                                                          },
                                                   '10' => {
                                                             'name' => 'check_crl',
                                                             'offset' => '80',
                                                             'type' => '65372'
                                                           },
                                                   '11' => {
                                                             'name' => 'cert_crl',
                                                             'offset' => '88',
                                                             'type' => '65403'
                                                           },
                                                   '12' => {
                                                             'name' => 'lookup_certs',
                                                             'offset' => '96',
                                                             'type' => '65429'
                                                           },
                                                   '13' => {
                                                             'name' => 'lookup_crls',
                                                             'offset' => '104',
                                                             'type' => '65461'
                                                           },
                                                   '14' => {
                                                             'name' => 'cleanup',
                                                             'offset' => '112',
                                                             'type' => '65215'
                                                           },
                                                   '15' => {
                                                             'name' => 'ex_data',
                                                             'offset' => '120',
                                                             'type' => '60878'
                                                           },
                                                   '16' => {
                                                             'name' => 'references',
                                                             'offset' => '136',
                                                             'type' => '191'
                                                           },
                                                   '2' => {
                                                            'name' => 'get_cert_methods',
                                                            'offset' => '16',
                                                            'type' => '65182'
                                                          },
                                                   '3' => {
                                                            'name' => 'param',
                                                            'offset' => '24',
                                                            'type' => '65188'
                                                          },
                                                   '4' => {
                                                            'name' => 'verify',
                                                            'offset' => '32',
                                                            'type' => '65215'
                                                          },
                                                   '5' => {
                                                            'name' => 'verify_cb',
                                                            'offset' => '40',
                                                            'type' => '65241'
                                                          },
                                                   '6' => {
                                                            'name' => 'get_issuer',
                                                            'offset' => '48',
                                                            'type' => '65278'
                                                          },
                                                   '7' => {
                                                            'name' => 'check_issued',
                                                            'offset' => '56',
                                                            'type' => '65309'
                                                          },
                                                   '8' => {
                                                            'name' => 'check_revocation',
                                                            'offset' => '64',
                                                            'type' => '65215'
                                                          },
                                                   '9' => {
                                                            'name' => 'get_crl',
                                                            'offset' => '72',
                                                            'type' => '65346'
                                                          }
                                                 },
                                       'Name' => 'struct x509_store_st',
                                       'PrivateABI' => 1,
                                       'Size' => '144',
                                       'Type' => 'Struct'
                                     },
                          '57656' => {
                                       'BaseType' => '57667',
                                       'Header' => 'ossl_typ.h',
                                       'Line' => '162',
                                       'Name' => 'X509_STORE_CTX',
                                       'Size' => '248',
                                       'Type' => 'Typedef'
                                     },
                          '57667' => {
                                       'Header' => 'x509_vfy.h',
                                       'Line' => '236',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ctx',
                                                            'offset' => '0',
                                                            'type' => '65467'
                                                          },
                                                   '1' => {
                                                            'name' => 'current_method',
                                                            'offset' => '8',
                                                            'type' => '191'
                                                          },
                                                   '10' => {
                                                             'name' => 'check_issued',
                                                             'offset' => '80',
                                                             'type' => '65309'
                                                           },
                                                   '11' => {
                                                             'name' => 'check_revocation',
                                                             'offset' => '88',
                                                             'type' => '65215'
                                                           },
                                                   '12' => {
                                                             'name' => 'get_crl',
                                                             'offset' => '96',
                                                             'type' => '65346'
                                                           },
                                                   '13' => {
                                                             'name' => 'check_crl',
                                                             'offset' => '104',
                                                             'type' => '65372'
                                                           },
                                                   '14' => {
                                                             'name' => 'cert_crl',
                                                             'offset' => '112',
                                                             'type' => '65403'
                                                           },
                                                   '15' => {
                                                             'name' => 'check_policy',
                                                             'offset' => '120',
                                                             'type' => '65215'
                                                           },
                                                   '16' => {
                                                             'name' => 'lookup_certs',
                                                             'offset' => '128',
                                                             'type' => '65429'
                                                           },
                                                   '17' => {
